{"id":477,"status":"Fixed","summary":"Cryptic error message on invalid \"@type function\" annotation","labels":["Type-Defect","Priority-Medium"],"stars":1,"commentCount":8,"comments":[{"id":0,"commenterId":3892267362573158838,"content":"\u003cb\u003eWhat steps will reproduce the problem?\u003c/b\u003e\n1.  test.js:\r\n\r\n    /**\r\n     * @type function\r\n     */\r\n    var callback;\r\n\r\n2. java -jar compiler.jar --js test.js \r\n\r\n\u003cb\u003eWhat is the expected output? What do you see instead?\u003c/b\u003e\n\r\nWarning reported is:\r\n\r\ntest.js:3: WARNING - Parse error. Unexpected end of file\r\n */\r\n  ^\r\n\r\nExpected to see the actual warning (e.g., \u0026quot;expected \u0027(\u0027\u0026quot;, for the *previous* line)\r\n\r\n\u003cb\u003eWhat version of the product are you using? On what operating system?\u003c/b\u003e\n\r\ncompiler-20110502\r\n\r\n\u003cb\u003ePlease provide any additional information below.\u003c/b\u003e\n\r\nSimply adding \u0026quot;()\u0026quot; to it (\u0026quot;@type function()\u0026quot;) removes the warning, but it would be much more effective if it could communicate that properly.","timestamp":1306946935,"attachments":[]},{"id":1,"commenterId":8173196008570380122,"content":"Actually the correct annotation would be:\r\n\r\n/**\r\n * @type {function}\r\n */\r\nvar callback;\r\n\r\nJSDoc type expressions are enclosed in braces.","timestamp":1306963148,"attachments":[]},{"id":2,"commenterId":3892267362573158838,"content":"Hmm, you\u0027re right that Closure does expect braces.  But \"JSDoc type expressions\" do NOT use braces -- based on the jsdoc-toolkit documentation, at least.  Braces are only used in @param in jsdoc.\r\n\r\nThat means this is less of an issue with Closure, and more the fact that we want proper JSDoc being generated more importantly than Closure understanding the types.  JSDoc doesn\u0027t document \"function\" differently though, so having it in braces wouldn\u0027t be a big deal.\r\n\r\nEither way, adding the parens actually does fix the Closure warning, regardless.","timestamp":1306964905,"attachments":[]},{"id":3,"commenterId":8173196008570380122,"content":"Hmm I mistyped mine as well. All of the following work:\r\n\r\n/** @type {function()} */\r\n/** @type function() */\r\n\r\nHowever with or without braces, \"function\" does require the parens.","timestamp":1306966219,"attachments":[]},{"id":4,"commenterId":3892267362573158838,"content":"Looks like you were right the first time as well:  /** @type {function} */ does not emit a warning.  But as mentioned above, jsdoc will not generate proper documentation if the @type annotation contains braces.  It\u0027s only important when the type is itself a type that jsdoc has seen, e.g., a class that is defined elsewhere in your javascript.  But it is important for us to be able to link between non-native types within our JSDoc documentation, and therefore including the braces is not an option for us (until JSDoc supports braces in @type annotations).\r\n\r\nEither way, I still think the error could be made less cryptic, such as what is reported in @param (since in @param, even JSDoc requires the braces):\r\n\r\n  test.js:2: WARNING - Bad type annotation. missing opening (\r\n   * @param {function}\r\n                     ^\r\n\r\n@type should have the same warning message.","timestamp":1306971229,"attachments":[]},{"id":5,"commenterId":3892267362573158838,"content":"And now I see that my initial message was partially wrong anyway:  With verbose warnings, it actually emits both messages:\r\n\r\n$ java -jar compiler.jar --js test.js --warning_level VERBOSE\r\ntest.js:3: WARNING - Bad type annotation. missing opening (\r\n */\r\n ^\r\n\r\ntest.js:3: WARNING - Parse error. Unexpected end of file\r\n */\r\n  ^\r\n\r\nBut it\u0027s strange to have a cryptic warning like this show up when the root cause itself is not explained without adding further command-line arguments, even though Closure does know what is actually missing.  Someone who\u0027s just getting started with Closure is going to be thoroughly confused by the message.","timestamp":1306972048,"attachments":[]},{"id":6,"commenterId":-7699928860083865744,"content":"yeah, \"function\" is a keyword that must always be followed by parens. Closure compiler is agnostic about the braces around @type annotations. \r\n\r\nthe extra warning message should be fixed. ","timestamp":1307128623,"attachments":[]},{"id":7,"commenterId":1328304962299559429,"content":"This issue was closed by revision r1158.","timestamp":1307599210,"attachments":[]}]}