{"Chart-1": "source/org/jfree/chart/renderer/category/AbstractCategoryRenderer.java (getLegendItems): Fix null check.", "Chart-2": "source/org/jfree/chart/DatasetUtilities.java (iterateRangeBounds(XYDataste, boolean)): For IntervalXYDataset, include regular value and account for nulls / Double.NaN.", "Chart-5": "Fix for bug 1955483.", "Chart-9": "source/org/jfree/data/time/TimeSeries.java (createCopy(RegularTimePeriod, RegularTimePeriod)): Handle empty range.", "Chart-11": "source/org/jfree/chart/util/SerialUtilities.java (readShape): Handle SEG_CLOSE for GeneralPath, Use correct path for comparison.", "Chart-12": "source/org/jfree/chart/plot/MultiplePiePlot.java (MultiplePiePlot(CategoryDataset)): Call setDataset() to ensure that plot registers as a dataset listener.", "Chart-16": " source/org/jfree/data/DefaultIntervalCategoryDataset.java (DefaultIntervalCategoryDataset(Comparable[], Comparable[], Number[][], Number[][]): Initialise seriesKeys and categoryKeys to empty arrays instead of null for empty dataset,(setCategoryKeys): Fixed argument check to handle empty dataset.", "Chart-17": "source/org/jfree/data/time/TimeSeries.java (clone): Reimplemented.", "Mockito-1": "Fixes #188 : attempt to implement logic for varargs capture", "Mockito-2": "Fixes #197 : Blocks ability to use negative value for timeout() and after() method.", "Mockito-3": "Fixes #188 : provided working example for vararg capture issue.", "Mockito-4": "Fixes #187 : print mock name even when default answer is bogus", "Mockito-5": "Merge branch 'issue-152-incorrect-junit-dependencies'", "Mockito-6": "Stop anyX() methods matching null inputs", "Mockito-7": "Merge branch 'pbielicki-bug#128'", "Mockito-8": "Fixes issue #114", "Mockito-9": "Changed CallsRealMethods to delegate to default answer for abstract methods.", "Mockito-10": "Merge pull request #103 from mockito/fixes-issue-99", "Mockito-11": "Merge pull request #87 from hughwphamill/master", "Mockito-12": "Fixed issue 188 @Captor annotation should work OK with nested parametrized type", "Mockito-13": "Fixed issue 138 again, hopefully this time forever :)", "Mockito-14": "Fixed issue 138 When verify contains extra calls to other mocks (highly unlikely) then Mockito was verifying wrong invocation. Now it is all good.", "Mockito-15": "Fix for issue 211", "Mockito-16": "Fixed issue 151. Merged from trunk. Mockito should not be so defensive and clear potential stubbed call on creation of new mock", "Mockito-17": "Fixed issue 152 User should be able to configure the mock to be serializable and have extra interfaces", "Mockito-18": "Adds empty iterable as a new empty value #210", "Mockito-19": "Fixes #205.", "Mockito-20": "Adds support for issue #92 with ByteBuddy", "Mockito-21": "Fixed problem with type testing of outer classes", "Mockito-22": "Merge branch 'issue484-fix' of git://github.com/MajA7jHbJYW2N/mockito into MajA7jHbJYW2N-issue484-fix", "Mockito-23": "Merge pull request #30 from marcingrzejszczak/issue399", "Mockito-24": "Merge pull request #32 from alberskib/master", "Mockito-25": "Merge branch 'issue230'", "Mockito-26": "issue 352 : With answer ReturnsEmptyValues, Mockito-mocked methods returning primitive types other than \"int\" throw ClassCastException: java.lang.Integer. Thanks to Jesse Wilson for spotting that one and providing a patch. I changed a few things however  especially:  - used Primitives utility class instead  - applied underscored names for test cases, as decided internally", "Mockito-27": "issue 282 : mock invocation listeners were removed on reset(mock)", "Mockito-28": "fix for issue 236 : mocks are injected a bit less aggressively", "Mockito-29": "Fix for issue 229 in the describeTo phase of the Same matcher, when match is failing", "Mockito-30": "printing args on smart nulls NullPointerException message (Issue #225)", "Mockito-31": "printing args on smart nulls toString (Issue #225)", "Mockito-32": "Fixed issue 216 @Spy did not have nice names in the verification errors", "Mockito-33": "Fixed issue 200 For some weird reason when we had inherited generics sometimes the cglib proxy does not behave like java proxy would. Fixed in Mockito code.", "Mockito-34": "Fixed issue 157 In order to avoid ArrayIndexOutOfBoundsException when anyvarag() matcher in use", "Mockito-35": "Fixed issue 98 In order to avoid NPE in some very rare cases.", "Mockito-36": "Inform the user with a good message when she tries to 'callRealMethod()' on a mock of a interface. Fixed issue 140", "Mockito-37": "Inform the user immediately when she tries to 'callRealMethod()' on a mock of a interface. Fixed issue 140", "Mockito-38": "In order to fixed issue 79 (NPE) added null handling code", "Lang-1": "NumberUtils does not handle Long Hex numbers", "Lang-3": "Method createNumber from NumberUtils doesn't work for floating point numbers other than Float", "Lang-4": "Allow LookupTranslator to support CharSequence properly; previously it was working only for CharSequence's that implemented hashCode and equals(Object). LANG-882", "Lang-5": "LocaleUtils.toLocale does not parse strings starting with an underscore.", "Lang-6": "StringIndexOutOfBoundsException in CharSequenceTranslator.", "Lang-7": "NumberUtils#createNumber - bad behaviour for leading \"--\"", "Lang-8": "FastDateFormat's \"z\" pattern does not respect timezone of Calendar instances passed to format()", "Lang-9": "FastDateParser does not handle unterminated quotes correctly", "Lang-10": "FastDateParser does not handle white-space properly", "Lang-11": "RandomStringUtils throws confusing IAE when end <= start", "Lang-12": "RandomStringUtils.random(count, 0, 0, false, false, universe, random) always throws java.lang.ArrayIndexOutOfBoundsException", "Lang-13": "SerializationUtils throws ClassNotFoundException when cloning primitive classes", "Lang-14": "StringUtils equals() relies on undefined behavior; thanks to Daniel Trebbien", "Lang-15": "[LANG-776] fix related bugs dealing with type variable inheritance", "Lang-16": "NumberUtils does not handle upper-case hex: 0X and -0X", "Lang-17": "StringEscapeUtils.escapeXml(input) outputs wrong results when an input contains characters in Supplementary Planes.  ALSO rewrite method to avoid modification of counter variable in for loop", "Lang-18": "Adjust FastDateFormat for Java 7 behavior regarding format of the year pattern (LANG-719).", "Lang-19": "Adding tests and resolving LANG-710, reported by Benjamin Valentin. Note that this changed such that the code will now escape an unfinished entity (i.e. &#030). This matches browser behaviour.", "Lang-20": "Applying Ilya's patch from LANG-703 fixing an NPE when toString returns null", "Lang-21": "DateUtils isSameLocalTime() compares the hour using 12hour Calendar.HOUR instead of 24hour Calendar.HOUR_OF_DAY - thanks to Christian", "Lang-22": "Adding first method check from Math's MathUtils.gcd method; and unit tests showing that this was needed. Bug reported and solved by Christian Semrau [LANG-662]", "Lang-23": "ExtendedMessageFormat doesn't override equals(Object)", "Lang-24": "Fixing NumberUtils.isNumber so that 1.1L is not considered a number. LANG-664", "Lang-25": "Fix remaining entries", "Lang-26": "Applying my fix to LANG-645, and Mikael's test case; fixing the FastDateFormat to properly include the locale when formatting a Date", "Lang-27": "Making it so that NumberUtils.createNumber throws a NumberFormatException instead of a StringIndexOutOfBoundsException when Strings such as 1eE are passed in. Thanks to Ingo Heinrich's report and patch in LANG-638", "Lang-28": "Adding a test, and code fix, to have supplementary chars working in numeric entity unescaping. See LANG-617", "Lang-29": "SystemUtils.getJavaVersionAsFloat throws StringIndexOutOfBoundsException on Android runtime/Dalvik VM. Oops, fix return type.", "Lang-30": "StringUtils methods do not handle Unicode 2.0+ supplementary characters correctly.", "Lang-31": "StringUtils.containsAny methods incorrectly matches Unicode 2.0+ supplementary characters.", "Lang-32": "Clear ThreadLocal for HashCodeBuilder as well", "Lang-33": "avoid NPE in ClassUtils.toClass(Object[])", "Lang-34": "part 2: refactor ToStringStyle and ToStringBuilderTest to verify that we are unsetting the registry when no longer needed", "Lang-35": "ArrayUtils.add(T[] array[, offset], T element) can create unexpected ClassCastException", "Lang-36": "isNumber(String) and createNumber(String) both modified to support \"2.\". LANG-521", "Lang-37": "- ArrayUtils.addAll(T[] array1, T... array2) does not handle mixed types very well Also remove unnecessary main() and suite() from test class", "Lang-38": "Fixing LANG-538 - you need to call getTime() on a calendar sometimes to get it in the right state, otherwise the timezone gets out of whack.", "Lang-39": "Applying fix for LANG-552. StringUtils.replaceEach(String, String[], String[]) no longer NPEs when null appears in the last String[]", "Lang-40": "Applying the final part of Benjamin Bentmann's patch to LANG-432, improving our handling of case-insensitive Strings", "Lang-41": "Applying my patch from LANG-535 - adding support to getShortClassName and getPackageName for arrays, including primitive arrays and multi-dimensional arrays. Also stopped getPackageName relying on the underlying class.getPackage as it's sometimes null", "Lang-42": "Applying Alexander Kjall's patch from LANG-480; along with a unit test made from his example. Fixes unicode conversion above U+00FFFF being done into 2 characters", "Lang-43": "Fix for LANG-477 OutOfMemory with custom format registry and a pattern containing single quotes - thanks to Duncan Eley", "Lang-44": "Applying test/fix from LANG-457 - getting a StringIndexOutOfBounds from createNumber rather than a NumberFormatException", "Lang-45": "Applying Vincent Behar's second patch for LANG-419 - fixing a bug in abbreviate such that lower limits greater than the length of the string weren't working correctly", "Lang-46": "StringEscapeUtils.escapeJava(String) escapes '/' characters", "Lang-47": "Applying my patch from LANG-412; fixing Peter Oxenham's report that the appendFixedWidthPadRight and appendFixedWidthPadLeft are not null safe if the nullText has not been set", "Lang-48": "Applying my patch from LANG-393; EqualsBuilder uses compareTo for BigDecimal and not equals", "Lang-49": "", "Lang-50": "Applying Sebb's test and fix from LANG-368 - fixing it so that FastDateFormat getDateInstance and getDateTimeInstance continue to work if Locale.getDefault() changes", "Lang-51": "Applying Sebb's test and fix for LANG-365", "Lang-52": "Applying Scott Bassin's fix and test from LANG-363", "Lang-53": "Applying the fix and the test patches from LANG-346 - fixes bugs in DateUtils.round() for minutes and seconds. Patch from Dave Meikle", "Lang-54": "Applying unit test/fix for LANG-328", "Lang-55": "Applying test and fix for LANG-315", "Lang-56": "Applying test for #LANG-303, and a fix.", "Lang-57": "Applying test for LANG-304 and fix to LocaleUtils", "Lang-58": "Fixing LANG-300 (reported by Jeremy Lemaire) - 1L to 9L incorrectly throw exceptions when passed into NumberUtils.createNumber. Fixed in both the math.NumbersUtils and the deprecated NumberUtils classes.", "Lang-59": "Applying a unit test for LANG-299 and the fix that Francisco Benavent suggests.", "Lang-60": "Fixng LANG-295 - thisBuf.length calls. There were two of the calls, so I've committed a unit test showing things are broken and a fix in both cases.", "Lang-61": "Fixing #LANG-294. The indexOf method did not take into account the size variable that limited the amount of the buffer that should be looked at.", "Lang-62": "Applying unit test and fix for #LANG-292. Also fixes a couple of problems with the unescape(Writer..) overload that came up", "Lang-63": "Adding a unit test for #LANG-281 and a fix. The fix involves removing the reduceAndCorrect method. It appears that this method was doing sod all - which is worrying as it used to be important. I'm guessing that it was a bad fix for a bug that was then subsequently fixed with other code. I'll create a JIRA issue to create more tests to test out the +31 block of code.", "Lang-64": "- Fix compareTo to check the type is the same", "Lang-65": "Adding Niall's fix for LANG-59 - an edge case in date truncation - and his enhancement for the unit test that was there.", "Time-1": "Fix NPE in Partial.with()", "Time-2": "Fix NPE in Partial.with()", "Time-3": "Adding zero no longer changes the offset during DST overlap", "Time-4": "Prevent creation of invalid partials via Partial.with(DateTimeFieldType,int)", "Time-5": "Fix handling of PeriodType when either years or months missing", "Time-6": "Fix GJChronology.plus/minus across cutover and year zero", "Time-7": "Fix DateTimeFormatter.parseInto() where it obtains the default year", "Time-8": "Fix to allow offsets from -00:01 to -00:59", "Time-9": "Ensure there is a max/min valid offset in DateTimeZone", "Time-10": "Days.daysBetween fails for MonthDay", "Time-11": "Fix ZoneInfoCompiler and DateTimeZoneBuilder multi-threading", "Time-12": "Fix fromCalendarFields()/fromDateFields() to handle era BC correctly", "Time-13": "Fix period formatter to correctly output values negative milliseconds [3564249]", "Time-14": "Fix MonthDay add/subtract around Feb29 [3528941]", "Time-15": "FieldUtils.safeMultiply(long,int) [3520651]", "Time-16": "Fix DateTimeFormatter.parseInto() [3522138]", "Time-17": "Fix time zone later/earlier offset methods in Western hemisphere [3476684]", "Time-18": "Fix GJChronology to allow some leap year dates in JulianChronology to be created [3446915]", "Time-19": "Ambiguous date-time when in zone with offset of 00:00 [3424669]", "Time-20": "Fix zone id parsing for ids like America/Dawson_Creek [3427389]", "Time-22": "Duraton.toPeriod(), new Period(long), new MutablePeriod(long) [3264409] Fixed to obey Javadoc. Previously, they didn't obey the Javadoc if the default time-zone had no daylight savings.", "Time-23": "[3216471] Time-zone ID \"MET\" from java.util.TimeZone is now mapped correctly. Other time-zone conversions have been updated appropriately", "Time-24": "Conversion from parsed values to a date-time handles weird sets of fields better [3161586] This change is mostly for combinations like weekyear-month-week The new code doesn't handle all combinations perfectly, but its better than it was", "Time-25": "[2952991] The behaviour during DST overlaps is now defined to always return the earlier instant which is normally known as daylight or summer time. Previously, the result varied by hemisphere. This affects the constructor of DateTime and other methods", "Time-26": "[bugs 3102760,2182444,2553453] New method now retains the offset wherever possible during calculations This affects higher methods like withHourOfDay/withMinuteOfHour/withSecondOfMinute/withMillisOfSecond which now do not change offset when called within a DST overlap", "Time-27": "Period formatter builder append(PeriodFormatter) did not handle some case [2495455] test from Bjoern Ricks", "Closure-1": "In simple mode, do not remove unreferenced function arguments. Fixes issue 253", "Closure-2": "Fix null pointer bug encountered when trying to extend non-existent interfaces.", "Closure-3": "Special case catch expressions to work around the fact that we don't module catch block as lexical scope for the exception and it doesn't belong in the function scope. Fixes issue 864.", "Closure-4": "Fix issue 873 Converting from an interface type to a constructor which @implements itself causes stack overflow.", "Closure-5": "Do not inline an object literal if it has a property that gets deleted.", "Closure-6": "Fix parts of issue 635, mostly by deleting hacks that are now obsolete", "Closure-7": "Fix goog.isFunction, typeof x == 'function', and similiar type inference. Fixes issue 841.", "Closure-8": "Don't collapse assignments into var declarations if it would cause a redeclarion of a named parameter.", "Closure-9": "counter DOS shell file name normalization fixes issue 824", "Closure-10": "Properly determine if any possible results may be a string. Fixes issue 821", "Closure-11": "fix a bogus 'if' branch. I have no idea what this was doing. Fixes issue 810", "Closure-12": "Fix may-use data flow analysis in the presence of ON_EX edges. Fixes issue 794", "Closure-13": "Fixes issue 787.  Removing or replacing a Node is the AST caused any following Function nodes to be skipped in the late peephole folding. To prevent this save off the \"next\" node before visiting a Node.", "Closure-14": "when handling a finally block like so, try { alert(1) } finally { } There needs to be 2 edges: an unconditional edge to the statement after the 'finally', and an edge for the code path that continues handling the exception. Label the second edge with ON_EX instead of UNCOND. Fixes issue 779", "Closure-15": "Don't inline values over a \"delete\". Fixes issue 773", "Closure-16": "When expanding goog.scope aliases in type expressions, do not expand the alias until previous aliases have been expanded. fixes issue 772", "Closure-17": "When declaring @const vars initialized to a type-casted value, prefer the type-cast as the declared type. fixes issue 688", "Closure-18": "Allow dependency sorting even when closure pass is off. Fixes issue 768", "Closure-19": "Handle 'this' properly in the RAI. fixes issue 769", "Closure-20": "fix a bad String() optimization fixes issue 759", "Closure-21": "Automated g4 rollback", "Closure-22": "You are in a maze of twisty 'if' branches, all alike. cleanup the logic for identifying dead expressions. Fixes issue 753", "Closure-23": "Don't fold arrays if they have side effects. Contributed by Robert Gust-Bardon Fixes issue 747", "Closure-24": "Emit an error if there are dangling functions in the goog.scope fixes issue 737", "Closure-25": "Fix some bugs in 'new' inference: - traverse children before the parent - do backwards inference on params, like we do for CALL Fixes issue 729", "Closure-26": "don't bother with module exports if there's nothing to export Fixes issue 732", "Closure-27": "Correct IR helpers for TRY nodes. Fixes issue 727.", "Closure-28": "Lower the cost of true/false/null. Fixes issue 728", "Closure-29": "don't try to inline properties that we don't recognize, because they may be prototype properties. This isn't a perfect fix, but should get most cases. Fixes issue 724", "Closure-30": "fixes issue 698", "Closure-31": "add dependency management in whitespace-only mode contributed by Chris Peisert fixes issue 703", "Closure-32": "preserve whitespace at the beginning of license blocks makes the <code> in closure docs look a lot better fixes issue 701", "Closure-33": "fix a bug in constraint-matching fixes issue 700", "Closure-34": "More recursion unrolling Fixes issue 691", "Closure-35": "push reverse-inference into the type system fixes issue 669", "Closure-36": "Remove addSingletonGetter stragglers. Fixes issue 668", "Closure-37": "Prevent unsupport JavaScript variants that Rhino can parse from crashing the compiler in \"ide mode\". Fixes issue 663", "Closure-38": "Negative zero is a special case, and needs to be handled differently to prevent it from getting confused with decrement fixes issue 657", "Closure-39": "print record types better when generating typed code. fixes issue 643", "Closure-40": "fix smartNameRemoval crash Fixes issue 284", "Closure-41": "When inferring a function type, there may be formal parameters that do not appear in the function literal Fixes issue 368", "Closure-42": "Don't silently ignore transform \"for each\" into \"for\" loops, report an error instead. Fixes issue 644", "Closure-43": "defer evaluation of the @lends annotation fixes issue 314", "Closure-44": "Fix issue 620", "Closure-45": "Don't remove assignments to variables whose values have escaped and are later modified. Fixes issue 618.", "Closure-46": "Fix a bunch of bugs in record type sup/inf with proxy types Fixes issue 603", "Closure-47": "Fix how source line numbers are stored in the source files. Fixes issue 575", "Closure-48": "Fix issue 586. Distinguishing declared functions from inferred functions is really hard!", "Closure-49": "Modify normalization to distinguish function expression names from parameters and local variables. Fixes issue 539.", "Closure-50": "[].join(',') --> [].join() Fixes issue 558", "Closure-51": "Correct output of -0.0. Fixes issue 582.", "Closure-52": "numbers are hard! fixes issue 569", "Closure-53": "Fix edge case in InlineObjectLiteral. Fixes issue 545", "Closure-54": "Support chrome-team's style of defining prototypes. Fixes issue 537", "Closure-55": "Don't attempt to rewrite object literal get/set definitions. Fixes issue 538.", "Closure-56": "When getting a line from the source code according to the line number, if it happens to be the last line, and '\\n' character is missing in the end of the file, we should still return the last line.", "Closure-57": "Handle bad goog.require/goog.provide calls more gracefully. Fixes issue 530.", "Closure-58": "Allow expressions on LHS of for-in loops. Fixes issue 528.", "Closure-59": "Fix order of operations of GLOBAL_THIS options. Fixes issue 521", "Closure-60": "fix a mishandling of the void keyword also fix a bunch of apis fixes issue 504", "Closure-61": "Automated g4 rollback.", "Closure-62": "Automated g4 rollback.", "Closure-64": "When -language_in=ECMASCRIPT5_STRICT, only print 'use strict' in the first input file. Fixes Issue 489.", "Closure-65": "Encode the null byte more correctly, because we have to be careful of look ahead. Contributed by kosmo.zb Fixes issue 486", "Closure-66": "Fixes Issue 482 In percent typed counting, ignore the nodes of Enum elements", "Closure-67": "Only remove prototype properties defined with simple assigment statements. Fixes issue 459.", "Closure-68": "Fix a jsdoc parser bug where it was dropping the EndOfComment token Fixes issue 477", "Closure-69": "Make sure that functions are called with a 'this' type. Fixes issue 440", "Closure-70": "Parameter types should be declared, rather than inferred. This means that if the programmer re-assignes the argument to a different type, they will get a type warning. Fixes issue 433.", "Closure-71": "Emit a warning when a private property overrides another private property, with both defined in the ctor. Fixes issue 254", "Closure-72": "Label names must be made unique when inlining a function. Fixes issue 435", "Closure-73": "Codepoint U+007f should not appear raw in output Fixes issue 416 http://code.google.com/p/closure-compiler/issues/detail?id=416", "Closure-74": "Fix more regressions caused by TRUE/FALSE denormalization. Fixes issue 413", "Closure-75": "Fix \"string-to-number\" conversions in the presense of verical tabs. Fixes issue 395.", "Closure-76": "Correct handling of conditional branches within expressions when doing dead assignment elminination. Fixes issue 384.", "Closure-77": "Special case the NUL character. Fixes issue 383", "Closure-78": "Delete the divide by zero error I've never heard of this catching any real bug. It seems like if you explicitly typed \"1 / 0\", you meant to do that. fixes issue 381", "Closure-79": "Normalize extern VAR declarations Fixes issue 367.", "Closure-80": "\"delete\" operator with a boolean result. Fixes issue 364", "Closure-81": "Generate a parse error for unnamed function statements. Fixes issue 251.", "Closure-82": "Treat the bottom function type as empty. Fixes issue 301.", "Closure-83": "fix a bug in open-source args parsing. Fixes issue 319.", "Closure-84": "Don't let invalid LHS assignments to slip through. Fixes issue 215. Fixes issue 214.", "Closure-85": "Don't remove nodes out of traversal order. Fixes issue 311.", "Closure-86": "Fix improper analysis of NEW, the bad way: by assuming NEW always returns a non-local result. Fixes issue 303.", "Closure-87": "a really terrible fix for issue 291 fixes issue 291", "Closure-88": "Fix checks for variable reads in expressions with assignments. Fixes issue 297.", "Closure-89": "Turn off collapsing for non-constructor function properties. Fixes issue 289.", "Closure-90": "Coerce null and undefined out of the @this type when we resolve lazily. We already do this when we resolve @this blocks immediately. There's some question about whether we should be coercing to the global object instead, but i'm going to just punt on this for now. Fixes issue 274", "Closure-91": "don't emit unsafe global this warnings when the @lends annotation is used correctly. fixes issue 248", "Closure-92": "Fix bug with implicit namespaces across modules. Contributed by bolinfest Fixes issue 261", "Closure-94": "Generalize define value handling allow ADD and other basic ops, fix BITxxx handling so they don't allow invalid operands.", "Closure-95": "If a property is defined on a global name, but in a local scope, declare that property in the global scope. this goes most of the way towards fixing issue 66.", "Closure-96": "check var_args properly Fixes issue 229.", "Closure-97": "Propertly fold \">>> 0\" on negative values. Fixes issue 200", "Closure-98": "Change on 2010/06/09 by nicksantos", "Closure-99": "Change on 2010/06/03 by nicksantos", "Closure-100": "Change on 2010/05/27 by johnlenz", "Closure-101": "Removing useless members variables. (Alan) R=robert DELTA=4  (0 added, 4 deleted, 0 changed)", "Closure-102": "\"var arguments\" never shadows the built-in arguments array. Fixes issue 115.", "Closure-103": "Make the CFA recognize possible ON_EX edges for instanceof operations. Fixes issue 113. (Alan)", "Closure-104": "Fixes a bug in getGreatestSubtype (Andrew)", "Closure-105": "Fix an edge case in how Array.prototype.join is collapsed. Fixes issue 106.", "Closure-106": "- Fix issue #19 - attach jsdoc comments without annotations to nodes", "Closure-107": "Shut off i18n warnings if the user didn't ask for i18n. Fixes issue 1135 R=blickly", "Closure-108": "Don't try to process jsdoc nodes twice. Fixes issue 1144 R=blickly", "Closure-109": "Tweak the grammar for this/new types. Fixes issue 1105 R=johnlenz", "Closure-110": "Handle function declarations in ScopedAliases. Fixes issue 1111 R=johnlenz", "Closure-111": "Restrict goog.isArray to * properly. Fixes issue 1114 R=blickly", "Closure-112": "Don't infer class template keys when inferring method template keys. Fixes issue 1058. ------------- Created by MOE: http://code.google.com/p/moe-java MOE_MIGRATED_REVID=53874505", "Closure-113": "This change had to be rolled-back, since it breaks some users of the Java API. See the updated comment and new test case for reasoning.", "Closure-114": "SmartNamePass shouldn't record assignment dependencies if the rhs is a call. The rhs is used by the context, so we don't want it removed if the lhs isn't used.", "Closure-115": "Automated g4 rollback of changelist 53511956.", "Closure-116": "Nerf direct function inlining when the function be inlined has side-effects and the call arguments can be effected. Fixes issue 1101 ------------- Created by MOE: http://code.google.com/p/moe-java MOE_MIGRATED_REVID=53511956", "Closure-117": "Rejigger type name printing. Fixes issue 1047 R=johnlenz", "Closure-118": "Fix DisambiguateProperties handling of quoted properties", "Closure-119": "Fix for errors wrt exceptions in the global scope. Fixes issue 1070 R=blickly", "Closure-120": "Fix inlining bug in https://code.google.com/p/closure-compiler/issues/detail?id=1053 Attempt 2 Fixes issue 1053 ------------- Created by MOE: http://code.google.com/p/moe-java MOE_MIGRATED_REVID=50800167", "Closure-121": "Fix inlining bug in https://code.google.com/p/closure-compiler/issues/detail?id=1053 ------------- Created by MOE: http://code.google.com/p/moe-java MOE_MIGRATED_REVID=50726739", "Closure-122": "Improve detection of suspicious block comments.", "Closure-123": "Printing of IN statement inside HOOK inside FOR.", "Closure-124": "Fixes issue 1017 ------------- Created by MOE: http://code.google.com/p/moe-java MOE_MIGRATED_REVID=47616701", "Closure-125": "Skip checks if constructor has no instance type.", "Closure-126": "Fix bug in MinimizeExitPoints with removing breaks inside finally blocks.", "Closure-127": "Fix tests and code in UCE that do unsound optimizations in finally blocks.", "Closure-128": "Don't quote \"0\" object literal keys. Fixes issue 942 ------------- Created by MOE: http://code.google.com/p/moe-java MOE_MIGRATED_REVID=44143868", "Closure-129": "Look through CAST nodes when annotating CALL nodes as free calls. Fixes issue 937 ------------- Created by MOE: http://code.google.com/p/moe-java MOE_MIGRATED_REVID=44143144", "Closure-130": "Don't attempt to inline aliases of external names during collapse properties as all the sets can not be accounted for. Fixes issue 931 ------------- Created by MOE: http://code.google.com/p/moe-java MOE_MIGRATED_REVID=43187988", "Closure-131": "Add patch from issue 921 as well as accompanying unit test.", "Closure-132": "Don't reorder if condition expressions if they contain side-effects. Fixes issue 925. ------------- Created by MOE: http://code.google.com/p/moe-java MOE_MIGRATED_REVID=43060270", "Closure-133": "Fixes issue 919", "Closure-134": "Fixes a bug in AmbugateProperties in the presence of interfaces.", "Closure-135": "Type-checking fix when the prototype is assigned directly. Fixes issue 59.", "Closure-136": "The MethodCompilerPass was being a little too smart for itself, leading to incorrect behavior by the InlineGetter pass (inlining extern definitions of functions which it thought were empty functions). This results in slight worse behavior by the depreciated \"MethodCheck\" pass, but most projects have moved on to \"check_types\" which is on by default. (John) R=Alan DELTA=77  (44 added, 28 deleted, 5 changed)", "Closure-137": "Fix assorted type system bugs and crashes. Fixes issue 124. (Nick) R=andrew DELTA=161  (122 added, 9 deleted, 30 changed)", "Closure-138": "Fix assorted type system bugs and crashes. Fixes issue 124 for reals. (nick) R=andrew DELTA=161  (122 added, 9 deleted, 30 changed)", "Closure-139": "Remove var declarations when name functions are in the same scope. Fixes Issue 33 (John) R=nick DELTA=206  (155 added, 16 deleted, 35 changed)", "Closure-140": "fix silly 2004-era naming conventions (Nick) R=john DELTA=134  (0 added, 0 deleted, 134 changed)", "Closure-141": "Tweak to allow chained initialization: new Node(Token.EXPR_RESULT, a).copyInformationFrom(a); (John) R=alan DELTA=10  (6 added, 0 deleted, 4 changed)", "Closure-142": "Make lists the canonical representation of compiler sources. They're so much easier to sort and mutate, which is going to make a difference once we start sorting sources. (Nick) R=robert DELTA=97  (58 added, 6 deleted, 33 changed)", "Closure-143": "Change on 2010/04/06 by john", "Closure-144": "Change on 2010/06/22 by nicksantos", "Closure-145": "Change on 2010/06/25 by johnlenz", "Closure-146": "Change on 2010/07/02 17:44:46 by nicksantos", "Closure-147": "Change on 2010/07/09 08:36:29 by nicksantos", "Closure-148": "Change on 2010/07/15 12:32:23 by johnlenz", "Closure-149": "Clean up the command-line runner api, which uncovered a bunch of bugs in Options serialization. Set the output charset to US-ASCII by default, but let the user set it to UTF-8. Fixes Issue 205", "Closure-150": "Unify global scope building and local scope building. This goes a long way towards fixing issue 61. Try #2", "Closure-151": "Add version numbers to closure compiler. Fixes issue 74.", "Closure-152": "validation for @this annotation. looks about the same as the @extends validation. Fixes issue 268", "Closure-153": "If a variable is doubly declared in externs and sources, we should keep around both VAR keywords. Fixes issue 290", "Closure-154": "Fixes issue 204 Add support for data members on interfaces", "Closure-155": "Don't inline alias if \"arguments\" are modified or escaped. Fixes issue 378", "Closure-156": "Fix a nasty bug in collapseproperties. The problem is that the declaration-updater conflates \"can i always collapse this name?\" with \"can i sometimes collapse children of this name?\" There are a few rare cases where they are not equivalent, like if you have /** @constructor */ a.b.c = function() {}; where a is collapsed and a.b.c is collapsed (because constructors are always collapsed), but a.b is not. Fixes issue 389", "Closure-157": "Define number keys in object literals to be quoted string nodes. Tagged with NUMBER_PROP Fixes issue 347", "Closure-158": "Create new command-line parsers so that jscomp_off, jscomp_warning jscomp_error get interpreted in the correct order relative to one another. Fixes issue 407", "Closure-159": "Fix mismatch between the definition of candidate references used when initially gathering references and when checking for inlining conflicts. Fixes issue 423", "Closure-160": "Compose warnings guards correctly so that people can turn on the undefined variables check by itself. order of execution is hard! Fixes issue 467", "Closure-161": "Don't try to fold array literal accesses that are acting as a assignment target. Fixes issue 522.", "Closure-162": "Collect aliases before collecting usages Fixes issue 548", "Closure-163": "Rewrite how AnalyzePrototypeProperties reasons about contextual information. This fixes a lot of bugs in how local and captured variables are handled. Fixes issue 600.", "Closure-164": "It doesn't make sense for a subclass method to require arguments that aren't required by the superclass method.", "Closure-165": "Better property checks, by creating a notion of \"synthetic\" types that we use for internal bookkeeping, and not using those for property checks. fixes issue 725", "Closure-166": "More complicated constraint-matching. Fixes issue 785", "Closure-167": "Clean up the reverse abstract interpreter a bit so that we handle \"checked unknowns\" better, and don't have lots of spurious unknown slots during data flow-based type inference. fixes issue 783", "Closure-168": "Add a heuristic for figuring out the type of an inferred variable that is read across multiple scopes. This isn't perfect, but it should catch a lot of common cases. Fixes issue 726", "Closure-169": "Add a new isInvariant relation. Fixes issue 791.", "Closure-170": "Fix issue 965 ------------- Created by MOE: http://code.google.com/p/moe-java MOE_MIGRATED_REVID=45371896", "Closure-171": "Handle prototype assignments much better. Fixes issue #1023.", "Closure-172": "Prototype properties should not be auto-declared as non-object types. Fixes issue 1042. ------------- Created by MOE: http://code.google.com/p/moe-java MOE_MIGRATED_REVID=49400223", "Closure-173": "Fix 8-year old bug in CodeGenerator.", "Closure-174": "Make sure ScopedAliases doesn't crash when there's a dangling var ref. Fixes issue 1103 R=dimvar", "Closure-175": "Automated g4 rollback of changelist 53524738.", "Closure-176": "Better type inference on declared vars. Fixes issue 1056 R=johnlenz", "Math-1": "Fix creation of Fraction/BigFraction objects in maxDenominator mode when the value is close to an actual fraction.", "Math-2": "Reordering can prevent some overflow occurrences (fix suggested by Brian Bloniarz). Added unit test.", "Math-3": "Array of length 1 must be handled as a special case.", "Math-4": "Fixed NullPointerException in 2D and 3D sub-line intersections.", "Math-5": "Fixed Complex.reciprocal() for zero argument.", "Math-6": "Increment iteration counter. By default, the maximum number of iterations is \"Integer.MAX_VALUE\".", "Math-7": "Fixed missing update in ODE event handlers.", "Math-8": "Fixed creation of generic array.", "Math-9": "Fixed accuracy of 3D Line.revert().", "Math-10": "Fixed DerivativeStructure.atan2 for special cases when both arguments are +/-0.", "Math-11": "Fixed truncated value. Thanks to Piotr Wydrych. Added unit test: comparing density values with univariate normal distribution.", "Math-12": "Made \"BitsStreamGenerator\" class \"Serializable\" to allow cloning of subclasses. Added cloning test for all \"RealDistribution\" classes. Thanks to Dennis Hendriks.", "Math-13": "Avoid memory exhaustion for large number of unclorrelated observations.", "Math-14": "Using a diagonal matrix to avoid exhausting memory.", "Math-15": "Fixed wrong assumption in \"pow\" method.", "Math-16": "Avoid overflow on the whole range covered by the equivalent functions in the standard \"Math\" class.", "Math-17": "Allow unlimited input values for Dfp#multiply.", "Math-18": "Modified \"encode\" and \"decode\" methods. Unit test \"testFitAccuracyDependsOnBoundary\" now passes and is thus enabled. Unit test \"testConstrainedRosen\" had to be modified in order to not fail with the new code (starting point is set closer to the solution).", "Math-19": "Early detection that overflow will occur in the variables normalization procedure (\"encode\" method). Warning mentioned in the documentation.", "Math-20": "Fixed missing \"repair\" of a point that lies outside the boundaries. Thanks to Frank Hessen for the report and for pinpointing the cause of the problem.", "Math-21": "Fixed an error in rectangular Cholesky decomposition.", "Math-22": "Clarified definition of isSupportXxxBoundInclusive in RealDistribution interface, made code consistent with the definition, and deprecated these methods, marking for removal in 4.0. JIRA: MATH-859", "Math-23": "(second take). Best point must be returned.", "Math-24": "The best point is sometimes not the last one evaluated.", "Math-25": "Generate an exception when the parameter guessing procedure cannot perform correctly (in rare ill-conditioned cases).", "Math-26": "Improve overflow check for negative values in Fraction constructor.", "Math-27": "Avoid overflow.", "Math-28": "Add additional heuristic for rare cases in pivotRow selection.", "Math-29": "  - modified OpenMapRealVector.ebeMultiply() and ebeDivide() to handle special cases  0d * NaN, 0d * Infinity, 0d / 0d and 0d / NaN.   - added implementation of isNaN() and isInfinite() to SparseRealVectorTest.SparseRealVectorTestImpl in order to allow for testing of OpenMapRealVector.ebeMultiply() and ebeDivide() with mixed types.", "Math-30": "Patch applied to fix the overflow issue.", "Math-31": "Use modified Lentz-Thompson algorithm for continued fraction evaluation.", "Math-32": "Fixed a wrong assumption on BSP tree attributes.", "Math-33": "use epsilon criteria when deciding to drop columns after phase 1.", "Math-34": "Fixed iterator() method in ListPopulation to return an iterator of the unmodifiable list, thanks to Reid Hochstedler.", "Math-35": "Use same range check in ctor as in setter for ElitisticListPopulation. Thanks to Reid Hochstedler", "Math-36": "Fixed \"doubleValue()\" and \"floatValue()\" when numerator and denominator are larger than the range of the corresponding primitive type.", "Math-37": "Introduced tests to guard against overflow (MATH-722). Corrected Javadoc and updated unit tests accordingly.", "Math-38": "Offset by one bug. Suggested fix provided by Bruce Johnson. I've added a unit test that exercises the use of more interpolation points; two previously unexplored code paths are now being traversed.", "Math-39": "Check first step size in embedded Runge-Kutta integrators.", "Math-40": "Fixed bracketing interval balancing in BracketingNthOrderBrentSolver.", "Math-41": "Fixed array indexing error in Variance evaluate method for computing the weighted variance of an array segment.", "Math-42": "Fixed case of unconstrained variables that still occur in the objective function in simplex solver.", "Math-43": "Fixed errors in SummaryStatistics causing overriden statistics not to be updated if the supplied impls are commons-math classes.  JIRA: MATH-691.", "Math-44": "Fixed an event resetting issue in ODE.", "Math-45": "Fixed an integer overflow in OpenMapRealMatrix.", "Math-46": "Reverting to previous behaviour, as requested by P. Steitz.", "Math-47": "Complex division by zero:  z / 0 = INF if z is not ZERO  0 / 0 = NaN", "Math-48": "Early detection of \"Regula Falsi\" algorithm being stuck due to finite precision. Javadoc makes it clear that either the Pegasus or the Illinois solver should be preferred over the Regula Falsi one (due to D. Hendriks).", "Math-49": "Iterate on the original vector, not on the copy that is modified.", "Math-50": "Reverted to original behaviour.", "Math-51": "Work around infinite loop.", "Math-52": "Fixed a wrong detection of rotation axis versus vectors plane in Rotation constructor using two vectors pairs.", "Math-53": "Fixed add method to match javadoc contract when one or both addends has NaN parts.", "Math-54": "Fixed conversion problems to/from 0 in Decimal Floating Point (Dfp) class.", "Math-55": "Reduced cancellation errors in Vector3D.crossProduct", "Math-56": "Fixed bug in \"MultidimensionalCounter\". Thanks to James Bence.", "Math-57": "Wrong  variable type (\"int\" instead of \"double\").", "Math-58": "Workaround exception generated when the optimizer tries invalid values for the \"sigma\" parameter. Added a method to allow the user to pass his own initial guess.", "Math-59": "FastMath.max(50.0f, -50.0f) => -50.0f; should be +50.0f", "Math-60": "Modified NormalDistributionImpl.cumulativeProbability to return 0 or 1, respectively for values more than 40 standard deviations from the mean. For these values, the actual probability is indistinguishable from 0 or 1 as a double.  Top coding improves performance for extreme values and prevents convergence exceptions.", "Math-61": "Removed deprecated methods.", "Math-62": "(point 13) Selecting a random start value (instead of interval bounds).", "Math-63": "Removed deprecated methods.", "Math-64": "corrected", "Math-65": "fixed", "Math-66": "Another bug uncovered; all things being equal, the code now behaves like the Puthon implementation. MATH-397: Modified \"BrentOptimizer\" following the changes in \"AbstractUnivariateRealOptimizer\".", "Math-67": "Fixed inconsistent definition of \"getResult\". Modified associated test accordingly.", "Math-68": "Fixed Levenberg-Marquardt optimizer that did not use the vectorial convergence checker. Now this optimizer can use either the general vectorial convergence checker or its own specialized convergence settings. Minor changes had to be introduced in the test data, they have been validated JIRA: MATH-362", "Math-69": "Fixed loss of significance error in PersonsCorrelation p-value computation causing p-values smaller than the machine epsilon (~1E-16) to be reported as 0. JIRA: MATH-371 Reported and patched by Kevin Childs", "Math-70": "Fix NullPointerException in BisectionSolver.solve(f, min, max, initial) JIRA: MATH-369", "Math-71": "Fixed an error in events handling in ODE solvers. In some rare cases, events occurring close to a step start were handled without truncating the step, making them appear as is they occurred close to the step end JIRA: MATH-358", "Math-72": "Fixed wrong return values when enpoints are roots in Brent solver with a user provided initial guess JIRA: MATH-344", "Math-73": "Fixed a missing bracketing check of initial interval in Brent solver JIRA: MATH-343", "Math-74": "Fixed automatic step initialization in embedded Runge-Kutta integrators. The relative tolerance setting was never used, only the absolute tolerance was used. JIRA: MATH-338", "Math-75": "Fixed regression in Frequency.getPct(Object) introduced in 2.0. Cumulative percent was being returned for Object arguments in place of percent.", "Math-76": "Singular Value Decomposition now computes either the compact SVD (using only positive singular values) or truncated SVD (using a user-specified maximal number of singular values). Fixed Singular Value Decomposition solving of singular systems. JIRA: MATH-320, MATH-321", "Math-77": "fixed a wrong implementation of the Linf vector norm JIRA: MATH-326", "Math-78": "Fixed an error in handling of very close events during ODE integration JIRA: MATH-322", "Math-79": "Fixed an overflow error in MathUtils.distance that was causing KMeansPlusPlusClusterer to fail with a NullPointerException when component distances between points exceeded Integer.MAXVALUE. JIRA: MATH-305 Reported by Erik van Ingen", "Math-80": "Fixed an index computation error in eigen decomposition. Once again, kudos to Dimitri for debugging this. JIRA: MATH-318", "Math-81": "fixed an ArrayIndexOutOfBoundsException Kudos to Dimitri who debugged this mess of fortran/java array indices translation JIRA: MATH-308", "Math-82": "fixed an error induced by zero entries in simplex solver JIRA: MATH-288", "Math-83": "fixed an error leading the simplex solver to compute the right solution but return another one JIRA: MATH-286", "Math-84": "Prevent infinite loops in multi-directional direct optimization method when the start point is exactly at the optimal point JIRA: MATH-283", "Math-85": "fixed a bracketing issue due to inconsistent checks JIRA: MATH-280", "Math-86": "fixed detection of not positive definite matrices JIRA: MATH-274", "Math-87": "Fixed a wrong check for basic variables JIRA: MATH-273", "Math-88": "Fixed a problem when setting some variables (several variables were set instead of only one) JIRA: MATH-272", "Math-89": "- throw IllegalArgument rather than ClassCast to better retain original behaviour", "Math-90": "- check for Comparable when adding values", "Math-91": "Fixed a comparison error when two different fractions evaluate to the same double due to limited precision. Jira: MATH-252", "Math-92": "Fixed error in binomial coefficient computation JIRA: MATH-241 Reported and patched by Christian Semrau", "Math-93": "Fixed error in factorial accuracy.  JIRA: MATH-240.", "Math-94": "fixed overflow error in gdc computation JIRA: MATH-238", "Math-95": "propagated trunk changes from r699157 into branch 2.0 MATH-227.  fixed F distribution inverse CDF computation for small denominator degrees of freedom.", "Math-96": "Changed the Complex.equals() method so that it considers +0 and -0 are equal, as required by IEEE-754 standard. JIRA: MATH-221", "Math-97": "ported all changes from trunk between r6152100 (branch 2.0 creation) and r670469 (today) These changes contain fixes for MATH-204 and MATH-205", "Math-98": "fixed dimension error in operate method for RealMatrixImpl and BigMatrixImpl JIRA: MATH-209", "Math-99": "Fixed an error in computing gcd and lcm for some extreme values at integer range boundaries. JIRA: MATH-243", "Math-100": "fixed crashes in AbstractEstimator when some parameters are bound. getCovariances() and guessParametersErrors() now only give result about unbound parameters JIRA: MATH-200", "Math-101": "added an error detection for missing imaginary character while parsing complex string JIRA: MATH-198", "Math-102": "Added check and rescaling of expected counts to sum to sum of expected counts if necessary in ChiSquare test. JIRA: MATH-175 Reported and patched by Carl Anderson.", "Math-103": "Modified NormalDistributionImpl.cumulativeProbablity to catch MaxIterationsExceededException and return 0 or 1, resp. if the argument is more than 20 standard deviations from the mean.", "Math-104": "Increased default epsilon for Gamma, Beta function evaluation. JIRA: MATH-166 Reported and patched by Lukas Theussl", "Math-105": "Modified getSumSquaredErrors method in SimpleRegression to always return a non-negative result. JIRA: MATH-85 Reported by Mark Osborn Patched by Luc Maisonobe", "Math-106": "Modified ProperFractionFormat to reject embedded minus signs. JIRA: MATH-60 Reported by Nhung Nnguyen", "accumulo-9396979b": "add a metadata table constraint to require the bulk load transaction to be alive when writing the bulk-loaded flags", "accumulo-ea2f9856": "add a metadata table constraint to require the bulk load transaction to be alive when writing the bulk-loaded flags", "accumulo-25cf3ccd": "reverted previous change, which broke unit tests. Awaiting updated patch based on test failures and ticket discussions.", "accumulo-474b2577": "- credentials now getting properly read", "accumulo-742960f1": "applying patch from Corey Nolet", "accumulo-cfbf5999": "applying patch from Corey Nolet", "accumulo-e29dc4f5": "make update a oneway call again", "accumulo-9476b877": "applying Kevin Faro's patch to fix du on an empty table", "accumulo-c489d866": "applying Kevin Faro's patch to fix du on an empty table", "accumulo-813109d7": "mode some more methods in proxy throw table not found exception.  cleaned up proxy formatting.  made proxy throw more specific exceptions.", "accumulo-d9ab8449": "Test Connectors and serialization with destroyed tokens", "accumulo-6ff92b12": "merged patch to trunk", "accumulo-ef0f6ddc": "Applied patch from Mike Drob to 1.5 branch", "accumulo-4d10c92f": "Appled patch from Mike Drob, with modification to delete table in unit test.", "accumulo-6c565dfb": "Appled patch from Mike Drob, with modification to delete table in unit test.", "accumulo-994df698": "- Ryan Leary's patch with updates/warning busting", "accumulo-b082fc1e": "- merging Ryan Leary's patch, with modifications to update and remove warnings", "accumulo-fb25913c": "I jumped the gun", "accumulo-dc95cb69": "Patch from David M. Lyle that allows opening rfiles w/ multiple dots in name.", "accumulo-df4b1985": "Patch from David M. Lyle that allows opening rfiles w/ multiple dots in name.", "accumulo-b007b22e": "changed default behavior of Combiner and modified default test", "accumulo-0cf2ff72": "Thought this flag was gone in MAC, fixed now", "accumulo-13eb19c2": "Handle empty column family correctly for AccumuloInputFormat", "accumulo-872b6db3": "Reinsert changes inadvertently lost in cherry-pick", "accumulo-941e3cb1": "fixed input format w/ mock", "accumulo-2f0643a9": "merge to trunk", "accumulo-efef09b0": "merge to 1.4 branch", "accumulo-3143b9c5": "fix deletes, added test", "accumulo-8ec4cb84": "fix deletes, added test", "accumulo-6dbbdc21": "merged to trunk", "accumulo-cd7feb4d": "applied patch", "accumulo-8ad5a888": "changed toString methods of Key and created test for toString on a Key created with followingKey(...COLVIS)", "accumulo-c831e44d": "merged to trunk", "accumulo-2d97b875": "merge failed to pull null pointer checks from 1.4", "accumulo-a5e3ed3b": "merge to 1.5.1-SNAPSHOT", "accumulo-adee0f12": "Add data integrity checks to Key and Mutation", "accumulo-397f86f6": "applied patch", "accumulo-76d727f0": "merged to trunk", "accumulo-46f62443": "employed more TableNotFound / TableExists Exceptions in TableOperations - merged to trunk", "accumulo-add180fb": "employed more TableNotFound / TableExists Exceptions in TableOperations", "accumulo-15476a0d": "made mock accumulo sort incoming mutations the same as accumulo", "accumulo-3d55560a": "made mock accumulo sort incoming mutations the same as accumulo (merged from 1.4)", "accumulo-28294266": "InvocationTargetEx in TraceProxy", "accumulo-f2920c26": "match Value implementation to javadocs. check for null args.", "accumulo-0dc92ca1": "Delegate math to commons-math", "accumulo-a64151e6": "GC changes : disallow a delete marker of hdfs://nn/, log a warning about invalid delete, and add test for bad delete markers", "accumulo-7ec60f1b": "Fix match boundaries for MockTableOperations.deleteRows to be consistent with actual accumulo instance", "accumulo-019edb16": "Fall back to the configuration when the iterator setting aren't in the split", "accumulo-17344890": "Refactoring BlockedOutputStream to not recurse. With test", "accumulo-6138a80f": "fixing Michael Allen's patch and adding test", "accumulo-1f7dd2d5": "offset history command by one", "accumulo-ff8c2383": "added logic to handle null keys for MockTableOperations.deleteRow", "accumulo-9fcca2ed": "Return a more real tableID", "accumulo-31aea2ad": "Correctly handle older internals.", "accumulo-f99b5654": "Add equals, hashCode and toString to batchwriterconfig.", "accumulo-11d11e0d": "keep better info on what tablet counts will be after balancing", "accumulo-023be574": "(De)serialize IteratorSettings on RangeInputSplit(s).", "accumulo-2fd7633f": "(De)serialize IteratorSettings on RangeInputSplit(s).", "accumulo-5eceb10e": "Include the table id when constructing an absolute path from a relative.", "accumulo-d6472040": "check for viewfs", "accumulo-f848178e": "Ensure table name is serialized in RangeInputSplit.", "accumulo-94c2a31f": "Guard against failure due to multiple invocations of MAC.stop", "accumulo-17654199": "Set StatusCombiner on accumulo.metadata during initialize.", "accumulo-ddd2c3bc": "Offline scan property is now being properly serialized. Added verification that all other booleans are being serialized.", "accumulo-72fd6bec": "Set 0 for monitor log4j port config value", "accumulo-1b35d263": "Set the list separator to \\0 to 'disable' list interpretation", "accumulo-891584fb": "Format long as decimal integer, not floating-point", "accumulo-15e83709": "Spelling error, missing hashCode/toString/equals on ZKConnectionInfo, and some extra braces.", "accumulo-9d8cc45d": "ACCUMULO-307 merged from 1.4", "accumulo-97f16db4": "Fix for AccumuloVFSClassloader conflicting cache directories", "accumulo-a3267d3e": "Fix broken DateLexicoder ordering", "accumulo-81d25bc2": "fixed PreciseNumberType and wrote a unit test to make sure it really does precise numbers", "accumulo-27d4ee21": "Remove requirement for properties on provided token.", "accumulo-cfb832a1": "use the value of the delete flag (with test)", "accumulo-7651b777": "Remove configError and use config(String...) retval", "accumulo-9339ecf8": "Fix race condition where master might delete node before tserver sees deletion.", "accumulo-db4a291f": "ACCUMULO-379 ACCUMULO-375 merged from 1.4", "accumulo-73ce9cfb": "make Mutation#hashCode and Mutation#equals not change the state of the mutation", "accumulo-47c64d9a": "fix ClientConfiguration.getAllPropertiesWithPrefix and add test", "accumulo-699b8bf0": "Only request shutdown to master once for tserver", "accumulo-36225565": "Use provided zookeeper hosts for tracing when present.", "accumulo-5ca779a0": "more better hashCode", "accumulo-a2c2d38a": "Fixed bug with ByteBuffers thats do not start at 0", "accumulo-27300d81": "Fix incorrect usage of ByteBuffer", "accumulo-5594b2e0": "fix index search", "accumulo-be2fdba7": "merge to trunk", "accumulo-4d23d784": "Fix the description of -b options", "accumulo-50db442b": "Fix the description of -b options", "accumulo-eb0f9b41": "Merge branch 'ACCUMULO-4138' into 1.6", "accumulo-116d5928": "made GrepIterator a Filter to handle deletions - trunk", "accumulo-ebf22df0": "expanded javadocs and added deletion handling to Filter", "accumulo-8dad5e0f": "created test and fixed seek behavior of FirstEntryInRowIterator - merged to trunk", "accumulo-dc9f23d9": "made timestamp filter support longs greater than max date - merged to trunk", "accumulo-9453bcfa": "Applied patch from Drew Farris that allows mock to create tables w/o versioning (merged from 1.4)", "accumulo-a450ac2f": "unit test out-of-range keys returned from an iterator stack", "accumulo-65390f8c": "implement deleteRows in MockAccumulo, fake locality groups, ignore merge requests", "accumulo-692efde2": "made visibilityfilter catch badargument exception", "accumulo-4aeaeb2a": "fix combiners over iterators that mutate their top key", "flink-02c08456": "TypeExtractor now also supports nested Tuple-input derivation", "flink-27e40205": "TypeExtractor resolves also variables inside Tuple-input", "flink-22c370d9": "Fix incorrect getter / setter detection", "flink-259f10c0": "Handle unions at the root of the iteration", "flink-6ecd0f82": "Prevent partitionings on subsets of fields from being pushed down", "flink-45fb6d82": "Fix Optimizer to create plans when encountering incompatible partitionings.", "flink-94c8e3fa": "[optimizer] Correctly tag static/dynamic path for auxiliary nodes in iterations.", "flink-63ef8e86": "Fixed getter/setter recognition for POJOs", "flink-9cd96df7": "Adds the new basic types Void and Date to the TypeInfoParser", "flink-fb7ce0e3": "API] Fixes copy() methods in PojoSerializer for null values", "flink-91f9bfc7": "Allow Interfaces and abstract types in TypeExtractor", "flink-d033fa8f": "Fixes wrong input validation if function has no generics", "flink-0a4c7694": "[distributed runtime] Fix loss of events at uninitialized input channels", "flink-21f47d9c": "[runtime] Adds proper EOFException forwarding to KryoSerializer.", "flink-8f321c72": "Remove tailing slash from paths. Add tests for Path and FileOutputFormat.", "flink-1f726e48": "[streaming] add parallel iteration test", "flink-5308ac83": "[taskmanager] Fix hostname lookup.", "flink-380ef878": "Fix IndexOutOfBoundsException when receiving empty buffer", "flink-39d526e6": "Consistent behavior of numeric value parsers.", "flink-7164b2b6": "Fix for file paths with Windows drive letters", "flink-ccd574a4": "[runtime] Fixes NPE when TM receives a null input split", "flink-4dbf030a": "[runtime] Improve exception when bufferpools have been shut down.", "flink-adb321d6": "Fix NullPointerException in delta iteration due to missing temp", "flink-0078c44e": "Fix POJO deserialization for reuse objects with NULL fields", "flink-495a5c3c": "[streaming] Add ExecutionConfig serialization for streaming jobs", "flink-6bc6dbec": "Fix erroneous emission of Sliding Time PreReducer", "flink-0cfa43d7": "[streaming] Create own context for chained streaming operators", "flink-d594d024": "[runtime] Fix CancelTaskException handling", "flink-03340919": "Fix the recursive summation in FileInputFormat.addFilesInDir", "flink-fef9f115": "[streaming] Fix partitioned state next-input setting for copying chained collectors", "flink-a56aad74": "[runtime] Check if parent released before querying in-memory buffer in SpillableSubpartitionView", "flink-a41bc8cc": "handle the case of a non-public default ctor in TypeExtractor.analyzePojo", "flink-30761572": "[fix] FieldPositionKeys support Pojo fields", "flink-5546a1ef": "[java api] TypeExtractor returns wrong type info when a Tuple has two fields of the same POJO type", "flink-a17d4e82": "[runtime] Check parent state in isReleased() check of partition view", "flink-d738430c": "[streaming] BarrierBuffer releases temp files properly.", "flink-06e2da35": "[job manager] Checkpoint coordinator triggers checkpoints only when tasks are running.", "flink-948b6e05": "[core] Allow quoted strings in CSV fields to contain quotation character inside of the field, as long as its escaped Ex: 'Hi my name is \\'Flink\\''", "flink-ce68cbd9": "fieldsGrouping for multiple output streams fails  - added SplitStreamTypeKeySelector and JUnit tests", "flink-3e233a38": "[streaming] Set StateCheckpointer before default state value", "flink-63d9800e": "[streaming] Set state restore to lazy to avoid StateCheckpointer issues and reduce checkpoint overhead", "flink-8b40bb7a": "[streaming] Fix ArrayKeySelector", "flink-68912126": "Fixed FixedLengthRecordSorter write to multi memory pages issue and add more unit tests.", "flink-af477563": "[runtime] Fix hash table spilling partition selection.", "flink-b654e989": "[kryo] Fix Kryo serialization to clear buffered data", "flink-88a97768": "[streaming] Remove cyclic watermark dependencies for iterations", "flink-e494c279": "[streaming] KeySelectorUtil interacts well with type extraction", "flink-5dfc897b": "[streaming] FileMonitoring function logs on empty location", "flink-17e7b423": "Fix Avro getter/setter recognition", "flink-76bebd42": "[runtime] Fix broken spilling of MutableHashTable", "flink-59685903": "[streaming] Let AbstractUdfStreamOperator forward output type information to WindowFunction", "flink-5a86a0a1": "[runtime] Fix cancel during restart", "flink-a402002d": "[runtime] Disallow ExecutionGraph state transition from FAILED to RESTARTING", "flink-8dc70f2e": "[optimizer] Fix instantiation of bulk iteration candidates", "flink-937963e3": "[runtime] Defer start of checkpoint ID counter", "flink-a5b05566": "Fix argument parsing of CLI client INFO action", "flink-117ba95f": "[runtime] Return empty stats for unknown operator", "flink-44061882": "Fix colocation group re-instantiation", "flink-6968a57a": "[runtime] Enforce terminal state of Executions", "flink-ed3810b1": "Disable reference tracking in Kryo fallback serializer", "flink-8fc7e7af": "[streaming] Fix case where early cancel messages do not properly cancel a stream operator.", "flink-8e3e2f8f": "[runtime] Fix checkpoint statistics state size overflow", "flink-d90672fd": "[runtime] Fix interplay of automatic Operator UID and Changing name of WindowOperator", "flink-734ba01d": "[runtime] Prevent canceling Execution from failing", "flink-434e88fd": "[FLINK-3563] [core] TypeExtraction input type validation fixes", "flink-e3759a5e": "[cep] Add proper watermark emission to CEP operators", "flink-f2f5bd5b": "Make Session Window State Checkpointed", "flink-494212b3": "Fix StateDescriptor.readObject", "flink-dc78a747": "[core] Enable Kryo reference tracking", "flink-32a003d5": "Fix for bug in union replacement", "wicket-7e1000dd": "", "wicket-b154d12f": "", "wicket-01a3dd66": "", "wicket-3431e60d": "Make sure that bookmarkable urls for classes containing non-ascii characters is encoded properly.", "wicket-6c5083b4": "Make sure that bookmarkable urls for classes containing non-ascii characters is encoded properly.", "wicket-bb7f9cf5": "check successful rendering of page before validating headers", "wicket-99e22ce4": "bug fix for http://issues.apache.org/jira/browse/WICKET-172 1> remove(child) would only look at the id, not at the instance. 2> addedComponent was first called before removedComponent (switched) some code cleanup.", "wicket-5226978a": "Fixed testing things that require cookies persisted over multiple requests, such as CSRF protection in a hidden Form fields. An even more straight forward option would have been to remove clearing cookies in MockWebApplication.initialize(), and copy cookies to each request from response, because after all the lifecycle of a WicketTester (MockWebApplication) instance should be such that cookies could be preserved there.", "wicket-8ee095bf": "StatelessForm submitted to the wrong page Issue: WICKET-1897", "wicket-986848f7": "", "wicket-420ac965": "&amp; instead of & in javascript Issue: WICKET-2033", "wicket-e2d88568": "", "wicket-0578d6ee": "", "wicket-9da430fb": "", "wicket-ceac38b1": "", "wicket-b224bad8": "Fixing AjaxTimerBehaviorTest. It looks ok. The rendered outputs in both an AJAX and NOT-AJAX situation looks fine (escaping of \" is correct). JBQ, please use Java1.4 in any wicket1.x projects which requires this (String.replace(String, String) doesn't exist in 1.4)", "wicket-ea4a3f8a": "fixed WICKET-2172 PageParameters construced with keyValuePairs does not handle array values Issue: WICKET-2172", "wicket-d79d0192": "fix needed additional adjustment Issue: WICKET-2181", "wicket-24ac1a35": "fixed: Form gets submitted using AjaxSubmitBehavior when sub-form has error's Issue: WICKET-2202", "wicket-089303f4": "fixed and added test case: wicketTester.executeAjaxEvent(combo, \"onchange\"); works with 1.4-rc1 but not anymore with 1.4-rc2 Issue: WICKET-2261", "wicket-6e0b40bc": "fixed: MockHttpServletRequest is broken when used with CryptedUrlWebRequestCodingStrategy Issue: WICKET-2281", "wicket-96330447": "", "wicket-36a41358": "IndexOutOfBoundsException when PropertyResolver is using an invalid list index PropertyModel does not support index only property (\"[0]\") Issue: WICKET-2337,2354", "wicket-cd281092": "Localization messages stops working with validators since 1.4-rc2 Issue: WICKET-2350", "wicket-fae1601b": "fixed: Page.checkRendering fails after setting BorderBodyContainer visiblity to false Issue: WICKET-2368", "wicket-0f8a2990": "fixed:  Regression: \"Could not find child with id: <ID> in the wicket:enclosure\" for non-component tag Issue: WICKET-2506", "wicket-12e1f39b": "fixed CreditCardValidator accepts invalid inputs Issue: WICKET-2552", "wicket-9ced53a5": "fixed: Inheritance layout excludes XML header from output Issue: WICKET-2569", "wicket-7da4ad17": "EnumChoiceRenderer fix Issue: WICKET-2609", "wicket-c849f986": "Issue: WICKET-2621", "wicket-ef880545": "fixed MethodGetAndSet.setValue uses wrong source to determine which type to convert to when there's no setter Issue: WICKET-2624", "wicket-15477252": "ajax not working due to bugs in resource handling Issue: WICKET-2839", "wicket-ebe56869": "fixed WICKET-2882: IComponentResolver usage with Enclosure Issue: WICKET-2882", "wicket-0e70ce39": "look for bean definition in parent contexts WICKET-2901: only return a primary bean if it's the only one", "wicket-5c592d85": "WebRequestCodingStrategy: path mounting and matching", "wicket-3d8c9d75": "Adding a component in Component#onInitialize() leads to StackOverflowError", "wicket-0b4f78cc": "ClassCastException when requesting for non-page class", "wicket-b293b75c": "HomePageMapper ignores request to '/' with query string parameters", "wicket-d3dc9a50": "UrlUtils.isRelative returns false if URL parameter contains an absolute URL", "wicket-1b7afefc": "Issue: WICKET-3098", "wicket-4d7f7359": "meh. this caching will probably slow things down. and it can be difficult to find all the places in code where caching should be invalidated. lets hold off until it is a hotspot. Issue: WICKET-3166", "wicket-0cf14725": "Issue: WICKET-3174", "wicket-f1c0f263": "Issue: WICKET-3196", "wicket-be70e608": "fixed WICKET-3197: addOrReplace() failed with exception while copying markupId Issue: WICKET-3197", "wicket-5729ed90": "fixed WICKET-3222 AbstractMarkupParser doesn't remove Comments correctly Issue: WICKET-3222", "wicket-71b6e905": "- Preventing the attempt to resolve the property class for a null target at AbstractPropertyModel - Test asserting that there is no problem in working with an AbstractPropertyModel targeting an IObjectClassAwareModel not initialized with an known class. Issue: WICKET-3253", "wicket-c86b972a": "Set an request parameter on Wicket tester do not add it in the request URL", "wicket-60d07288": "DropDownChoice no selection value", "wicket-295e73bd": "IResponseFilter doesn't work in 1.5", "wicket-71499e17": "UrlAttributes are encoded incorrectly when style is null but variation is not", "wicket-7e7ab76c": "Issue: WICKET-3304", "wicket-debca73b": "Testing for not presented root nodes on root less trees Issue: WICKET-3309", "wicket-ddf7e8a2": "Links with multiple parameters are wrongly generated WICKET-2829 Tag attributes values are not escaped properly during writeOutput", "wicket-499a9c6b": "FLAG_INHERITABLE_MODEL and default model change", "wicket-be97d017": "Test case preventing problems during the page serialization process outside Wicket lifecycle Issue: WICKET-3420", "wicket-ffc0cae9": "Issue: WICKET-3428", "wicket-f1e854b3": "fixed: Value exchange in a wicket:message throws an exception (if inside a border) Issue: WICKET-3454", "wicket-f30bd1cb": "Issue: WICKET-3455", "wicket-292a2582": "", "wicket-4a875f46": "Mapping ResourceReferences to Urls is slow", "wicket-2b6da516": "SimpleTree example not working with CryptoMapper", "wicket-d1b62639": "SHOW_NO_EXCEPTION_PAGE responding with HTTP status 500 is overwritten by redirect", "wicket-a4459ef4": "Issue: WICKET-3539", "wicket-c62b66c1": "Interaction betwen IAjaxRegionMarkupIdProvider, renderPlaceholderTag and visibility", "wicket-5e2c6702": "Wicket 1.5 RC-3 Bug with conditional comments", "wicket-7c364566": "DatePicker issues with locale medium date format", "wicket-aa1d177a": "DataTable row groups are present in markup even when they contain no rows.", "wicket-7ae109a6": "Using render strategy ONE_PASS_RENDER fails for Ajax requests", "wicket-fbfd17e6": "improving BufferedWebResponse to invoke set header actions before write in response. Issue: WICKET-3618", "wicket-1a2bc1bc": "Changing AjaxRequestTarget and BufferedWebResponse to don't discard the filtered AppendingStringBuffer response if the filter returns a new instance. Issue: WICKET-3620", "wicket-ab1856db": "Improved exception handling strategy to not fail when multiple handlers are returned: just use the first one that is available. Issue: WICKET-3644", "wicket-12124902": "No more calling of requestcyclelistener#onScheduleHandler with null handler Issue: WICKET-3646", "wicket-1b57b51c": "Fixed a regression between Wicket 1.4 and 1.5, where markup ID generation/retrieval caused runtime exceptions in cases where the component was not added to the Page yet. Improved the semantics of Component#getMarkupId() and encased it in a couple unit tests. Issue: WICKET-3647", "wicket-a08562a7": "quickie test fix, need to think some more about this :/ Issue: WICKET-3702", "wicket-e1168a57": "org/apache/wicket/protocol/http/request/UserAgent matches method is not correct", "wicket-557de7bc": "Improving the FileUpload#writeToFile method to not rely on HTTP session existence Issue: WICKET-3715", "wicket-5ad32df9": "fixed: Component's markup cannot be found in Ajax requests if the parent is transparent Issue: WICKET-3719", "wicket-1858bc18": "The Url's query parameters are not properly URL encoded", "wicket-48454f4d": "Ajax behaviors are failing in stateless pages", "wicket-84c3baac": "Issue: WICKET-3767", "wicket-b4e9d426": "WicketSessionFilter and HttpSessionStore use different attribute name for Wicket Session", "wicket-30255f11": "WicketTester does not follow absolute redirects: make Url.parse(..) capable of parsing absolute urls", "wicket-747bccb5": "WicketTester does not follow absolute redirects", "wicket-843b76b1": "regression on strategy to integrate cas authentication", "wicket-97514205": "In wicket 1.5 urlFor returns incorrect string for package mounted pages", "wicket-afc7034d": "allow empty header values since they are valid based on RFC2616", "wicket-d1e0e411": "fixed: AbstractTransformerBehavior sets wrong namespace Issue: WICKET-3861", "wicket-3feb0e3a": "- detach models recursively Issue: WICKET-3872", "wicket-b772ff87": "Null model for AttributeAppender should not render empty attribute", "wicket-beb9086d": "setResponsePage in AjaxLink goes always to localhost:8080 instead to the right host and port", "wicket-aadaa4e9": "PageParameters#set not follow INamedParameters#set behavior", "wicket-8fbdc68f": "Component markup caching inconsistencies", "wicket-6051019b": "A (stateless) page immediately disappears after the first render", "wicket-6a8fc1cc": "fixed by letting the sourcing strategies also look for transparent containers Issue: WICKET-3989", "wicket-b76f9c44": "CreditCardValidator returns incorrect cardId for VISA", "wicket-38e928c1": "Header contributions order is not stable", "wicket-d35d2d85": "Component's onAfterRender() is called so many times as it is depth in the component tree + 1", "wicket-e60bac5f": "Wicket 1.5 Form Post Action and Link Get discard Page Class Information", "wicket-f1c9cef2": "MarkupContainer.toString(true) fails with MarkupNotFoundException if the call is made in the component constructor", "wicket-081cdeb2": "ResourceMapper throws IllegalStateException when attempting to map a request to a URL ending in a empty segment (directory)", "wicket-5f69685d": "Issue: WICKET-4030", "wicket-f3d7565c": "Don't create an empty PageParameters if the original is null.", "wicket-4d3d1f85": "RestartResponseAtInterceptPageException.InterceptData is never cleared", "wicket-d450acb0": "Issue: WICKET-4070", "wicket-7d5b8645": "", "wicket-1dcaec98": "SmartLinkLabel doesn't recognize already tagged links", "wicket-e743fd7e": "Issue: WICKET-4102", "wicket-64656c98": "Using ajax to update a component that has an AbstractTransformerBehavior attached throws a ClassCastException", "wicket-8f7805f8": "AutocompleteTextField after Submit does not work - PageProvider no longer pushes PageParameters into previously stored pages.", "wicket-4624ab3d": "Ajax link reports wield error when session is expired", "wicket-bb7a6995": "FileResourceStream returns unknown content type", "wicket-8967eb2b": "let wizard initialize its own steps", "wicket-7c89598a": "BookmarkablePageLinks not working on a forwarded page", "wicket-2737d7c7": "visibility is now checked in onInitialized", "wicket-84bbbf68": "Incorrect URL for setResponsePage() within a Form#onSubmit( )", "wicket-a0150366": "", "wicket-5fd03973": "ListenerInterfaceRequestHandler should not assume existence of a page", "wicket-53bcb78d": "Multipart Form and AjaxSubmitLink will result in invalid redirect after user session expires", "wicket-c250db9c": "allow longer authorities in the url, such as \"local\" Issue: WICKET-4255", "wicket-09166ea8": "block onbeforerender() from being called if auth strategy vetoes render action Issue: WICKET-4256", "wicket-1f128536": "Preventing the AjaxEditableLabel from loose its model object type when initializing its editor component Issue: WICKET-4259", "wicket-925cae5c": "remove leading dot in sendRedirect()", "wicket-32c76c4a": "Select keep selection on form error", "wicket-4a6a573b": "Really fix WICKET-428, complete with unit test.", "wicket-d906576c": "More fixes off the back of WICKET-428, this time for MicroMap.", "wicket-e1953357": "take page parameters from page for links on mounted pages", "wicket-9cb617ae": "MockHttpServletResponse.addCookie(Cookie) adds duplicate cookies", "wicket-50b52742": "ByteArrayResource throws error if data is null", "wicket-b4274415": "StringValueConversionException for correct situation", "wicket-e24874da": "StringResourceModels doesn't seem to detach properly", "wicket-9decad35": "POST params ignored by IPageParametersEncoder#decodePageParameters()", "wicket-4f08e6f2": "CryptoMapper does not work for applications having a home page that needs query parameters", "wicket-02ebc8ae": "BufferedWebResponse fails to add/clear cookie in redirect", "wicket-1485a856": "Form components' name/value are encoded in stateless form's action url", "wicket-7ca927c1": "HttpSession getSession() in MockHttpServletRequest is not compliant with the j2ee servlet spec", "wicket-7a162f77": "org.apache.wicket.validation.ValidatorAdapter class causes problem with validator properties to be loaded", "wicket-614e3b50": "cleaning up PageParameters in AbstractBookmarkableMapper returns an empty instance if no parameters are left after sanitizing instead of 'null' which by wicket definition indicates that we have no page parameters", "wicket-5d64196a": "XsltOutputTransformerContainer not necessarily has xsl markup type", "wicket-f88721fd": "Any empty url-parameter will make wicket 1.5 crash", "wicket-246d53c5": "(with aggressive cleanup, but with the option to override)", "wicket-54c86ebb": "PageProvider should create a new Page instance if PageParameters are changed, even if a stored page exists.", "wicket-2624d2db": "SmartLinkLabel escape minus in pattern", "wicket-53442bb4": "Component#setDefaultModel() should call #modelChanging()", "wicket-e6582c52": "URL with a previous page version ignores requested page based on mount path", "wicket-35843c19": "HtmlHandler wrongly handles tags not requiring closed tags if the markup does not have \"top\" level tag", "wicket-a4caaa57": "unescape markup attribute during parsing, don't unescape while rendering", "wicket-b672cb2d": "url must be decoded for local files", "wicket-4ee5ad1f": "Stack overflow when render malformed html.", "wicket-a88882f7": "remove empty segments when resolving relative url", "wicket-e62ded51": "discrepancy between JavaDoc and code in MarkupContainer#visitChildren()", "wicket-b91154ea": "Inline enclosure doesn't work if wicket:message attribute is used on the same tag", "wicket-ccb8fc9e": "Inline enclosure doesn't work if wicket:message attribute is used on the same tag", "wicket-9a6a06be": "NullPointerException in org.apache.wicket.markup.html.form.ValidationErrorFeedback", "wicket-dfc56674": "DiskDataStore returns the wrong page when the page disk space is full", "wicket-c66cf607": "Link always causes Page to become stateful, regardless of visibility", "wicket-556a2236": "Do not use the parsed PageParameters when re-creating an expired page", "wicket-5e1bf8d8": "added test that stateless pages get page parameters", "wicket-9dab1bb5": "bug in Duration.toString(Locale locale)", "wicket-b19a3d69": "WicketTester.assertRedirectUrl always fails because it always thinks the redirect was null", "wicket-dd1df04b": "onError now called post-order, just like onSubmit", "wicket-ef3adb12": "last visible tab's css", "wicket-ccd74641": "preventing exceptional responses from being cached and overlay next requests replay on the same address", "wicket-2fcb3417": "Complement for WICKET-4664", "wicket-f3ec1503": "XmlPullParser doesn't parse correctly attributes with complex namespace", "wicket-89184b79": "MountMapper does not support correctly parameter placeholders", "wicket-f5f802c5": "MIN_VALUE of Double and Float is not minimum number", "wicket-4fc82e35": "WebApplication doesn't recognize if an incoming request is multipart.", "wicket-6a1b2f61": "'exact' variable is missing", "wicket-a7ce7f91": "fileNameModel wrapOnAssignment and detach", "wicket-21a47387": "unwrap wrapped header items when resolving bundles", "wicket-87ae870f": "cast if possible", "wicket-fd910746": "fix form validation bug where form components would remain invalid until their error messages were rendered", "wicket-2f1ece4b": "JavaScriptStripper fails with single line comments", "wicket-cda34428": "render PageHeaderItems all at once", "wicket-1ac05533": "keep multiple named values and absent indexed values", "wicket-eccb3b11": "JavaScriptReference escapes given URL", "wicket-6f0863f4": "url rendering regression: keep trailing empty segment if base still has segments but relative has not", "wicket-66bfc885": "Handling of semicolons in form action URLs", "wicket-ad849602": "set port explicitly, it won't be rendered by UrlRenderer if not required", "wicket-8b294488": "ConverterLocator should create a new instance for all date based converters", "wicket-ce172da8": "Return error code 400 when an Ajax request has no base url set in header/request parameters.", "wicket-6470c3f7": "semicolon (;) starts segments if no slash is present", "wicket-d78132be": "additional query parameters have to be added to the new url", "wicket-8c827e33": "allow headers to be set even if meta data is no longer buffered", "wicket-f20b2d70": "testing recreateMountedPagesAfterExpiry before to recreate a mounted page", "wicket-a4a3a9a6": "replace space with non-breaking space between digits only", "wicket-ee02c883": "more restrictive condition for using bookmarkable urls", "wicket-917dd2b5": "cache minified name correctly", "wicket-2b1ce91d": "Page not mounted with WebApplication#mountPackage", "wicket-56169634": "Page mount with an optional named parameter overtakes a mount with more specific path", "wicket-8e6a6ec5": "fail early if fragment markup is no fragment tag", "wicket-6e794ad0": "404 Error on Nested ModalWindows in IE7 and IE8", "wicket-a2f848f2": "404 Error on Nested ModalWindows in IE7 and IE8", "wicket-d3d42d42": "404 Error on Nested ModalWindows in IE7 and IE8", "wicket-faaae8d3": "404 Error on Nested ModalWindows in IE7 and IE8", "wicket-381b90fd": "Cookies#isEqual(Cookie, Cookie) may fail with NullPointerException", "wicket-217fbb3b": "ensure consistent JavaScript ordering with Wicket's IHeaderRenderStrategy for Ajax responses and removing special handling of Ajax response in AjaxEventBehavior, i.e. not calling appendJavaScript()", "wicket-581c7306": "make id of enclosure stable in markup so that InlineEnclosure is resolved once only", "wicket-ba516f02": "AbstractOptions does not use its model", "wicket-74e77676": "enforce mount for mounted pages only", "wicket-d110e307": "", "wicket-ed780cc7": "parentheses are valid in url path", "wicket-518c933b": "Url#toString(StringMode.FULL) throws exception if a segment contains two dots", "wicket-4b7367ef": "Problems with cookies disabled when using 301/302 and also 303 (even with cookies)", "wicket-e8dab4a0": "", "wicket-184e51e9": "Merge remote-tracking branch 'upstream/master' into bugfix-WICKET-5147-cookies-wickettester-second-try", "wicket-961f2477": "URL query parameter values containing equals sign get cut off", "wicket-0d4d1df7": "Session should be bound when adding messages to it", "wicket-34634266": "StringResourceModel doesn't detach model in some cases", "wicket-2293764f": "Base url is incorrect for error dispatched pages", "wicket-9e6efa61": "The DateTimeField.onBeforeRender() method does not format the fields correctly.", "wicket-55eb5212": "NPE when using ComponentRenderer.renderComponent on a panel with <wicket:enclosure>", "wicket-8e518d88": "CDI integration fails in Glassfish 4.0 with WELD-000070", "wicket-9c8f658a": "use #isValid() instead of #hasErrorMessage() as the FormComponent does too", "wicket-b61fe92c": "Wicket generates invalid HTML by expanding col tags", "wicket-44a4132f": "don't map handler when value for required placeholder is missing", "wicket-6122df49": "", "wicket-3d2393c7": "Merge branch 'WICKET-5251' of https://github.com/CedricGatay/wicket into WICKET-5251", "wicket-6ce34ccf": "", "wicket-a9e56e1e": "Fix WICKET-5259: skip username+password when searching for portnumber", "wicket-0eb596df": "recreate fence mark when removing and readding a fencedfeedbackpanel", "wicket-c863b032": "do not encrypt full urls", "wicket-ded3c583": "Wicket doesn't encrypt links and Ajax URLs when CryptoMapper is used", "wicket-3fc7234e": "Url.canonical() breaks when there are two consecutive \"parent\" segments followed by a normal segment", "wicket-61122bab": "fixed equals for different locales", "wicket-19e7c1cd": "don't use possibly conflicting encoding from XML declaration when parsing a String", "wicket-6cefb9f8": "Behaviors#internalAdd(Behavior) erroneously gets id for stateless behaviors", "wicket-87fa630f": "BOM in UTF markup file breaks encoding detection", "wicket-e350f19e": "properly handle groups in NonNull constraint", "wicket-fb45a781": "reset stateless flag on render, since stateful components might be added *and* removed", "wicket-8ccb1f6d": "IResourceCachingStrategy implementations should only set caching if version matches", "wicket-a382917f": "fixed Time.getHour() to use 24-hour clock", "wicket-2abc18f1": "close generated divs", "wicket-a3a5a40f": "always reset FLAG_PREPARED_FOR_RENDER, so stateless page is re-prepared before next render", "wicket-c1c1f794": "watch out for null component; break early from method", "wicket-813d8bee": "don't request a group's markup, since this will result in a log warning if the group does render its body only (the default) - formerly encoding of the group's markup id in the check/radio's CSS class is no longer needed with WICKET-4797 anyway", "wicket-ecdfc124": "rendering and writing of a page should never happen on an Ajax request, even if other circumstances imply otherwise", "wicket-a79ed51e": "WebPageRenderer should honor RedirectPolicy.ALWAYS_REDIRECT more consistently", "wicket-724066f4": "NPE in JsonUtils when the value is null", "wicket-825da305": "Ignore the path parameters when reading the page class", "wicket-6cceff44": "DefaultPropertyResolver does not respect JavaBean conventions", "wicket-c2e12216": "support unmodifiable collections as well as models without setter", "wicket-5b730c0b": "Failing HTTPS redirect to RequireHttps annotated pages with ONE_PASS_RENDER strategy", "wicket-f1af9e03": "initialize Page before calling into instantiationListeners", "wicket-aa82ccfc": "BookmarkableMapper now checks if a page is mounted to work properly if we use CryptoMapper and we are enforce page mounting", "wicket-204849bc": "PackageMapper - Could not resolve class", "wicket-44f4782a": "PackageMapper issue [WICKET-5565]. The compatibility score is not correct.", "wicket-5efb8091": "Unable to find markup for children of deeply nested IComponentResolvers during Ajax response", "wicket-57d8f051": "Rescheduling the same ajax timer behavior causes memory leak in the browser", "wicket-cd414fa5": "Dequeueing problem when there is TransparentWebMarkupContainer around <wicket:child/>", "wicket-5cdc1c8d": "Stateless/Statefull pages - incorrect behaviour", "wicket-1fb66533": "absolute URLs stay absolute after encoding", "wicket-240ab3c3": "OnChangeAjaxBehavior attached to DropDownChoice produces two Ajax requests in the last versions of Chrome, Opera and IE", "wicket-d558004b": "clear FLAG_INHERITABLE_MODEL reliably", "wicket-f539c18c": "PropertyResolver does not scan for NotNull in annotation tree", "wicket-9aec4f33": "@SpringBean(name=\"something\", required=false) still throws org.springframework.beans.factory.NoSuchBeanDefinitionException: No bean named 'something' is defined", "wicket-8e794fc4": "@Inject should require the bean dependency instead of setting null", "wicket-2ac29d30": "Nested Redirects and REDIRECT_TO_BUFFER", "wicket-f45ce896": "WebApplication#unmount() unmounts the whole compound mapper if some of its inner ones matches", "wicket-087c0a26": "WebSocketRequestHandler is not set as a scheduled and thus RequestCycle#find(AjaxRequestTarget.class) doesn't work", "wicket-0f8a6d75": "ResourceUtils.getLocaleFromFilename cannot handle filenames with classifiers", "wicket-5837817c": "OnChangeAjaxBehavior should listen for both 'inputchange' and 'change' events for TextField and TextArea", "wicket-145da021": "SecuritySettings.setEnforceMounts() does not work when the mounted mapper is not in the root compound mapper", "wicket-2fc6a395": "Method Strings.join doesn't work correctly if separator is empty.", "wicket-b92591f6": "Queueing component in autocomponent", "wicket-3cc3fe95": "Component queuing breaks with html tags that don't require close tag.", "wicket-71674df5": "Problem with WICKET-4441 and RestartResponseAtInterceptPageException", "wicket-bcea89fc": "NullPointerException in IntHashMap WICKET-5584 DiskDataStore error", "wicket-0374c040": "AjaxRequestAttributes extra parameters aren't properly handled in getCallbackFunction()", "wicket-cf6172bd": "PageParametersEncoder should not decode parameters with no name", "wicket-7b8b6767": "Multiple events in AjaxEventBehavior with prefix 'on'", "wicket-b6259e5f": "fixed copying of requests", "wicket-b1f4e6a3": "URL IPv6 parsing", "wicket-e93fdd5a": "Last-modified header of external markup is ignored", "wicket-b80f6640": "and WICKET-5861: number converters are based on BigDecimals now", "wicket-8c83c5c5": "FormComponent#updateCollectionModel must check convertedInput for null before wrapping into ArrayListFormComponent#updateCollectionModel must check convertedInput for null before wrapping into ArrayList", "wicket-cd3b9234": "Feedback messages not cleared for invisible/disabled form components on submit.", "wicket-2d9ebf9a": "Parsing of ChinUnionPay credit card should use the first 6 characters", "wicket-b00920f3": "avoid to search component resolvers inside transparent containers", "wicket-ffdd0864": "method searchMarkupInTransparentResolversrewritten to use container markup fragment", "wicket-def03add": "StackOverflowError in LoadableDetachableModel", "wicket-03663750": "drop headerResponse and renderedComponentsPerScope in #onAfterRender(), so a second rendering re-renders the header", "wicket-86066852": "Queuing a component within an enclosure", "wicket-31c88569": "Queuing a component in head", "wicket-d547fcd4": "Fixed locale from resource filename", "wicket-8b7946d8": "CachingResourceLocator lookup key doesn't take strict into account", "wicket-294b0b2f": "Servlet 3 Filter path calculated wrong", "wicket-eb125865": "Fix the behavior of MarkupContainer#get(int) for non-empty MarkupContainer and non-existing index", "wicket-a255bbca": "BaseWicketTester#startComponentInPage fails for pages with <wicket:header-items></wicket:header> placeholder", "maven-1bdeeccc": "PR: MNG-1205", "maven-4e955c05": "PR: MNG-1509 Submitted By: Bernd Bohmann Reviewed By: John Casey", "maven-b68c84b8": "[MNG-1703] <pluginManagement><dependencies> is not propagated to child POMs Submitted by: Edwin Punzalan", "maven-5d99b35c": "[MNG-1797][MNG-2420] Fixing exclusions that bleed over into other dependencies, and modifying DefaultProfileManager to (a) deprecate constructor that takes Settings but no properties, and (b) add a constructor that takes Settings and properties.", "maven-faa5cf27": "[MNG-1856] fix inheritance of the distribution management section and add tests", "maven-24db0eb9": "Dependencies in two paths are not added to resolution when scope needs to be updated in the nearest due to any of nearest parents PR: MNG-1895", "maven-806eaeb0": "[MNG-1895] merge changes from branch", "maven-ad38e46b": "[MNG-1999] fix reporting > excludeDefaults inheritance", "maven-778f044e": "[MNG-2174] Profile bug dealing with dependencies : [MNG-3877] Reporting directory base aligned.", "maven-cc859f5c": "[MNG-2221] Fixing caching of merged plugins to prevent them from appearing/executing twice in the resulting child POM. See two new unit tests in ModelUtilsTest for proof.", "maven-f0fcef7e": "[MNG-2281] 1.0-beta-3 should be < 1.0-SNAPSHOT", "maven-b92af0e4": "[MNG-2408] Modification to keep metadata files from writing when the main version is LATEST or RELEASE (these are meta-versions).", "maven-06090da4": "PR: MNG-2712", "maven-d7422212": "[MNG-2931] DefaultArtifactCollector changes the version of the originatingArtifact if it's in the dependencyManagement with another version", "maven-5ffd8903": "[MNG-3092] Version ranges with non-snapshot bounds can contain snapshot versions Submitted by: Mark Hobson", "maven-56cd921f": "MNG-3131: Error message is misleading if a missing plugin parameter is of a type like List", "maven-f6f4ef5e": "[MNG-3131] Error message is misleading if a missing plugin parameter is of a type like List", "maven-912a565f": "[MNG-3616] Null Pointer Exception when mirrorOf missing from mirror in settings.xml", "maven-2169c4a3": "[MNG-3991] POM validator allows <scope>optional</scope> but it is not valid.", "maven-0f3d4d24": "[MNG-4383] Uninterpolated expressions should cause an error", "maven-269c956e": "[MNG-4474] [regression] Wagon manager does not respect instantiation strategy of wagons", "maven-8cb04253": "[MNG-4512] [regression] Profile activation based on JDK version range fails if current version is close to range boundary", "maven-f5ebc72d": "[MNG-4518] Profile activation based on JRE version misbehaves if java.version has build number", "maven-03a383e3": "[MNG-4529] maven fails on IBM JDK 1.5.0 with exception IllegalAccessException: Field is final", "maven-c6529932": "Add solution to http://jira.codehaus.org/browse/MNG-4565", "maven-83389c34": "[MNG-4648] NullPointerException thrown from DefaultPluginRealmCache#pluginHashCode method if project-level plugin dependency misses version", "maven-bb39b480": "[MNG-4695] Missing Error during pom validation: \"You cannot have two plugin executions with the same (or missing) <id/> elements.\"", "maven-8cdb461f": "[MNG-4761] Fixing unit tests. system scope has to be preserved in plugin-level deps.", "maven-3fca2bb2": "[MNG-4837] Interpolation error due to cyclic expression for one of the POM coordinates gets needlessly repeated", "maven-1c3abfba": "[MNG-4915] Versions in pom.xml are not checked for invalid characters", "maven-691a03a7": "[MNG-4918] MavenProject#clone() doubles active profiles Submitted by: Sebastian Annies", "maven-469d0096": "[MNG-4933] With a resource directory as . maven raise an java.lang.StringIndexOutOfBoundsException:217", "maven-c4002945": "[MNG-4941] PluginDescriptorBuilder doesn't populate expression/default-value fields for mojo parameters", "maven-a7d9b689": "MNG-5003 populate mojo descriptor with cached plugin realm", "maven-2eb419ed": "[MNG-5075] MavenProject.getParent throws undocumented ISE", "maven-87884c7b": "[MNG-5209] MavenProject.getTestClasspathElements can return null elements Submitted by Jesse Glick.", "maven-ed651a4d": "[MNG-5209] MavenProject.getTestClasspathElements can return null elements Submitted by Jesse Glick.", "maven-712c4fff": "MNG-5212 preserve PluginDescriptor dependencies in descriptor cache", "maven-c53d95ce": "MNG-5212 preserve PluginDescriptor dependencies in descriptor cache", "maven-c225847e": "[MNG-5459] failure to resolve pom artifact from snapshotVersion in maven-metadata.xml", "maven-bef7fac6": "[MNG-5613] fix NullPointerException when error occur during project dependency graph creation Submitted by: Sebastian Le Merdy <sebastian.lemerdy@gmail.com> From: https://github.com/apache/maven/pull/13", "maven-af1ecd5f": "MNG-5645: When a number is not used in a version correctly, provide a better error. Submitted by: Phil Pratt-Szeliga", "maven-cdb8ad6d": "[MNG-5647] ${maven.build.timestamp} uses incorrect ISO datetime separator", "maven-96337372": "MNG-5655 deduplicate WeakMojoExecutionListener instances", "maven-3d2d8619": "[MNG-5687] Parallel Builds can build in wrong order", "maven-2d0ec942": "[MNG-5716] Add unittests for DefaultToolchainManagerPrivate", "maven-ce6f0bfd": "MNG-5727 fixed cryptic exception when managed depenency has no <version>", "maven-6ab41ee8": "MNG-5742 fixed null ComponentDescriptor#realm for extensions plugins", "camel-205420e2": "Fixed setting result message on Exchange when pipeline copy result back to exchange.", "camel-f7dd2fff": "Java DSL now fails fast if onException and the likes are not configured before routes, which they must.", "camel-4badd9c5": "Fixed property placehodler resolution on EIP in nested sub routes.", "camel-0919a0f6": "Fixed @OutHeaders when exchange is InOnly.", "camel-18e1a142": "Fixed splitter not using error handling if exception was thrown during evaluation of next splitted piece to use.", "camel-8433e6db": "Fixed Splitter not setting correltion correlation id from splitted exchange to their parent exchange.", "camel-320545cd": "Patch applied with thanks", "camel-e76d23b0": "Fixed in predicate to handle null results from expressions.", "camel-b345dd82": "Fixed issue with route scoped onException may pickup an onException from another route. Also fixes so it now prefers route scoped over context scoped.", "camel-b4606700": "Fixed splitter aggregating on-the-fly on the input exchange, where as it should have used a defensive copy, to avoid any side effects during splitting, such as an exception being set to be propagated back to the input message when splitting is done.", "camel-41e4b5b9": "Fixed scala content based router not evaluating as predicate.", "camel-b56d2962": "Use a copy of the incoming exchange for aggregation without sharing UoW. This ensures that on compleiton on the completed exchange always will be executed. This ensures the aggregation repository will always be confirmed, and the internal in progress map will have the completed exchange removed as well, preventing it from eating memory over time.", "camel-050c542e": "More eager method name check when using bean in Camel routes. Now also bean instances is checked.", "camel-02626724": "Fixed issue with file consumer using absolute starting directory.", "camel-2a3f3392": "Fixed endpoints not being registers in services to close as endpoints is enlisted in its own list. This prevents 2x shutdown of endpoints when Camel shutdown.", "camel-4c37e773": "InterceptFrom now works if using endpoint instances and not just uris", "camel-ff2713d1": "Fixed recipient list in parallel mode creating a new thread pool for aggregator background task.", "camel-c1b2f2f8": "Fixed mocking existing endpoints, stripping off parameters.", "camel-5225e6e3": "Fixed thrad pools naming not being quoted when registered in JMX.", "camel-9319e139": "Fixed marker file strategy not being thread safe. Thanks to Maria Iracheta for the patch.", "camel-52106681": "Fix some issues of ErrorHandler useOriginalMessage option", "camel-de9399f3": "Adding new type converter should remove it from misses cache.", "camel-b9094cb5": "Stopping a route doesnt stop error handlers as they could potentialy be shared by other routes.", "camel-cbffff59": "updated ObjectConverter.toX() methods to check for Double.NaN and return NULL instead of 0", "camel-4efddb3f": "endpoint uris now support multiple values for the same key.", "camel-96e40c3c": "Fixed issue with ExchangeSentEvent being emitted to soon when using async routing engine.", "camel-7345fefc": "Fixed issue with file consumer preserving existing headers when binding to exchange, so for example move done option can use custom headers.", "camel-f39bc60d": "Fixed log eip to ensure async callback is invoked. Thanks to Sergey for the patch.", "camel-79168a23": "LifecycleStrategy should be started/stopped when CamelContext is starting/stopping", "camel-06a8489a": "Fixed issue with file consumer not auto creating start dir if having dot in name. Thanks to Taariq for the patch.", "camel-e38494f1": "Fixed issue when exception thrown from using custom expression with Splitter EIP, not being triggered by onException.", "camel-f98ac676": "Fixed issue with routing slip EIP not propagating failed to resolve endpoint exception properly.", "camel-8e3450f4": "Marshal/unmarshal should clear OUT message in case of exception thrown.", "camel-9e05f77f": "Fixed simple ognl on exception function.", "camel-df9f4a6a": "Fixed issue with registering processors when using policy in a Camel route.", "camel-c408c3ed": "Fix the issue of using VM and splitter bean", "camel-1e54865c": "Improve restarting CamelContext to ensure lifecycle strategies is not lost.", "camel-afa1d132": "Fixed timer component suspend/resume issue.", "camel-8898d491": "bean component - @Handler should take precedence in a bean that implements Predicate", "camel-a8586a69": "Simple language - OGNL - Invoking explicit method with no parameters should not cause ambiguous exception for overloaded methods", "camel-8cadc344": "Improved Camel JMX working with WebSphere. Thanks to Christian Ohr for the patch.", "camel-033eb6fe": "Fixed file producer to use charset when writing files if given.", "camel-2db5570f": "Do not delete done file if noop=true", "camel-55c2e2d8": "Fixed seda endpoints shutdown and restart due advice with not picking up refreshed seda queue to use between producers and consumers.", "camel-4cf7e80e": "Fixed uri normalization to support % sign itself to be encoded as %25. Added explict % decimal encoding to normalization logic.", "camel-93935780": "SedaProducer should send to the right BlockingQueue being attached on the SedaEndpoint so that the sent messages don't get lost.", "camel-da05f5aa": "Fixed using sendEmptyMessageWhenIdle=true on a batch consumer such as File now working with Aggregate EIP when using completionFromBatchConsumer", "camel-b3bb8670": "Fixed threads EIP in recent commit.", "camel-a57830ed": "Fixed issue with onException and using -1 for maximumRedelivieries may cause side effect on other onException. Thanks to Øyvind Ingebrigtsen Øvergaard for the patch.", "camel-0e87b84f": "Camel proxy should not forward methods from java.lang.Object", "camel-15d0fd9b": "Bean component - Should use try conversion when choosing method based on parameter type matching.", "camel-78c73502": "Fixed recipientlist/multicast so depending on unexpected or exception during routing sets the redelivery exhaust property correctly. And that the doTry .. doCatch will reset the exhaust property to esnure exception is handled like the error handler would do in RedeliveryErrorHandler.", "camel-0c3c7d1b": "ProducerCache/ConsumerCache should use regular LRUCache to ensure prouducer/consumer is always stopped when evicted/stopping cache itself. As a soft cache may GC the entries without stopping any may cause internal resources running, which should have been stopped otherwise.", "camel-6d63a502": "Fixed NPE if all options disable on log formatter.", "camel-708e756d": "Fixed the Split inside Split - Parallel processing issue", "camel-3f70d612": "NotifyBuilder is now thread safe.", "camel-4a05eccf": "Fixed aggregate eip to dynamic completion size always override fixed size.", "camel-de6dd425": "Fixed the resolvement of the property placeholder in combination with the transacted DSL. Thanks to Claus Ibsen for providing a better patch as well as the unit-test for the camel-core module. I also added two tests for the camel-spring module using the propertyPlaceholder and bridgePropertyPlaceholder variants, also polished a tiny generics stuff of the ProcessorDefinition.resolvePropertyPlaceholders() method.", "camel-a04674f2": "Fixed issue with XML streaming tokenizer dealing with inheriting namespaces from parent tag. Thanks to Rich Newcomb for the patch.", "camel-e775071b": "Revert \"CAMEL-5844: Camel Tracer not showing some EIP names\"", "camel-020c451a": "Fixed CBR not working correctly when being nested. Also fixed endChoice to work better when nested.", "camel-2c5a42db": "Fixed AbstractListAggregationStrategy to work with completion from batch consumer.", "camel-7f8a295a": "Dump predicate/expression built from java dsl with builders to use toString when being dumped in route model xml.", "camel-4209fabb": "Fixed recipient list EIP to work with stream caching properly.", "camel-55751402": "Fixed routing slip and dynamic router EIP to work with stream caching properly.", "camel-2d7051ed": "fixed the issue that Tokenize XML does not support child elements with names similar to their parent", "camel-ed7e7c9f": "fix the IndexOutOfBoundsException when customized id of wireTap component", "camel-1fc7bd7a": "Loop EIP doesn't honour copy option in some circumstances; also add 'append' option to MyAsyncComponent for testing, such that it retains the input body for assertion purposes", "camel-617eab1c": "Bean using OGNL should accept null as valid response from OGNL invocation.", "camel-b92d6237": "Fixed Message history - Possible ArrayIndexOutOfBoundsException", "camel-745a85ab": "Bean parameter binding with boolean types should eval as predicates.", "camel-f412d744": "StaxConverter: encoding problems for XMLEventReader and XMLStreamReader. Thanks to Franz Forsthofer for the patch.", "camel-6b210169": "Fixed bean binding using parameter syntax style to eager check for compatible types, which avoids further type conversions which could cause problems with InputStreams.", "camel-cd40b712": "CBR - Should break out if exception was thrown when evaluating predicate", "camel-5761250c": "Fix for https://issues.apache.org/jira/browse/CAMEL-6918 - Error handler for SEDA producer doesn't work - added exception handling in the SendProducer + tests", "camel-4954d573": "Fixed file/ftp consumer when idempotent=true may not detect file changed as new file, due the file was regarded as still in-progress.", "camel-f744afd9": "Releasing a non-singleton producer by ProducerCache should not only stop the producer but also shutdown it as well if it is a ShutdownableService.", "camel-6b2ffb30": "Fixed file consumer on rollback to delete the done file if moveFailed is in use. Thanks to Christoph Giera for patch.", "camel-37e0e6bb": "Fixed browse as xml not returning files if includeBody=true.", "camel-4ed448c7": "Fixed updateRouteFromXML on route mbean to handle if the xml does not contain the route id, or does not match.", "camel-3244c1e5": "Using custom beans with @ManagedResource shows unavailable standard attributes", "camel-15e1077d": "Fixed stream caching to clean temp file when UoW done. Thanks to Franz Forsthofer for the patch.", "camel-00a9b02b": "Fixed the Scaner close issue in JDK7", "camel-6641f182": "Fixed the issue that tokenizeXml fails when attributes have a slash in them", "camel-7c9326f4": " Set XsltBuilder allowStax attribute to be true by default", "camel-cc192f87": "XsltBuilder uses the StaxSource by default", "camel-b6981cfd": "Fixed aggregator when completion size is 1, eg when completed asap. Should not call remove as we did not add.", "camel-095fa2b4": "Fixed throttler with dynamic header changing rate not as expected. Thanks to Michael Pisula for the patch.", "camel-5f726d0b": "BacklogDebugger - Should not change body/header type to string", "camel-1e33fcbc": "onCompletion should be called on agg strategy on splitter/multicast etc, just like it does in aggregte eip.", "camel-5f78c646": "Fixed the unit test failure of XmlConverterTest", "camel-336663c9": "NIOConverter need to call flip() when we put something into the buffer", "camel-ae419224": "Address the SchemaFactory thread safe issue.", "camel-18c23fa8": "Fixed the ByteBuffer to String conversion issue", "camel-a5a2f750": "GroupExchange in agg strategy should create a new exchange instread of copy, as then exceptions would be propagated which it shouldnt. Thanks to Luke Hamaty for unit test reproducing the issue.", "camel-44cad623": "Fixed doTry .. doCatch using recipient list/multicast etc. not working as expected to let the doCatch handle the errors.", "camel-fa165d6b": "Fixed interceptSendToEndpoint to match uris as it needed to be normalized.", "camel-91228815": "Some endpoints configured using beans may result in NPE under DEBUG mode", "camel-9cb09d14": "fixed the same issue with headerAs", "camel-e6fbbf04": "Throwing exception when bodyAs(type) has some addition text", "camel-7bbb88ba": "Rest DSL allows to configure properties for rest configuration.", "camel-cabee0e9": "Fixed JndiRegistry findByType to do correct type check.", "camel-43956f93": "Camel Properties Component concatenation issue", "camel-35bde2b2": "updated Throttler to use previous maximumRequestsPerPeriod value if missing", "camel-02da984a": "Make propertyPrefix/Suffix placeholder-aware", "camel-57ba1bde": "Fixed using RAW(xxx) in uris when xxx was ending with ). Thanks to Matthew Gill for the patch.", "camel-69b00a31": "Applying: CAMEL-7478 Fixed the simple language OGNL expression issue of length", "camel-85ced066": "Fixed POJO aggregating when the parameter type was referring to a type that was class annotated.", "camel-689147e9": "Fixed advice with when using CBR may add twice to when clauses in the CBR.", "camel-b3377b16": "OnComplete did not work with rollback", "camel-1f92fa42": "Removed duplicate getter on camelcontext mbean for message history.", "camel-e30f1c53": "Merge branch 'CAMEL-7611' of https://github.com/nkukhar/camel", "camel-faa20255": "Fixed bug with adviceWith after last code change in this area.", "camel-7ad36e3d": "Fixed issue with exchange may get stuck as inflight if creating producer fails when its used in dynamic eips such as routing slip etc.", "camel-eab06182": "Mock - Defining assertion on message doest work if using convertTo", "camel-19b2aa31": "Fixed the regression of MDCResetTest", "camel-d57f402b": "fix for CAMEL-7883", "camel-799b45df": "Fixed the issue that CircuitBreakerLoadBalancer fails on async processors with thanks to Matteo", "camel-d581c4a4": "IdempotentConsumer - If no messageId should allow Camel error handler to react", "camel-cac72b14": "Fixed the issue of Memory leak when adding/removing a lot of routes", "camel-2e985f9b": " Multicast Aggregator should keep processing other exchange which is not timeout", "camel-39ccf5d6": "XML parsing error is ignored by xtoknize XML tokenizer", "camel-36e7b668": "Avoid potential NPE when using @PropertyInject with Camel main.", "camel-53b4e90c": "Bean component should detect override methods that are assignable by type, so duplicate methods is not reported as error.", "camel-17475d80": "scheduled poll consumers may leak threads when restarting routes.", "camel-54d7fc59": "Using exchangePattern=xxx should override pattern in send/recipient list when sending to the destination.", "camel-dd0f74c0": "Ensure circuit stays open during halfOpenAfter period", "camel-57f72cd9": "Fixed the NPE in AbstractListAggregationStrategy if empty list", "camel-597883fa": "Bean component - Potential NPE in BeanInfo", "camel-d063f471": "Fixed leaking exchangesInFlightKeys in ManagedRoute if exchange failed.", "camel-7b1253db": "File componet readlock state should be per file so its possible to use pollEnrich to poll in a 2nd file and keep those state separated. Thanks to Andy Fedotov for unit test.", "camel-ea8ee025": "CamelContext API for routeStatus is wrong for suspended routes.", "camel-108d94f7": "Bean component - Should filter out abstract methods", "camel-9da2c05a": "RedeliveryPattern should support property placeholders.", "camel-08077733": "Fixed JMX leak when using ServicePoolAware producers. Thanks to Bob Browning for the test case.", "camel-e7ac45b6": "Relax uri validation check so & with ? is allowed", "camel-169b981e": "Fixed potential NPE in file rename when using move/moveFailed.", "camel-1957a828": "Invocation of Bean fails when Bean extends and abstract which implements the actual method. Thanks to Alex Paransky for unit test.", "camel-62b2042b": "NotifyBuilder.fromRoute() does not work for some endpoint types", "camel-1cab39f6": "Using working dir as default parent file for fileStore file when fileStore file has no parent file given.", "camel-baece126": "Fix using shareUnitOfWork with multicast and using onException with unhandled=false.", "camel-0ead2cac": "IdempotentConsumer - If exception from repo it should be able to handle by onException", "camel-9a6e6d8a": "Simple backwards parser bug if using file as prefix", "camel-da035952": "Propagate 'fault' property to soft copy", "camel-84922699": "ClassCastException with interceptFrom and using when with JMX. Thanks to Stephan Siano for the patch.", "camel-7944093f": "doTry .. doFinally should run the finally block for fault messages also", "camel-4d03e9de": "seda - discardIfNoConsumers=true do not call on completions", "logging-log4j2-0c20bfd8": "[LOG4J2-1008] org.apache.logging.log4j.core.config.plugins.util.ResolverUtil.extractPath(URL) incorrectly converts '+' characters to spaces.", "logging-log4j2-c79a743b": "LOG4J2-101 - A NullPointerException would occur if no format value was passed to the SyslogAppender.", "logging-log4j2-a96b455c": "[LOG4J2-1025] Custom java.util.logging.Level gives null Log4j Level and causes NPE.", "logging-log4j2-7f391872": "LOG4J2-102 - The Facility value was being improperly calculated.", "logging-log4j2-11960820": "[LOG4J2-1046] Circular Exception cause throws StackOverflowError.", "logging-log4j2-3b12e13d": "LOG4J2-104 - Convert LogManager binding to use regular java properties instead of XML properties to workaround a bug in Oracle's xmlparserv2 jar", "logging-log4j2-c8fd3c53": "[LOG4J2-1058] Log4jMarker#contains(String) does not respect org.slf4j.Marker contract.", "logging-log4j2-86d8944f": "[LOG4J2-1061] Log4jMarker#remove(Marker) does not respect org.slf4j.Marker contract.", "logging-log4j2-4cf831b6": "[LOG4J2-1062] Log4jMarker#add(Marker) does not respect org.slf4j.Marker contract.", "logging-log4j2-4786a739": "[LOG4J2-1067] ThrowableProxy getExtendedStackTraceAsString throws NPE on deserialized nested exceptions.", "logging-log4j2-e7bbeceb": "[LOG4J2-1068] Exceptions not logged when using TcpSocketServer + SerializedLayout.", "logging-log4j2-e9b628ec": "[LOG4J2-1069] Improper handling of JSON escape chars when deserializing JSON log events.", "logging-log4j2-88641f49": "LOG4J2-107 PatternParser was not properly handling adjacent nested options", "logging-log4j2-3f41ff48": "Add Charset serialization logic to address LOG4J2-1099.", "logging-log4j2-fc3e9d2d": "LOG4J2-113 StructuredDataFilter annotated KeyValuePairs with PluginAttr instead of PluginElement", "logging-log4j2-afcf92eb": "Fix LOG4J2-114 - StructuredDataMessage was validating the length of the value instead of the key", "logging-log4j2-8acedb4e": "LOG4J2-1153: Fixed NullPointerException when only root logger is defined (and no named loggers) in configuration properties file.", "logging-log4j2-9f924f10": "LOG4J2-1153: Fixed NullPointerException when only root logger is defined (and no named loggers) in configuration properties file.", "logging-log4j2-424068f7": "Fix LOG4J2-1251 JUL bridge issue.", "logging-log4j2-029e79da": "<action issue=\"LOG4J2-127\" dev=\"rgoers\" type=\"fix\">AbstractLogger methods were not passing Markers to the isEnabled methods.</action> Fixed error(Marker, Message) and fatal(Marker, Message).", "logging-log4j2-c6318b63": "LOG4J2-1310 - JndiLookup mindlessly casts to String and should use String.valueOf().", "logging-log4j2-1d12bf0e": "[LOG4J2-1372] XMLLayout indents, but not the first child tag (Event).", "logging-log4j2-ffedf33f": "[LOG4J2-1372] XMLLayout indents, but not the first child tag (Event).", "logging-log4j2-50e19247": "LOG4J2-139 - Fix NullPointerException when no protocol is specified. Regression introduced by fix for LOG4J2-228", "logging-log4j2-7792679c": "LOG4J2-1402 - Fix regression in properties configuration to support arbitrary component ids", "logging-log4j2-a523dcd5": "LOG4J2-1406 Fixed bug in ReusableParameterizedMessage where Throwable was never updated so first error was logged over and over again and subsequent errors were not logged.", "logging-log4j2-1461f1f6": "LOG4J2-143 - MessagePatternConverter now returns null if the log message is null.", "logging-log4j2-17296089": "LOG4J2-147 - ThreadContextMapFilter was matching on the key instead of the value of the key.", "logging-log4j2-f91ce934": "LOG4J2-177, LOG4J2-181 - Fix NPE in DatagramSocketManager and write header whenever the OutputStream is set in OutputStreamManager.", "logging-log4j2-aeb6fc9d": "LOG4J2-210 - MapMessage key value was not enclosed in quotes when generating XML", "logging-log4j2-ed951c76": "LOG4J2-219: don't ignore configured named loggers if root logger is not configured and a default root logger is installed. Improved docs.", "logging-log4j2-2d7d6311": "LOG4J2-234 - RegexFilter threw a NullPointerException when used as a context-wide filter.", "logging-log4j2-7b38965d": "[LOG4J2-258] HTML layout does not output meta element for charset.", "logging-log4j2-09175c8b": "[LOG4J2-259] HTML layout does not specify charset in content type.", "logging-log4j2-9d817953": "[LOG4J2-260] XML layout does not specify charset in content type.", "logging-log4j2-8faf7f77": "LOG4J2-268 - Add guid to FlumeEvent headers for non-Map Messages", "logging-log4j2-25cb587a": "[LOG4J2-293] Changed the ConfigurationFactory to recognize and properly use the classpath: URI scheme in addition to the classloader: URI scheme. Thanks to Abhinav Shah for the patch this change was based on.", "logging-log4j2-ca59ece6": "LOG4J2-293 - Reset the Configuration if the ClassLoaderContextSelector creates a LoggerContext without a configuration location and then is later provided one.", "logging-log4j2-300bc575": "LOG4J2-302: Added toString methods to ThreadContextStack/Map implementation classes", "logging-log4j2-3f1e0fdc": "LOG4J2-310 fixed issue where SMTPAppender does not send mails with error or fatal level without prior info event", "logging-log4j2-8dead3bb": "Fixed LOG4J2-344: Changed the Servlet 3.0 auto-initializer to add the filter by class to get around a WebLogic bug.", "logging-log4j2-1df1db27": "[LOG4J2-359] Changed the Servlet 3.0 auto-initializer so that it does nothing in a Servlet 2.5 or older application. This ensures behavioral consistency across containers. Thanks to Abhinav Shah for the patch this change was based on.", "logging-log4j2-296ea4a5": "Additional fixes for LOG4J2-359 to abort initialization if a duplicate filter already exists and to check the actual Servlet EFFECTIVE version.", "logging-log4j2-a8a24357": "LOG4J2-368 - Add PatternLayout constructor to Log4j 1.2 bridge for Velocity", "logging-log4j2-ef8517e4": "LOG4J2-378 - Add DateLookup and ThreadContextLookup to default lookups.", "logging-log4j2-7c2ce5cf": "LOG4J2-385 Fixed issues with time-based file rollover (monthly, weekly, hourly and every minute)", "logging-log4j2-731c84b5": "LOG4J2-392: bugfix: similar to stopping loggers in AbstractConfig.stop(), avoid starting the same AsyncLoggerConfig twice: this will mess up the ref count in AsyncLoggerConfigHelper", "logging-log4j2-a19ecc9e": "LOG4J2-395 - Allow classpath scheme when specifying configuration file location as a system property.", "logging-log4j2-2c966ad9": "LOG4J2-398 - Configure properties and setup Interpolator before processing rest of configuration.", "logging-log4j2-8f0c4871": "LOG4J2-410 - SLf4JLogger is now Serializable.", "logging-log4j2-238ce8aa": "LOG4J2-430 - Use the formatted Message in RFC5424Layout for non-StructuredDataMessages", "logging-log4j2-0343e9c7": "[LOG4J2-447] XMLLayout does not include marker name. Apply patch with changes, and also adjust layout documentation to fix element name casing.", "logging-log4j2-484c865f": "LOG4J2-464 - Support arrays in sub-elements", "logging-log4j2-7b9e48e8": "LOG4J2-466 fix for config files with a '+' character in their path", "logging-log4j2-50340d0c": "LOG4J2-470 - hostName property was not being set until after the first configuration element.", "logging-log4j2-11763dee": "[LOG4J2-478] The message and ndc fields are not JavaScript escaped in JSONLayout.", "logging-log4j2-24a3bed4": "LOG4J2-492 additional fix to handle line feed and carriage return characters in ObjectName value", "logging-log4j2-61ccbb95": "LOG4J2-492 escape contextName when unregistering LoggerContext, quote escaped newlines, drop \\r characters", "logging-log4j2-a759d8ae": "LOG4J2-492 Fixed MalformedObjectNameException if context name contains '=' character.", "logging-log4j2-837dcd89": "[LOG4J2-523] LocalizedMessage serialization is broken.", "logging-log4j2-3eb44094": "Fix LOG4J2-56", "logging-log4j2-bb02fa15": "LOG4J2-581, LOG4J2-675 RollingRandomAccessFile now writes the layout header after rollover; RollingFile and RollingRandomAccessFile now write the layout footer before rollover.", "logging-log4j2-3b4b370e": "LOG4J2-619 - correct bad fix", "logging-log4j2-a5a1f1a2": "LOG4J2-639: prevent NPE if AsyncLogger/AsyncLoggerConfig is used after log4j was shut down", "logging-log4j2-60f64cc1": "LOG4J2-668: Correctly process log events when combining AsyncLoggers with AsyncAppender", "logging-log4j2-3b2e880e": "Don't close NoSQL clients on commit.", "logging-log4j2-2afe3dff": "Fix for LOG4J2-71", "logging-log4j2-4b77622b": "[LOG4J2-742] XInclude not working with relative path.", "logging-log4j2-97203de8": "LOG4J2-763: Improved FormattedMessage, StringFormattedMessage, LocalizedMessage, MessageFormatMessage and ObjectMessage for asynchronous logging to ensure the formatted message does not change even if parameters are modified by the application. Improved docs for MapMessage and StructuredDataMessage. Improved site docs.", "logging-log4j2-b2ec5106": "LOG4J2-763: change ObjectMessage.equals() to account for the fact that the parameter may have been converted to a String during serialization", "logging-log4j2-73400bfb": "Add custom SLF4J marker support in log4j-slf4j-impl bridge.", "logging-log4j2-7bb1ad47": "[LOG4J2-811] SimpleLogger throws ArrayIndexOutOfBoundsException for an empty array. Introduce a new Rule to write with cleaner and more independent tests.", "logging-log4j2-0bea17d7": "[LOG4J2-813] MarkerManager Log4jMarker.hasParents() returns opposite of correct result.", "logging-log4j2-411dad65": "[LOG4J2-832] ThrowableProxy fails if a class in logged stack trace throws java.lang.Error from initializer. Finally got a test failing/passing.", "logging-log4j2-d3989b40": "[LOG4J2-834] ThrowableProxy throws NoClassDefFoundError.", "logging-log4j2-f9b0bbee": "[LOG4J2-892] JUL adapter does not map Log4j'2 FATAL level to JUL level.", "logging-log4j2-f8a42197": "[LOG4J2-914] ThrowableProxy.getExtendedStackTraceAsString causes NullpointerException.", "logging-log4j2-d8af1c93": "Fix LOG4J2-94 - Interpolator was not stripping Lookup key separator when trying to locate the default value for a variable.", "logging-log4j2-16ad8763": "[LOG4J2-964] StringFormattedMessage serialization is incorrect.", "logging-log4j2-43517f15": "[LOG4J2-965] System.out no longer works after the Console appender and JANSI is initialized.", "logging-log4j2-3cee912e": "LOG4J2-991: Async root logger config should default includeLocation to false", "commons-math-91d280b7": "MATH-1005 Array of length 1 must be handled as a special case.", "commons-math-a4ffd393": "MATH-1045 Singular matrices were considered non-singular due to strict comparison with zero. Reported and fixed by Sean Owen.", "commons-math-c979a6f0": "MATH-1045 Loop added to ensure that the largest norm is used in the singularity check. Patch provided by Sean Owen.", "commons-math-bda25b40": "[MATH-1051] Fix EigenDecomposition for certain non-symmetric matrices.", "commons-math-4ebd967c": "MATH-1058 Precision improvements by using \"expm1\" and \"log1p\". Thanks to Sean Owen.", "commons-math-996c0c16": "[MATH-1065] Fix EnumeratedRealDistribution.inverseCumulativeProbability. Thanks to matteodg and Phil.", "commons-math-aff82362": "MATH-1067 Avoid infinite recursion. Thanks to Florian Erhard.", "commons-math-b12610d3": "[MATH-1068] Avoid overflow in Kendalls correlation for large input arrays.", "commons-math-8e5867ed": "[MATH-1070] Fix Precision.round(float, int, int) for RoundingMode ROUND_UP. Thanks to  Oleksandr Muliarevych.", "commons-math-b285f170": "[MATH-1080] LinearConstraintSet returns now the LinearConstraints in the same order as they have been added.", "commons-math-63d88c74": "MATH-1088 Ensure that bad usage will raise an exception.", "commons-math-e91d0f05": "[MATH-1089] Precision.round(double, ...) will return negative zero for negative values rounded to zero.", "commons-math-7cfbc0da": "Fixed error when splitting an arc close to its end.", "commons-math-19c1c3bb": "Fixed sphere generation in degenerated cases.", "commons-math-faf99727": "Partly fixed MATH-1096.", "commons-math-a6f96306": "Fix checker seeing not old point", "commons-math-e2dc384d": "Fix switched iterations and evaluations", "commons-math-2a6c6409": "Build empty polyhedrons set when given equal min/max boundaries.", "commons-math-f4c926ea": "Build properly empty polygons for equal min/max box.", "commons-math-5a6ccd58": "MATH-1121 Use base class iteration counter. Reported by Ajo Fod.", "commons-math-a197ba85": "Fixed NullPointerException in BSPTree.", "commons-math-ba62c59d": "Fixed overflow in Precision.equals with ulps.", "commons-math-d4f978dd": "MATH-1129 Fix wrong sorting in the presence of NaN.", "commons-math-a7363a2a": "[MATH-1135] Fix MonotoneChain algorithm in case of collinear hull points. Thanks to Guillaume Marceau.", "commons-math-cc4ab51e": "Fixed BinomialDistribution to deal with degenerate cases correctly.", "commons-math-2f2a2dda": "MATH-1141 Allow same value for lower and upper bounds.", "commons-math-4080feff": "[MATH-1148] Fix MonotoneChain with collinear points as input: take tolerance factor into account when initially sorting the input points. Thanks to Guillaume Marceau for the report.", "commons-math-596ccd59": "[MATH-1165] Fix FuzzyKMeansClusterer when data points equal a cluster center. Thanks to Pashutan Modaresi", "commons-math-4aa4c6d3": "Made getKernel return a constant distribution for zero variance bins.  JIRA: MATH-1203.", "commons-math-b148046a": "Made getKernel return a constant distribution for zero variance bins.  JIRA: MATH-1203.", "commons-math-a56d4998": "MATH-1204 bracket function gives up too early", "commons-math-ce2badf0": "Corrected the fix for MATH-1208.", "commons-math-a06a1584": "Fixed wrong intersection selection in polyhedrons sets.", "commons-math-c44bfe00": "Fixed wrong event detection in case of close events pairs.", "commons-math-96eb80ef": "[MATH-1230] Throw a DimensionMismatchException if dimension of constraints and objective function does not match in SimplexSolver.", "commons-math-8f35fcb8": "Fixed error message for unknown parameter name in ODE.", "commons-math-471e6b07": "[MATH-1241] Propagate input value to Gamma#digamma and Gamma#trigamma if the input is not a real value to avoid infinite recursion. Thanks to Aleksei Dievskii.", "commons-math-09fe956a": "Changed data size check to be positive length, not > 1 to fix ResizableDoubleArray constructor failure on input array of length 1.", "commons-math-41f29780": "MATH-1256", "commons-math-03178c8b": "MATH-1257", "commons-math-4c4b3e2e": "MATH-1261", "commons-math-a94ff90a": "MATH-1269: fixed FastMath.exp returning NaN for non-NaN arguments", "commons-math-26e878ab": "Fixed infinite loop in FastMath.pow(double, long) with Long.MIN_VALUE.", "commons-math-fb007815": "MATH-1277: Fixed incorrect Kendall's tau coefficient calculation due to internal integer overflow. Thanks to Marc Rosen.", "commons-math-9e0c5ad4": "[MATH-1283] Fixed Gamma#gamma function for values smaller than -20. Thanks to Jean Noel Delavalade", "commons-math-56434517": "Detect start failures with multi-step ODE integrators.", "commons-math-1d635088": "MATH-1300", "commons-math-dbdff075": "fixed an error leading the simplex solver to compute the right solution but return another one JIRA: MATH-286", "commons-math-38983e82": "fixed an error induced by zero entries in simplex solver JIRA: MATH-288", "commons-math-b01fcc31": "fixed an error with negative constraints and unfeasible solution JIRA: MATH-290", "commons-math-59a0da9c": "Fixed a OutOfBoundException in simplex solver when some constraints are tight JIRA: MATH-293", "commons-math-2c8a114f": "Implemented alternative algorithm for generating poisson deviates when the mean is large. JIRA: MATH-294.", "commons-math-ef9b639a": "Fixed an overflow error in MathUtils.distance that was causing KMeansPlusPlusClusterer to fail with a NullPointerException when component distances between points exceeded Integer.MAXVALUE. JIRA: MATH-305 Reported by Erik van Ingen", "commons-math-0596e314": "Fixed parameter test in RandomDataImpl#nextExponential. JIRA: MATH-309.", "commons-math-83f18d52": "Fixed an index computation error in eigen decomposition. Once again, kudos to Dimitri for debugging this. JIRA: MATH-318", "commons-math-b2f3f6db": "Singular Value Decomposition now computes either the compact SVD (using only positive singular values) or truncated SVD (using a user-specified maximal number of singular values). Fixed Singular Value Decomposition solving of singular systems. JIRA: MATH-320, MATH-321", "commons-math-c06cc933": "changed SVD to compute either compact SVD (using only positive singular values) or truncated SVD (using only singular values up to a user-specified max number) started fix of SVD solver that did not compute a least square solution the fix is not complete yet as it seems the solution does not really gives the smallest possible residuals. See for example the commented out parts of testMath320A in SingularValueSolverTest. JIRA: MATH-320", "commons-math-ce185345": "fixed a wrong implementation of the Linf vector norm JIRA: MATH-326", "commons-math-262fe4c0": "Rewritten SVD implementation based on JAMA code.", "commons-math-6dd3724b": "Fixed regression in Frequency.getPct(Object) introduced in 2.0. Cumulative percent was being returned for Object arguments in place of percent.", "commons-math-8dd22390": "Fixed automatic step initialization in embedded Runge-Kutta integrators. The relative tolerance setting was never used, only the absolute tolerance was used. JIRA: MATH-338", "commons-math-f6dd42b4": "Fixed a missing bracketing check of initial interval in Brent solver JIRA: MATH-343", "commons-math-a0b4b4b7": "Fixed wrong return values when enpoints are roots in Brent solver with a user provided initial guess JIRA: MATH-344", "commons-math-4cc9a49d": "MATH-349 Removed deprecated methods.", "commons-math-061f5017": "Fixed an error in events handling in ODE solvers. In some rare cases, events occurring close to a step start were handled without truncating the step, making them appear as is they occurred close to the step end JIRA: MATH-358", "commons-math-3a15d8ce": "Fix a problem with the default sparseIterator when an array has exactly one non-zero element Submitted by: Albert Huang (with some style tweeks) Issue: MATH-367", "commons-math-f4a4464b": "Fix NullPointerException in BisectionSolver.solve(f, min, max, initial) JIRA: MATH-369", "commons-math-495f04bc": "MATH-370 Removed deprecated methods.", "commons-math-bb005b56": "Fixed loss of significance error in PersonsCorrelation p-value computation causing p-values smaller than the machine epsilon (~1E-16) to be reported as 0. JIRA: MATH-371 Reported and patched by Kevin Childs", "commons-math-bfe4623c": "Change the default value for those UnivariateStatistics that have a conventional value on the empty set. JIRA: MATH-373", "commons-math-c640932d": "MATH-377 fixed", "commons-math-d4b02f6a": "MATH-393 Fixed inconsistent definition of \"getResult\". Modified associated test accordingly.", "commons-math-962315ba": "MATH-395: Another bug uncovered; all things being equal, the code now behaves like the Puthon implementation. MATH-397: Modified \"BrentOptimizer\" following the changes in \"AbstractUnivariateRealOptimizer\".", "commons-math-784e4f69": "MATH-405 corrected", "commons-math-51aa6e6c": "MATH-413 (point 13) Selecting a random start value (instead of interval bounds).", "commons-math-5fe9b36c": "Modified NormalDistributionImpl.cumulativeProbability to return 0 or 1, respectively for values more than 40 standard deviations from the mean. For these values, the actual probability is indistinguishable from 0 or 1 as a double.  Top coding improves performance for extreme values and prevents convergence exceptions.", "commons-math-133cbc2d": "Fixed two errors in simplex solver when entries are close together or when variables are not restricted to non-negative.", "commons-math-a4b1948b": "MATH-471 MathUtils.equals(double, double) does not work properly for floats - add equivalent (float, float) methods and basic tests", "commons-math-6d6649ef": "MATH-482 FastMath.max(50.0f, -50.0f) => -50.0f; should be +50.0f", "commons-math-26a61077": "MATH-519 Workaround exception generated when the optimizer tries invalid values for the \"sigma\" parameter. Added a method to allow the user to pass his own initial guess.", "commons-math-b6bf8f41": "MATH-546 Wrong  variable type (\"int\" instead of \"double\").", "commons-math-fbbb96eb": "Reduced cancellation errors in Vector3D.crossProduct", "commons-math-328513f3": "Changed MathUtils.round(double,int,int) to propagate rather than wrap runtime exceptions.  Instead of MathRuntimeException, this method now throws IllegalArgumentException or ArithmeticException under the conditions specified in the javadoc. JIRA: MATH-555", "commons-math-fc409e88": "MATH-559 Removed \"assert\" statements.", "commons-math-2123f780": "Fixed add method to match javadoc contract when one or both addends has NaN parts.", "commons-math-334c01e6": "MATH-631 Work around infinite loop.", "commons-math-c0b49542": "MATH-631 Early detection of \"Regula Falsi\" algorithm being stuck due to finite precision. Javadoc makes it clear that either the Pegasus or the Illinois solver should be preferred over the Regula Falsi one (due to D. Hendriks).", "commons-math-ebc61de9": "MATH-631 Reverted to original behaviour.", "commons-math-8b418000": "Fixed a wrong detection of rotation axis versus vectors plane in Rotation constructor using two vectors pairs.", "commons-math-98556fed": "Fixed bugs in AbstractRandomGenerator nextInt() and nextLong() default implementations.  Prior to the fix for this issue, these methods generated only positive values.", "commons-math-32b0f733": "MATH-657 Complex division by zero:  z / 0 = INF if z is not ZERO  0 / 0 = NaN", "commons-math-97b440fc": "MATH-657 Reverting to previous behaviour, as requested by P. Steitz.", "commons-math-5e638976": "Fixed an integer overflow in OpenMapRealMatrix.", "commons-math-118f0cc0": "Fixed errors in SummaryStatistics causing overriden statistics not to be updated if the supplied impls are commons-math classes.  JIRA: MATH-691.", "commons-math-7980a242": "Fixed an event resetting issue in ODE.", "commons-math-b2e24119": "New implementation of AbstractRealDistribution.inverseCumulativeProbability(double). Solves MATH-699, and leads to slightly smaller execution times.", "commons-math-3f645310": "Fixed array indexing error in Variance evaluate method for computing the weighted variance of an array segment.", "commons-math-645d642b": "Improved Dormand-Prince 8(5,3) step interpolator accuracy at step start.", "commons-math-f656676e": "Fixed case of unconstrained variables that still occur in the objective function in simplex solver.", "commons-math-faa77857": "Fixed bracketing interval balancing in BracketingNthOrderBrentSolver.", "commons-math-3a08bfa6": "[MATH-718] Use modified Lentz-Thompson algorithm for continued fraction evaluation.", "commons-math-95d15eff": "Introduced tests to guard against overflow (MATH-722). Corrected Javadoc and updated unit tests accordingly.", "commons-math-1352a70f": "Made ISAACRandom clear its normal deviate cache on reseed. JIRA: MATH-723.", "commons-math-9c8bb934": "Fixed rounding error in RandomDataImpl nextInt, nextLong methods causing lower endpoints to be excluded when negative. Also improved robustness of nextUniform for extreme values and changed its contract to throw IAE when provided bounds are infinite or NaN.", "commons-math-69273dca": "fixed too long first step in fixed Runge-Kutta integrators.", "commons-math-d2777388": "Check first step size in embedded Runge-Kutta integrators.", "commons-math-f64b6a90": "MATH-738: New implementation of Beta.logBeta(double, double), based on the NSWC library of mathematical functions.   - increased accuracy   - deprecation of Beta.logBeta(double, double, double, int) as the new     implementation is no longer iterative.   - some private methods are tested through reflection.", "commons-math-8a83581e": "MATH-744 Fixed \"doubleValue()\" and \"floatValue()\" when numerator and denominator are larger than the range of the corresponding primitive type.", "commons-math-76b7413d": "[MATH-757] Removed broken and deprecated synchronization support in ResizableDoubleArray.", "commons-math-b9ca51f0": "[MATH-776] Use same range check in ctor as in setter for ElitisticListPopulation. Thanks to Reid Hochstedler", "commons-math-5b9302d5": "[MATH-778] Allow unlimited input values for Dfp#multiply.", "commons-math-ebadb558": "[MATH-779] Fixed iterator() method in ListPopulation to return an iterator of the unmodifiable list, thanks to Reid Hochstedler.", "commons-math-dd6cefb0": "Fixed a wrong assumption on BSP tree attributes.", "commons-math-3c4cb189": "[MATH-781] use epsilon criteria when deciding to drop columns after phase 1.", "commons-math-621bbb8f": "Fixed an error in rectangular Cholesky decomposition.", "commons-math-118e94b5": "Fixed a problem when building rotations from two pairs of vectors. In very rare cases, due to numerical inaccuracies the computed quaternion was not normalized (some examples went as high as 1.0e8) and even after normalization, the quaternion was plain wrong.", "commons-math-607c9ec6": "MATH-812: fixed a bug in RealVector.outerProduct(RealVector). Now loops through *all* entries of the vectors.", "commons-math-6eb46555": "MATH-812: fixed a bug in RealVector.dotProduct(RealVector). Now loops through *all* entries of the vectors.", "commons-math-a49e443c": "[MATH-828] Add additional heuristic for rare cases in pivotRow selection.", "commons-math-63a48705": "MATH-835 Avoid overflow.", "commons-math-d7c0f27e": "[MATH-836] Improve overflow check for negative values in Fraction constructor.", "commons-math-7994d3ee": "MATH-844 Generate an exception when the parameter guessing procedure cannot perform correctly (in rare ill-conditioned cases).", "commons-math-ad252a8c": "[MATH-848] Fixed Schur transformation for certain input matrices, changed index parameter names to indicate their purpose.", "commons-math-350f726c": "MATH-855 The best point is sometimes not the last one evaluated.", "commons-math-ac597cc1": "MATH-855 (second take). Best point must be returned.", "commons-math-66dece12": "Clarified definition of isSupportXxxBoundInclusive in RealDistribution interface, made code consistent with the definition, and deprecated these methods, marking for removal in 4.0. JIRA: MATH-859", "commons-math-abe53a53": "MATH-864 Fixed missing \"repair\" of a point that lies outside the boundaries. Thanks to Frank Hessen for the report and for pinpointing the cause of the problem.", "commons-math-b55e0206": "MATH-865 Early detection that overflow will occur in the variables normalization procedure (\"encode\" method). Warning mentioned in the documentation.", "commons-math-bfbb156d": "MATH-867 Previous commit was missing a crucial modification (in the \"repair\" method), an inconsistency which entailed the failing of some tests. With that modification (thanks to Nikolaus Hansen), it was established that the \"encode\" and \"decode\" steps were indeed useless. This commit thus removes them, and all the code that was necessary only because of those two methods. Finite and infinite can now be freely mixed. Unit tests that depended on those limitations were also removed (thus also the one that was added following MATH-865).", "commons-math-2a9cbbab": "Finalized fix for MATH-880.", "commons-math-2b852d79": "[MATH-891] SpearmansCorrelation now works correctly when provided with a NaturalRanking with NaNStrategy.REMOVED.", "commons-math-ce126bdb": "MATH-899 Fixed copy/paste bug.", "commons-math-6844aba9": "MATH-904. Fixed wrong assumption in \"pow\" method.", "commons-math-2836a6f9": "MATH-924 Avoid memory exhaustion for large number of unclorrelated observations.", "commons-math-b07ecae3": "MATH-924 Using a diagonal matrix to avoid exhausting memory.", "commons-math-185e3033": "MATH-927 Made \"BitsStreamGenerator\" class \"Serializable\" to allow cloning of subclasses. Added cloning test for all \"RealDistribution\" classes. Thanks to Dennis Hendriks.", "commons-math-cedf0d27": "MATH-929 Fixed truncated value. Thanks to Piotr Wydrych. Added unit test: comparing density values with univariate normal distribution.", "commons-math-724795b5": "Fixed Complex.reciprocal() for zero argument.", "commons-math-48dde378": "Fixed DerivativeStructure.atan2 for special cases when both arguments are +/-0.", "commons-math-73605560": "Fixed accuracy of 3D Line.revert().", "commons-math-49444ee6": "Allow covariance to be computed for one-dimensional variables.", "commons-math-0d057fc6": "Fixed creation of generic array.", "commons-math-f83bbc1d": "MATH-949 Increment iteration counter. By default, the maximum number of iterations is \"Integer.MAX_VALUE\".", "commons-math-424cbd20": "Fixed missing update in ODE event handlers.", "commons-math-9aabf587": "Fixed inverse cumulative probability for uniform distribution.", "commons-math-d270055e": "Fixed NullPointerException in 2D and 3D sub-line intersections.", "commons-math-86545dab": "[MATH-996] Fix creation of Fraction/BigFraction objects in maxDenominator mode when the value is close to an actual fraction.", "jackrabbit-oak-83427028": "OAK-1020: Property value converion ignores reisdual property definition", "jackrabbit-oak-2b5d3afb": "OAK-1024 Full-text search on the traversing index fails if the condition contains a slash", "jackrabbit-oak-e39b4d96": "OAK-1024 Full-text search on the traversing index fails if the condition contains a slash  - added dot character to the full-text checks", "jackrabbit-oak-ecc5bdfd": "OAK-1024 Full-text search on the traversing index fails if the condition contains a slash  - added node name to the full-text checks", "jackrabbit-oak-b2ca8baa": "OAK-1035 Property Index: cost calculation is wrong (zero) when searching for many values", "jackrabbit-oak-0adf3a6e": "OAK-1054 : Folder containing an admin user should not be removed", "jackrabbit-oak-79467350": "OAK-1075 XPath query failures for mvps", "jackrabbit-oak-9238264d": "OAK-1076 XPath failures for typed properties", "jackrabbit-oak-4ce4e3c9": "OAK-1081 - Node.getNodes throwing exception if user does not have access to any child node", "jackrabbit-oak-531aca78": "OAK-1093 IllegalArgumentException on Row.getValues()  - null guard", "jackrabbit-oak-d7f0f180": "OAK-1093 IllegalArgumentException on Row.getValues()", "jackrabbit-oak-2e20589f": "OAK-1094 CacheLIRS implementation incomplete", "jackrabbit-oak-be44b816": "OAK-1096 QueryManager does not have autorefresh  - fix and test", "jackrabbit-oak-7ae92779": "OAK-1104: SegmentNodeStore rebase operation assumes wrong child node order", "jackrabbit-oak-a8c925e0": "OAK-1108 Query constraints marked as invalid in the case of an mvp", "jackrabbit-oak-459bd065": "OAK-1111: Node#setProperty(String, Calendar) doesn't take time zone in account", "jackrabbit-oak-5286861d": "OAK-1122: Empty branch commit returns head revision on trunk", "jackrabbit-oak-2f95b81f": "OAK-1129: Repeated MongoMK.rebase() always adds new revision", "jackrabbit-oak-f64e8adc": "OAK-1155 PropertyIndex cost calculation is faulty", "jackrabbit-oak-c05cec12": "OAK-1168 : Invalid JCR paths not caught", "jackrabbit-oak-61c877d8": "OAK-1173 : NPE if TreePermissionImpl if tree does not have a primary type", "jackrabbit-oak-342809f7": "OAK-1174: Inconsistent handling of invalid names/paths", "jackrabbit-oak-84fb6b29": "OAK-1178: MutableTree#isNew: replace implementation by NodeBuilder#isNew", "jackrabbit-oak-f2bb1a17": "OAK-1178: MutableTree#isNew: replace implementation by NodeBuilder#isNew - Rebasing should correctly set the base state of the KernelNodeBuilder and the MongoNodeBuilder - MongoNodeBuilder needs to calculate its base state instead of relying on that of the MemoryNodeBuilder backing it", "jackrabbit-oak-f72dd8d1": "OAK-1184: Uploading large number of files to single folder fails.", "jackrabbit-oak-52372042": "OAK-1186: Parallel execution of ConcurrentReadAccessControlledTreeTest fails with MongoMK - change MongoMK.reset() to actually undo the commits, applying the reverse diff is not sufficient - additional tests", "jackrabbit-oak-cb3ac20d": "OAK-1208 Lucene Index should ignore property existence checks", "jackrabbit-oak-a9efe3c4": "OAK-1215 Wildcards in relative property paths don't work in search expressions", "jackrabbit-oak-e403e003": "OAK-1216 Path parsing must support SNS indexes, irrespective of SNS support", "jackrabbit-oak-3535afe2": "OAK-1225 Session.nodeExists(\"/foo/bar[2]\") must not throw PathNotFoundException", "jackrabbit-oak-117b0a3d": "OAK-1227 Node.hasNode(\"foo[2]\") must not throw PathNotFoundException", "jackrabbit-oak-1beb2a50": "OAK-1235 Upgrade should not overwrite new oak specific builtin nodetypes", "jackrabbit-oak-b4a93c81": "OAK-1244: Always create new UUID on ImportBehavior.IMPORT_UUID_CREATE_NEW", "jackrabbit-oak-0c3b3306": "OAK-1250 Guard against invalid/missing checkpoints", "jackrabbit-oak-25a70439": "OAK-1254: Parallel execution of SimpleSearchTest fails with MongoMK - publish current head revision first to revision comparator - enable tests", "jackrabbit-oak-b8fe2ded": "OAK-1269 NodeType index doesn't respect the declaringNodeTypes setting", "jackrabbit-oak-70564c7c": "OAK-1270 Revisit full-text queries in case of multiple tokens  - introduced a MultiPhraseQuery for the multiple token case  - fixed a bug in the tokenizer", "jackrabbit-oak-14849e22": "OAK-1287: java.lang.IllegalArgumentException when running FlatTreeWithAceForSamePrincipalTest", "jackrabbit-oak-0c3e3d70": "OAK-1289: Range check fails with IllegalArgumentException", "jackrabbit-oak-73cc2442": "OAK-1297: MoveDetector does not detect moved nodes that have been moved in an earlier commit already Properly annotate moved node in the face of moves from earlier commits", "jackrabbit-oak-69ba2a54": "OAK-1308 XPath queries with ISO9075 escaped properties don't work", "jackrabbit-oak-64045631": "OAK-1320: Inconsistent state in Mongo/KernelRootBuilder", "jackrabbit-oak-bc7b7e8c": "OAK-1348 : ACE merging not behaving correctly if not using managed principals", "jackrabbit-oak-438e31a7": "OAK-135: Better support for RangeIterators", "jackrabbit-oak-69b68890": "    OAK-1363", "jackrabbit-oak-05c89637": "OAK-1364 CacheLIRS concurrency issue", "jackrabbit-oak-b481a14c": "OAK-1364 CacheLIRS concurrency issue (allow concurrent clear and refresh without loader)", "jackrabbit-oak-ce0b0955": "OAK-1369 XPath queries: compatibility for missing @ in front of property names", "jackrabbit-oak-279bb3ce": "OAK-1429: Slow event listeners do not scale as expected", "jackrabbit-oak-c2f5ca6c": "OAK-1429: Slow event listeners do not scale as expected", "jackrabbit-oak-808ac9c0": "OAK-1432 Query: use \"union\" for complex XPath queries that use multiple \"or\"", "jackrabbit-oak-f1ba7a42": "OAK-1460: :childOrder out of sync when node is made orderable concurrently", "jackrabbit-oak-dde7de85": "OAK-1467: Commit.rollback() may remove changes from other commit", "jackrabbit-oak-7c62bd81": "OAK-1516 PhraseQuery fails due to missing posiion info in indexed fields", "jackrabbit-oak-86edbffb": "OAK-1614 Oak Analyzer can't tokenize chinese phrases", "jackrabbit-oak-6d8146f8": "OAK-1624: Item names with trailing spaces should not be allowed", "jackrabbit-oak-fdc54465": "OAK-1648: Creating multiple checkpoint on same head revision overwrites previous entries", "jackrabbit-oak-01a8b283": "OAK-1655 - DataStoreBlobStore does not take into maxLastModifiedTime when fetching all chunks", "jackrabbit-oak-c91bfa54": "OAK-1655 - DataStoreBlobStore does not take into maxLastModifiedTime when fetching all chunks", "jackrabbit-oak-3efb5cbf": "OAK-1662: Node not accessible after document split", "jackrabbit-oak-63070cf9": "OAK-1668 Lucene should not serve queries for what it doesn't index", "jackrabbit-oak-073b814c": "OAK-1674: Node isNew() is false in case the node is removed and added in same commit Treat a replaced builder as new, enable test cases", "jackrabbit-oak-1552be04": "OAK-1697 : Unresolved conflicts in TokenProviderImpl#createToken()", "jackrabbit-oak-c3773d53": "OAK-1719: Missing commit hooks in upgrade", "jackrabbit-oak-26041fe7": "OAK-1727: Cross foreign cluster revision comparison may be wrong", "jackrabbit-oak-7ba9dd66": "OAK-1729: DocumentNodeStore revision GC removes intermediate docs", "jackrabbit-oak-024e5d37": "OAK-1731: Repository upgrade does not copy default values of property definitions Copy default values of property definitions during upgrade", "jackrabbit-oak-8188ef54": "OAK-1739: Incorrect handling of multivalued comparisons in queries", "jackrabbit-oak-591e4d4a": "OAK-1749: AsyncIndexUpdate may resurrect nodes", "jackrabbit-oak-f37ce716": "OAK-1761 - DocumentNodeStore does not make use of References while serializing Blob", "jackrabbit-oak-192ee9e4": "OAK-1770: Document split suppressed with steady load on many cluster nodes", "jackrabbit-oak-9d36bede": "OAK-1779: Stale cache after MongoMK GC", "jackrabbit-oak-2426deae": "OAK-1784: Async index update persists conflict markers", "jackrabbit-oak-dd3437d4": "OAK-1788: ConcurrentConflictTest fails occasionally", "jackrabbit-oak-07646fba": "OAK-1789: Upgraded version history has UUIDs as jcr:frozenUuid of non-referenceable nodes", "jackrabbit-oak-08ba79d4": "OAK-1789: Upgraded version history has UUIDs as jcr:frozenUuid of non-referenceable nodes", "jackrabbit-oak-9f7c1df0": "OAK-1789: Upgraded version history has UUIDs as jcr:frozenUuid of non-referenceable nodes", "jackrabbit-oak-16225d51": "OAK-1793: MongoMK GC removes documents with data still in use", "jackrabbit-oak-077efee5": "OAK-1807 ConstraintViolationException seen with multiple Oak/Mongo with ConcurrentCreateNodesTest", "jackrabbit-oak-78c37386": "OAK-1817: NPE in MarkSweepGarbageCollector.saveBatchToFile during Datastore GC with FileDataStore", "jackrabbit-oak-016df669": "OAK-1822: NodeDocument _modified may go back in time", "jackrabbit-oak-3e83a4c1": "OAK-1822: NodeDocument _modified may go back in time", "jackrabbit-oak-ca36450e": "OAK-1829 IllegalStateException while trying retrieve rows information from QueryResult", "jackrabbit-oak-093b9128": "OAK-1848 Default sync handler property mapping does not allow constant properties", "jackrabbit-oak-7fe28a0e": "OAK-185: Trying to remove a missing property throws PathNotFoundException", "jackrabbit-oak-3ae276c1": "OAK-1874 Indexes: re-index automatically when adding an index", "jackrabbit-oak-716e1237": "OAK-1877: Hourly async reindexing on an idle instance", "jackrabbit-oak-9c2421ed": "OAK-1883 - Unnecessary invocations of LastRevRecovery when recovery already done.", "jackrabbit-oak-35562cce": "OAK-1894 PropertyIndex only considers the cost of a single indexed property", "jackrabbit-oak-b6f89048": "OAK-1899 Ordered index fails with old index content", "jackrabbit-oak-df59fb45": "OAK-1899 Ordered index fails with old index content", "jackrabbit-oak-705ce1d1": "OAK-1916: NodeStoreKernel doesn't handle array properties correctly", "jackrabbit-oak-9225a3e2": "OAK-1926 - UnmergedBranch state growing with empty BranchCommit leading to performance degradation", "jackrabbit-oak-913c2f53": "OAK-1932: TarMK compaction can create mixed segments", "jackrabbit-oak-c215b267": "OAK-1932 TarMK compaction can create mixed segments  - allowed the compactor to take into consideration the initial state", "jackrabbit-oak-2e16a983": "OAK-1933 Query: UnsupportedOperationException for some combinations of \"or\" and \"and\" conditions", "jackrabbit-oak-93c1aa40": "OAK-1959 AsyncIndexUpdate unable to cope with missing checkpoint ref", "jackrabbit-oak-4bfbfcdd": "OAK-1977 ContentMirrorStoreStrategy should utilize path restriction when available", "jackrabbit-oak-f620b79b": "OAK-1985 : TokenLoginModule can't handle case insensitive userids OAK-1984: adjust test case to match issue resolution", "jackrabbit-oak-004db804": "OAK-2021 XPath queries with certain combinations of \"or\" conditions don't use an index OAK-2022 XPath queries with \"order by\" are never converted to \"union\"", "jackrabbit-oak-e30023ba": "OAK-2029 - Oak Lucene index doesn't get notified about updates when index is stored on the file system", "jackrabbit-oak-a0a495f0": "OAK-2047: Missing privileges after repository upgrade Don't copy built in privileges", "jackrabbit-oak-ca63fdf3": "OAK-2047: Missing privileges after repository upgrade Run repository initialisers of the security configurations on upgrade", "jackrabbit-oak-4af0d4ee": "OAK-2049: ArrayIndexOutOfBoundsException in Segment.getRefId() - Applying Tom's fix - Asserting length <= buffer.length - More aggressive tests case", "jackrabbit-oak-5c4589bd": "OAK-2062 Range queries and relative properties resultset should be consistent with JR2", "jackrabbit-oak-daf9a4ef": "OAK-208: RootImplFuzzIT test failures", "jackrabbit-oak-c7669f31": "OAK-2117 - Reindex removes all nodes under index defenition node", "jackrabbit-oak-a1556c30": "OAK-2147 [Ordered Index] Indexing on large content is slow", "jackrabbit-oak-5931a4a7": "OAK-2174 Non-blocking reindexing doesn't finish properly", "jackrabbit-oak-f2740ce1": "OAK-2219 - Ordered index does not return relative properties for un-restricted indexes", "jackrabbit-oak-29d3d8f1": "OAK-2235 - Lucene index not created if no node is indexed", "jackrabbit-oak-a28098fd": "OAK-2238: Session.getItem violates JCR Spec Applying patch. Credits to Will McGauley", "jackrabbit-oak-dcadb0e1": "OAK-2246 : UUID collision check is not does not work in transient space", "jackrabbit-oak-6dde8e9d": "OAK-2249 Query with mixed full-text, \"and\", \"or\" conditions fails", "jackrabbit-oak-08b25cb0": "OAK-2250 - Lucene Index property definition is ignored if its not in includePropertyNames config", "jackrabbit-oak-e33328e0": "OAK-225 Sling I18N queries not supported by Oak (partial fix)", "jackrabbit-oak-0ac7ff20": "OAK-2260 TarMK Cold Standby can corrupt bulk segments", "jackrabbit-oak-57bd2dc5": "OAK-2288: DocumentNS may expose branch commit on earlier revision", "jackrabbit-oak-f4d5bbe1": "OAK-2308: Incorrect recovery of _lastRev for branch commit", "jackrabbit-oak-ca85ecce": "OAK-2311: Released checkpoint can still be retrieved", "jackrabbit-oak-1d08cbd3": "OAK-2318: DocumentNodeStore.diffManyChildren() reads too many nodes", "jackrabbit-oak-408a566e": "OAK-2330 - Field boost not working if the property for indexing is picked using aggregate index rules", "jackrabbit-oak-d0f6715d": "OAK-2336: NodeDocument.getNodeAtRevision() may read too many revisions", "jackrabbit-oak-a0dc4c89": "OAK-2345: Diff reads too many nodes", "jackrabbit-oak-74f22886": "OAK-2355 TarMK Cold Standby expose standby read timeout value  - default timeout value for tests is too small", "jackrabbit-oak-b3071839": "OAK-2359: read is inefficient when there are many split documents", "jackrabbit-oak-90ea7aa5": "OAK-2363: NPE in DocumentNodeStore#retrieve for non existing checkpoint Add null check and test case", "jackrabbit-oak-487de751": "OAK-2388 - Possibility of overflow in file length calculation", "jackrabbit-oak-0fa892b3": "OAK-2389 issues with JsopBuilder.encode and .escape", "jackrabbit-oak-7c320b1e": "OAK-2389 - optimize escape/encode not to encode characters >= 127, update tests (patch by Thomas Mueller)", "jackrabbit-oak-8079f7b5": "OAK-2389 - add handling for broken surrogate pairs, because they won't round-trip through UTF-8 (and some databases) otherwise", "jackrabbit-oak-24ce6788": "OAK-238 ValueFactory: Missing identifier validation when creating (weak)reference value from String", "jackrabbit-oak-039f892d": "OAK-2418 int overflow with orderby causing huge slowdown", "jackrabbit-oak-24cb1908": "OAK-2420: DocumentNodeStore revision GC may lead to NPE", "jackrabbit-oak-920f32d0": "OAK-2426 - [LucenePropertyIndex] full-text search on first level relative node returns no result", "jackrabbit-oak-e6d4f9a6": "OAK-2427 XPath to SQL-2 conversion fails due to escaping error", "jackrabbit-oak-be3a9114": "OAK-2430 TARMK Cold Standby size increase due to checkpoints copy  - switched sync to a different approach, to leverage existing recordid info", "jackrabbit-oak-7fca85bf": "OAK-2433: IllegalStateException for ValueMap on _revisions", "jackrabbit-oak-8159fc21": "OAK-2434: Lucene AND query with a complex OR phrase returns incorrect result Fixed by not flattening the boolean query", "jackrabbit-oak-7e250001": "OAK-2435: UpdateOp.Key.equals() incorrect", "jackrabbit-oak-beaca1a4": "OAK-2439 - IndexPlanner returning plan for queries involving jcr:score", "jackrabbit-oak-ea7a6199": "OAK-2442: NoSuchElementException thrown by NodeDocument", "jackrabbit-oak-60186813": "OAK-2465 : Long overflow in PermissionEntryProviderImpl", "jackrabbit-oak-977a31d8": "OAK-2524 - Error while configuring analyzer by composition", "jackrabbit-oak-239de7b8": "OAK-2528: Entries in _commitRoot not purged", "jackrabbit-oak-dfa87520": "OAK-2559 - Lucene index rules should be case insensitive", "jackrabbit-oak-77d2d3b0": "OAK-2603 - Failure in one of the batch in VersionGC might lead to orphaned nodes", "jackrabbit-oak-36fe017c": "OAK-2642: DocumentNodeStore.dispose() may leave repository in an inconsistent state", "jackrabbit-oak-72d24f4b": "OAK-2649 - IndexCopier might create empty files in case of error occuring while copying", "jackrabbit-oak-d2da7499": "OAK-2691: Blob GC throws NPE", "jackrabbit-oak-0598498e": "OAK-2695: DocumentNodeStore.dispatch() may pass null to NodeStateDiff", "jackrabbit-oak-429baf4d": "OAK-2740 : TreeTypeProvider treates optimized node type definition info as Ac-Content", "jackrabbit-oak-1bf5c550": "OAK-276 - potential clash of commit id's after restart - added test case", "jackrabbit-oak-db19e70f": "OAK-278: Tree.getStatus() and Tree.getPropertyStatus() fail for items whose parent has been removed", "jackrabbit-oak-3979fa8d": "OAK-2799 - close cloned OakIndexInput instances on close of main one", "jackrabbit-oak-f51ea2a2": "OAK-2864 XPath backwards compatibility issue with false() and true()", "jackrabbit-oak-a2950285": "OAK-2929: Parent of unseen children must not be removable", "jackrabbit-oak-44585b0c": "OAK-2933 AccessDenied when modifying transiently moved item with too many ACEs", "jackrabbit-oak-5449bf39": "OAK-296: PathUtils.isAncestor(\"/\", \"/\") should return false but returns true", "jackrabbit-oak-3bf07779": "OAK-2999: Index updation fails on updating multivalued property", "jackrabbit-oak-eabb4066": "OAK-3013: SQL2 query with union, limit and offset can return invalid results", "jackrabbit-oak-5135cf4b": "OAK-3019: VersionablePathHook must not process hidden nodes", "jackrabbit-oak-147515ae": "OAK-3020: Async Update fails after IllegalArgumentException", "jackrabbit-oak-494da6de": "OAK-3021: UserValidator and AccessControlValidator must not process hidden nodes", "jackrabbit-oak-89317b28": "OAK-3028: Hierarchy conflict detection broken", "jackrabbit-oak-7552a10b": "OAK-3053 - Locking issues seen with CopyOnWrite mode enabled", "jackrabbit-oak-33c18762": "OAK-3079: LastRevRecoveryAgent can update _lastRev of children but not the root", "jackrabbit-oak-29e5b734": "OAK-3082 : Redundent entries in effective policies per principal-set", "jackrabbit-oak-ba38c380": "OAK-3089 LIRS cache: zero size cache causes IllegalArgumentException", "jackrabbit-oak-25850476": "OAK-3099: Revision GC fails when split documents with very long paths are present", "jackrabbit-oak-38f5ef13": "OAK-3104: Version garbage collector doesn't collect a rolled back document if it was never deleted", "jackrabbit-oak-311e8b33": "OAK-3105: SegmentWriter doesn't properly check the length of external blob IDs Proper length check and unit test. Credits to Francesco Mari for the patch", "jackrabbit-oak-d10362c0": "OAK-3110 - AsyncIndexer fails due to FileNotFoundException thrown by CopyOnWrite logic", "jackrabbit-oak-f3c9c818": "OAK-3123: NPE in RecordIdMap * Properly guard against NPE * Added test case for empty map", "jackrabbit-oak-c65b07c3": "OAK-3137 - Global fulltext index returning plan for pure NodeType queries", "jackrabbit-oak-e115fd90": "OAK-313: Trailing slash not removed for simple path in JCR to Oak path conversion Thanks Chetan for the patch", "jackrabbit-oak-786b3d76": "OAK-3156 - Lucene suggestions shouldn't be restricted to specific node types", "jackrabbit-oak-64712735": "OAK-3249: Some version copy settings conflicts with the earlyShutdown", "jackrabbit-oak-4416a9f8": "OAK-3310: consistently check the checked-out state of a Node for property modifications", "jackrabbit-oak-e12e2052": "OAK-3318 - IndexRule not respecting inheritence based on mixins", "jackrabbit-oak-5f863af6": "OAK-3324 Evaluation with restriction is not consistent with parent ACLs", "jackrabbit-oak-194999ed": "OAK-3333: SplitOperations purges _commitRoot entries too eagerly", "jackrabbit-oak-06812d25": "OAK-3367 - Boosting fields not working as expected", "jackrabbit-oak-00b9bc52": "OAK-3377 Two spaces in SQL2 fulltext search -> error", "jackrabbit-oak-c83755c3": "OAK-3396 NPE during syncAllExternalUsers in LdapIdentityProvider.createUser", "jackrabbit-oak-978c77ff": "OAK-3411: Inconsistent read on DocumentNodeStore startup", "jackrabbit-oak-2f85bd78": "OAK-3412 - Node name having non space whitspace chars should not be allowed", "jackrabbit-oak-f4349a96": "OAK-3424: change ClusterNodeInfo to potentially wait for an abandoned cluster id to become available", "jackrabbit-oak-b76b31f7": "OAK-3433: Commit does not detect conflict when background read happens after rebase", "jackrabbit-oak-17032c50": "OAK-3442 - Intermittent IllegalMonitorStateException seen while releaseing IndexNode", "jackrabbit-oak-ff81ef72": "OAK-3474: NodeDocument.getNodeAtRevision can go into property history traversal when latest rev on current doc isn't committed", "jackrabbit-oak-01f5a26f": "OAK-3510 : Troublesome ExternalIdentityRef.equals(Object) implementation", "jackrabbit-oak-5138a1e2": "OAK-3511: Test failure: CompactionMapTest.removeSome Unconditionally clear recent keys on compress", "jackrabbit-oak-24f7f60a": "OAK-3517 : Node.addNode(String, String) may check permissions against the wrong node", "jackrabbit-oak-4d231938": "OAK-3530 : TreeTypeProvider returns wrong type for version related node type definitions", "jackrabbit-oak-9772f5b2": "OAK-3549: Initial read of _lastRev creates incorrect RevisionComparator", "jackrabbit-oak-2565d74a": "OAK-3579: BackgroundLeaseUpdate not scheduled when asyncDelay=0", "jackrabbit-oak-fcd64766": "OAK-3630 - Mixin based rules not working for relative properties", "jackrabbit-oak-90ad50da": "OAK-3634: RDB/MongoDocumentStore may return stale documents", "jackrabbit-oak-4e245a76": "OAK-369: missing support for relative path consisting of parent-element", "jackrabbit-oak-a5ff019e": "OAK-3733: Sometimes hierarchy conflict between concurrent add/delete isn't detected", "jackrabbit-oak-ab1a0cc2": "OAK-3763: EmptyNodeState.equals() broken", "jackrabbit-oak-306a9e00": "OAK-3769 - QueryParse exception when fulltext search performed with term having '/'", "jackrabbit-oak-94110f21": "OAK-3792 : Provide Simple Exception Name in Credentials Attribute for PW Expiry", "jackrabbit-oak-2ac1dccd": "OAK-3798: NodeDocument.getNewestRevision() incorrect when there are previous documents", "jackrabbit-oak-621a5101": "OAK-379: Query test failures on buildbot - revert changes from revision 1399172 - use default login module configuration when none is given", "jackrabbit-oak-2a02a138": "OAK-3817: Hidden properties in lucene analyzer configuration fail to construct analyzers", "jackrabbit-oak-c13708e3": "OAK-3872: RDBBlobStore - fix problem when cleaning up data rows", "jackrabbit-oak-4faf31e3": "OAK-3879 - Lucene index / compatVersion 2: search for 'abc!' does not work", "jackrabbit-oak-94c6c575": "OAK-3897: Branch reset does not revert all changes", "jackrabbit-oak-690fb9f4": "OAK-3903: Commit fails even though change made it to the DocumentStore", "jackrabbit-oak-99996c25": "OAK-3920 - OakDirectory not usable in readOnly mode with a readOnly builder", "jackrabbit-oak-b939aa6e": "OAK-3930 : Sysview import of single valued mv property creates sv property", "jackrabbit-oak-4ed7bc8e": "OAK-395 : Inconsistency in Node#setProperty in case of null value", "jackrabbit-oak-e6c31270": "OAK-395: Inconsistency in Node#setProperty in case of null value - return a Property instance at the location where the property was removed - updated tests in CRUDTest accordingly", "jackrabbit-oak-f4324736": "OAK-4036 - LuceneIndexProviderService may miss on registering PreExtractedTextProvider", "jackrabbit-oak-557eec4f": "OAK-4038 o.a.j.o.spi.query.Filter exposes unexported class o.a.j.o.query.ast.SelectorImpl", "jackrabbit-oak-52ca008c": "OAK-4050: SplitOperations may not retain most recent committed _commitRoot entry", "jackrabbit-oak-9a109aa3": "OAK-4066: Suggestion dictionary don't update after suggestUpdateFrequencyMinutes unless something else causes index update", "jackrabbit-oak-56accddf": "OAK-4067 - avoid building suggester with existing directory when no content is indexed", "jackrabbit-oak-9120fd1b": "OAK-4153 : fix for compareAgainstBaseState which properly handles deletion of last child and adding multiple new children in same go", "jackrabbit-oak-374e3f3d": "OAK-4166: Fixed version-related properties for the simple versionable nodes", "jackrabbit-oak-2a489d05": "OAK-4170 QueryEngine adding invalid property restriction for fulltext query", "jackrabbit-oak-36e70bd7": "OAK-421: NodeBuilder.reset might lead to inconsistent builder", "jackrabbit-oak-916cd92f": "OAK-428: Binaries might get removed by garbage collection while still referenced change prefix for binaries from bin: to :blobId:", "jackrabbit-oak-cdb34ffc": "OAK-4291: FileStore.flush prone to races leading to corruption Make SegmentBufferWriterPool.flush synchrnous again but avoid flusing segments while holding locks", "jackrabbit-oak-c02ecef8": "OAK-429: MemoryPropertyBuilder.assignFrom leads to ClassCastException on getPropertyState with date properties", "jackrabbit-oak-06c367af": "OAK-4300 - Cost per entry for Lucene index of type v1 should be higher than that of v2", "jackrabbit-oak-f303c916": "OAK-4307 SegmentWriter saves references to external blobs", "jackrabbit-oak-59a83d23": "OAK-4351: Non-root lucene index throws exception if query constraints match root of sub-tree", "jackrabbit-oak-b0014b7d": "OAK-4353: IndexOutOfBoundsException in FileStore.writeStream Define segment gc generation = 0 for bulk segments and consider the type of the segment in the gc generation methods accordingly", "jackrabbit-oak-74cbba24": "OAK-4358: Stale cluster ids can potentially lead to lots of previous docs traversal in NodeDocument.getNewestRevision", "jackrabbit-oak-002c5845": "OAK-4359: Lucene query fails if search string contains = symbol", "jackrabbit-oak-037dea72": "OAK-4376 XPath: queries starting with \"//\" are not always converted correctly", "jackrabbit-oak-ca05fd06": "OAK-4387 XPath: querying for nodes named \"text\", \"element\", and \"rep:excerpt\" fails", "jackrabbit-oak-e33516d5": "OAK-4397 : DefaultSyncContext.syncMembership may sync group of a foreign IDP", "jackrabbit-oak-668f08f2": "OAK-43: Incomplete journal when move and copy operations are involved", "jackrabbit-oak-d645112f": "OAK-4420: segment to segment-tar should migrate checkpoint info", "jackrabbit-oak-08f0b280": "OAK-4423 Possible overflow in checkpoint creation", "jackrabbit-oak-275eca83": "OAK-4423 Possible overflow in checkpoint creation  - fix for oak-segment", "jackrabbit-oak-7441a3d5": "OAK-4431 - Index path property should be considered optional for copy on read logic", "jackrabbit-oak-c9765c21": "OAK-4432: Ignore files in the root directory of the FileDataStore in #getAllIdentifiers", "jackrabbit-oak-00df38d2": "OAK-447: Adding a node with the name of a removed node can lead to an inconsistent hierarchy of node builders", "jackrabbit-oak-999097e1": "OAK-448  Node builder for existing node return null for base state", "jackrabbit-oak-a7f0e808": "OAK-478 NPE in the TypeValidator when using the Lucene Index", "jackrabbit-oak-3270e761": "OAK-479: Adding a node to a node that doesn't accept children doesn't fail with ConstraintViolationException", "jackrabbit-oak-b62f1c26": "OAK-47 Wrong results and NPE with copy operation (support the copy operation in the Indexer and the SimpleKernel)", "jackrabbit-oak-f2a2edec": "OAK-498: NamePathMapper should fail on absolute paths escaping root", "jackrabbit-oak-61381ea2": "OAK-499 SQL-2 query parser doesn't detect some illegal statements", "jackrabbit-oak-b896c926": "OAK-509: Item names starting with '{X}' cause RepositoryException", "jackrabbit-oak-f63d745a": "OAK-510: Multivalued properties with array size 0 forget their type", "jackrabbit-oak-ec961a38": "OAK-520 IllegalStateException in MemoryNodeBuilder", "jackrabbit-oak-90c45a02": "OAK-531: NodeBuilder deleted child nodes can come back", "jackrabbit-oak-a8493efc": "OAK-537 The Property2Index eagerly and unnecessarily fetches all data: remove unused code (the case where there is no index); make methods static when possible; use PathUtils instead of parsing the path itself", "jackrabbit-oak-ffa818f3": "OAK-539: Wrong compareTo in micro-kernel Id class", "jackrabbit-oak-3ce758b7": "OAK-543: PutTokenImpl not thread safe", "jackrabbit-oak-428e32c6": "OAK-546 Query: unexpected result on negative limit / offset", "jackrabbit-oak-717186d6": "OAK-548 Moving larger trees cause OutOfMemoryError (diff ignores depth for added nodes)", "jackrabbit-oak-3f51fb09": "OAK-554: PropertyStates#createProperty ignores namespace mappings when creating states of type NAME and PATH", "jackrabbit-oak-7d72e6ed": "OAK-579 Query: for joins, sometimes no or the wrong index is used", "jackrabbit-oak-9b268da0": "OAK-596 - Microkernel.diff returns empty diff when there are differences", "jackrabbit-oak-f0fbacab": "OAK-606: Node becomes invalid after Session#move() throw invalid item state exception on disconnected nodes", "jackrabbit-oak-df9e6913": "OAK-612: Calling addNode on a node that has orderable child nodes violates specification", "jackrabbit-oak-6feacf6b": "OAK-614: AssertionError in MemoryNodeBuilder", "jackrabbit-oak-00b4b8a0": "OAK-621: Moving or deleting tree instances with status NEW doesn't change its status to DISCONNECTED", "jackrabbit-oak-7a84b3a8": "OAK-642: NPE trying to add a node to an nt:folder node", "jackrabbit-oak-55a4f738": "OAK-644 : Revisit PrivilegeDefinitionStore's use of null as a child name parameter", "jackrabbit-oak-6c54045d": "OAK-678: Access to disconnected MemoryNodeBuilder should throw IllegalStateException", "jackrabbit-oak-8ed779dc": "OAK-738: Assertion error when adding node with expanded name", "jackrabbit-oak-35a7f014": "OAK-740 Malformed solr delete query", "jackrabbit-oak-503451c1": "OAK-748 ContentMirrorStoreStrategy fails to enforce uniqueness and is slow", "jackrabbit-oak-6fc5ea9d": "OAK-766: TreeImpl#*Location: unable retrieve child location if access to parent is denied tentative fix", "jackrabbit-oak-45b110e1": "OAK-782: MemoryNodeBuilder.setNode() loses property values", "jackrabbit-oak-7acb091a": "OAK-846: Branch conflicts not detected by MongoMK", "jackrabbit-oak-65aa40dd": "OAK-847: Condition check broken in MemoryDocumentStore", "jackrabbit-oak-6d82cb64": "OAK-888 : PathUtils#getDepth returns 1 for empty path", "jackrabbit-oak-e1ae968c": "OAK-926: MongoMK: split documents when they are too large - Parse PREVIOUS into Revision/Range on demand - More tests", "jackrabbit-oak-0be7e8f0": "OAK-93: Tree has wrong parent after move - Initial fix - Regression tests", "Bears-1": "Fix #1476", "Bears-2": "Fix #1506", "Bears-3": "Fix #1493", "Bears-4": "Fix #1501", "Bears-5": "Fixed #1367", "Bears-6": "Fix #935", "Bears-7": "Fixed #1505", "Bears-8": "Fixed #1513", "Bears-9": "Merge pull request #1534 from Tillerino/2.8  Fix #1533: Respect ACCEPT_EMPTY_STRING_AS_NULL_OBJECT for polymorphism.", "Bears-10": "Add enum handling wrt #994", "Bears-11": "Fixed #1570", "Bears-12": "Merge pull request #1574 from jjware/2.8  Fixes #1573", "Bears-13": "Fixed #1345", "Bears-14": "Fix #1599 for 2.7(.10)", "Bears-15": "Fix #1607", "Bears-16": "Improve error handling wrt #1612; add a test to verify exception being thrown", "Bears-17": "Fix #1616", "Bears-18": "Fix #1592", "Bears-19": "Fix #1595 for 2.8.9", "Bears-20": "Fix #1629", "Bears-21": "Fix #1648", "Bears-22": "Merge pull request #1650 from slobo-showbie/2.8  Fix #1647: Missing properties from base class when recursive types are involved", "Bears-23": "Fix #1657 (I hope)", "Bears-24": "Fix #1658", "Bears-25": "Fix #1679", "Bears-26": "Merge branch '2.7' into 2.8", "Bears-27": "fix(position): implicit elements do not have position (#1086)  Fix #1084", "Bears-28": "fix(comment): fix bug in comments in array initialization (#1088)  Closes #1073", "Bears-29": "fix(reference): fix reference in ctconstructor (#1095)", "Bears-30": "fix(NPE):Fix NullPointerException resulting from variable accesses in constructors. (#1098)  * Fix NullPointerException resulting from variable accesses in ctors.    `createVariableAccessNoClasspath` throws a NullPointerException if a  variable access is resolved for parameters in constructors as the parent  of constructor node is not available at this point.    * Add test case.", "Bears-31": "fix: visibility detection issue in CtElement #1099 (#1102)  * reproduce ElasticSearch access path problem #1099    * fix access path problem    * fix other tests    * Add one more assert on tests to check behaviour when overriding inner class. Replace some assertTrue by assertEquals to help debug test.", "Bears-32": "fix(CtQuery):CCE on Query#forEach call of CtConsumer#apply (#1126)", "Bears-33": "fix: getSuperClass does not throw exception in noClassPath mode. (#1128)  Fix #1125", "Bears-34": "fix(comment): support comment on string concatenation (#1124)  fix #1123", "Bears-35": "fix: Improve static import support in auto-import mode (#1155)  closes #1152", "Bears-36": "fix: fix autoimport regression (#1162)", "Bears-37": "fix: CtMethod#isDefaultMethod (#1165)", "Bears-38": "fix: fix regression with a lambda expression extends Function (#1178)", "Bears-39": "fix: LocalVariableScopeFunction handles CtFor, CtTryWithResource, local classes, ...  (PR #1154, close #1170)", "Bears-40": "fix: inner interfaces should be properly handled in CtTypeReferenceImpl#canAccess (#1189)", "Bears-41": "fix(noclasspath): fix the qualified name of partial qualified reference (inner class) (#1201)", "Bears-42": "fix: fix regression (NPE) in DefaultJavaPrettyPrinter (#1214)", "Bears-43": "fix: CtExecutableReference#isOverriding correctly handles anonymous classes (#1219)", "Bears-44": "fix: fix wrong behavior for special cases in removeStatement. Closes #1221. (#1224)", "Bears-45": "fix: fix bug in getDeclaration(). Closes #1213. (PR #1215)  This change impacts declaration lookup of field references after clone.", "Bears-46": "fix: fix NPE in CtElement#getMetadataKeys. Closes #1239 (#1240)", "Bears-47": "fix: fix a bug in wrongly qualified type in executable references  (#1259)  Closes  #1258    * Create a proper unit test for #1258 and propose a fix    * Add an assertion", "Bears-48": "fix: fix regression regarding actual type arguments resolving (#1273)  close #1271", "Bears-49": "fix: fix special case not handled in factory.Annotation().annotate() (#1278)  Close #1264", "Bears-50": "fix: fix JDT error when input resource contains an entirely commented class (#1279)  Close  #1274", "Bears-51": "fixx: fix bug in CtExecutableReference#getActualMethod when parameters are generically typed (#1277)", "Bears-52": "fix: fix SuperInheritanceHierarchyFunction in noClassPath mode (#1281)", "Bears-53": "fix: in noClasspath, a type without import should be considered in the same package as the current class (#1302)", "Bears-54": "fix: fix bug in import inference (auto-import mode). Close #1306. (#1308)", "Bears-55": "fix: improve ImportScanner to support variables called \"java\" (#1321)  fix #1320", "Bears-56": "fix: fix NPE in isTypeInCollision (#1326)", "Bears-57": "fix: auto-import works for compilation units with multiple classes in the same file (#1322)", "Bears-58": "fix: improve line preservation mode (#1335)", "Bears-59": "fix: fix bug in getActualMethod() due to missing information in CtTypeParameterReference (#1286)", "Bears-60": "fix behavioral in line-preservation mode: newlines should not pollute toString (#1349)", "Bears-61": "fix(factory): create type reference from inner class (#1361)", "Bears-62": "fix(template): Substitution#insertAll should bypass Template methods (#1348)", "Bears-63": "fix: fix regression related to ReferenceBuilder and generics (#1373)", "Bears-64": "fix: bugs related to continue algorithm of ClassTypingContext (#1379)  * test continue in hierarchy scanning of ClassTypingContext    * fix continue algorithm of ClassTypingContext", "Bears-65": "fix(reflection): add annotation value in the model (#1384)", "Bears-66": "fix: fix bug related to CtTypeParameterReference and getDeclaration (#1383)", "Bears-67": "fix: fix issue related to overridden methods in getAllMethods (#1375)", "Bears-68": "fix: fix a bug with import static  (#1412)", "Bears-69": "fix(role): fix wrong roles (#1397)", "Bears-70": "fix: fix NPE with union catch inside lambda in noclasspath (#1416)", "Bears-71": "fix: fix issue in ClassTypingContext#isOverriding (#1411)  close #1407", "Bears-72": "fix(prettyprinter): throws SpoonException with info instead of NPE in Pretty Printer on missing variable declaration (#1451)  * test of Printing of invalid model    * report error during printing", "Bears-73": "fix: ignore only ClassCastException in query code (#1462)", "Bears-74": "fix(reference): fix getReference of an unknown class that has the same name as an existing class (#1480)", "Bears-75": "fix: compute positions of elements (#1493)  * reproduce problem    * fix wrong modifier position for types    * test annotations position    * fix annotations position    * fix end position of Annotation with parameters    * test position of annotation with parameter    * test position of body of abstract and annotation method declaration    * fix position of body of abstract and annotation method declaration    * fix JavaDoc backward->forward", "Bears-76": "fix(template): object is not an template parameter implicitly (#1461)  * failing test of Object is always a template parameter    * fix Object is not a template parameter    * Revert \"failing test of Object is always a template parameter\"    This reverts commit ce7eb978a52f2e8f569b0d5c0dd1c1fd063c9589.    * Undo test changes", "Bears-77": "fix(comment): splitting of comment by EOL (#1455)  * test MS Windows EOL and comments    * test wild comments    * fix splitting of comment by EOL    * fix comment handling on Mac OS and imporove algorithm", "Bears-78": "fix: fix NPE in noclasspath mode (#1502)  Fix #1501", "Bears-79": "fix: fix issue related to processing generic types (#1504)  fix #1503", "Bears-80": "fix(setInputClassloader): bug when using a URLClassLoader with standard URLs. (#1507)  * Bug fix when using a URLClassLoader with file: URLs.    * Fix return problem and checkstyle. Add an assertion in compilation test.    * Add a new test to check the behaviour of setInputClassLoader when the classloader contains other resources than local files    * Now fail explicitely when setting a URLClassloader with other resources than local file", "Bears-81": "fix: fix a stack overflow when calling getDeclaration in noclasspath (#1515)  fix #1516     * Fixed test name.    * Fix a potential stack overflow with CtTypeParameterReference    * Improve test", "Bears-82": "fix(template): replacing of field access by refining behaviour of String parameter (#1476)  * test: reproduce the problem    * fix SubstitutionVisitor    * fix old tests - behavior changed!    * minor change to force Travis run again    * Revert \"fix old tests - behavior changed!\"    This reverts commit 7005aef70acb84e98590e7db44022a98587c6939.    * Add a new test corresponding to the example of #1444    * Only change the error comment when the contract is not respected with parameter value    * Add the new template test class    * Change SubstitutionVisitor to treat differently case A and case B    * Fix checkstyle    * test: field access in inner class    * rollback SubstitutionVisitor treat differently case A and case B    * convert String to Literal parameter value automatically    * disable one Substitution#checkTemplateContracts contract    * adapt test to pass SubstitutionVisitor changes    * adapt test InvocationTemplate    * adapt test FieldAccessOfInnerClassTemplate    * add GeneratedByMember required by new feature    * do not create CtLiteral automatically    * restore the Template Parameter constraint    * parameter of type String is simply substituted in method name    * If String literal is needed then template must already contain it    * report invalid field reference    * add path the the failing node into exception    * update Template documentation    * Fix PrinterTest    * Change documentation for Template    * Fix typo", "Bears-83": "fix(template): relax template parameter constraint (#1535)  * test CtTypeReference as Template parameter    * fix: TemplateParemeter proxy can be used for CtTypeReference", "Bears-84": "DATACMNS-957 - AuditingHandler now works with entities without an identifier.  Entities without an identifier previously an exception because the IsNewStrategyFactory wasn't able to determine a strategy even if there was no auditing to be applied in the first place.  We now eagerly check for auditability and skip the lookup for an IsNewStrategy completely in case that check returns false.  Related pull request: #189.", "Bears-85": "DATACMNS-972 - Fixed ProjectingJackson2HttpMessageConverter.canRead(…) for generic type variables.  ProjectingJackson2HttpMessageConverter.canRead(…) now resolves the given type correctly, even in context of their owning class.", "Bears-86": "DATACMNS-776 - Made ProxyingHandlerMethodArgumentResolver to only support user types or annotated ones.  ProxyingHandlerMethodArgumentResolver is now more lenient when it comes to which types to support for proxying. As indicated in the ticket, we've been to aggressive opting in for all interfaces which - depending on the order of converter registrations - caused us interfering with other interface based resolutions (e.g. in Spring Mobile, Security etc.).  We now only aggressively kick in if either the type or parameter is annotated with @ProjectedPayload or the type itself is not a Spring Framework or native Java one. This should leave user defined types still be accepted whereas the types we previously erroneously interfered with should now be ignored.", "Bears-87": "DATACMNS-1087 - Fixed Vavr Option creation from present value.  We now reflectively invoke the static method Option.of(…), while we previously tried to invoke an instance method on the parameter value.", "Bears-88": "DATACMNS-1115 - Improve RepositoryBeanNameGenerator to properly resolve bean names for indexed BeanDefinitions.  Previously, RepositoryBeanNameGenerator applied the custom bean name lookup if the BeanDefinition given was not a ScannedGenericBeanDefinition. That in turn had been the case for custom implementation classes that were obtained through classpath scanning. With Spring 5 an index file can be used by the scanner, which in turn will cause AnnotatedGenericBeanDefinition instances being returned. That caused the code path to lookup the first constructor argument to kick in (usually used to obtain the repository interface from repository factory beans) and cause a NullPointerException.  We now forward AnnotatedBeanDefinitions as is and only apply the custom lookup for everything else, i.e. the bean definitions used for the factories.", "Bears-89": "DATACMNS-1138 - TypeInformation.specialize(…) now only specializes unresolved parameterized types.  Type specialization - i.e. enrichment of a raw type with a current generic context - is now only done if the current type is not yet resolved completely. This allows wildcarded target references to just fall back to the type to specialize, which will then by definition carry more generics information than the one to be specialized.", "Bears-90": "DATACMNS-1139 - AbstractPersistentProperty.getRawType() now correctly resolves generics.  We're now favoring the generic TypeInformation over trying to resolve the property type via field or PropertyDescriptor as only the former does proper generic type resolution.", "Bears-91": "DATACMNS-1152 - Setup of ProjectingJackson2HttpMessageConverter now tries to use unique ObjectMapper from ApplicationContext.  We're now trying to look up a uniquely available ObjectMapper instance from the application context falling back to a simple new instance in case none can be found.", "Bears-92": "DATACMNS-1173 - Fixed value lookup of AnnotationRevisionMetadata.  Fixed handling of absent values. Minor refactorings. More unit tests.", "Bears-93": "DATACMNS-1175 - Remove argument array caching from EntityInstantiators.  We no longer cache argument arrays in our EntityInstantiators to prevent changes to shared mutable state caused by reentrant calls.  Previously, a re-entrant call requesting an argument array of the same size as a previous call in the call stack reused the same array instance. Changes to this shared mutable state by multiple invocations caused an invalid state rendering wrong parameters for object instantiation. Removing the caching and only reusing an empty array for zero-arg constructors is the only safe approach for now.  Re-instantiation of object allocations results in a higher GC pressure but guarantee side effect-free instantiation and should be on-par with previous versions performance profile.  Original pull request: #247.", "Bears-94": "DATACMNS-1196 - Fixed generics lookup for nested generics in ParameterizedTypeInformation.  We now eagerly resolve a generics declaration chain, which we previously - erroneously - expected GenericTypeResolver to do for us. Simplified TypeVariableTypeInformation implementation. Renamed ParameterizedTypeUnitTests to ParameterizedTypeInformationUnitTests.", "Bears-95": "DATACMNS-1201 - Support generated property accessors for types in default packages.  We now support generated property accessors for types that reside in the default package.  Original pull request: #256.", "Bears-96": "DATACMNS-1215 - Fixed repository lookup for proxy domain classes.  We now consistently use the user class for repository (metadata) lookup in Repositories.", "Bears-97": "DATACMNS-563 - PagedResourcesAssembler now correctly forwards one-index settings to PageMetadata.  Original pull request: #267.", "Bears-98": "Another small GoSafe fix", "Bears-99": "Better handle H02 X mode (fix #2780)", "Bears-100": "Merge pull request #2833 from Abyss777/fix_ignition  Rise ignition events only if both positions has ignition attribute", "Bears-101": "Fix GL200 wifi message parsing", "Bears-102": "Remove some Teltonika params", "Bears-103": "Ensure that odometer is a number (fix #2967)", "Bears-104": "Add Suntech HBM flag", "Bears-105": "Handle no power value from Telic", "Bears-106": "Fix another Telic issue", "Bears-107": "Handle empty Starlink cell info", "Bears-108": "Import cGuard protocol decoder (fix #3080)", "Bears-109": "Fix ST940 Alert decoding", "Bears-110": "Fix H02 status code decoding", "Bears-111": "Fix TLT2H time regex pattern", "Bears-112": "Fix Antlanta L-100 regex pattern", "Bears-113": "Fix PT502 coordinates decoding", "Bears-114": "Handle StarLink no location data", "Bears-115": "Handle full Watch message", "Bears-116": "Fix MU-201 message decoding (fix #3220)", "Bears-117": "Fix GPS103 OBD message decoding", "Bears-118": "Merge pull request #3253 from 5of9/master  Filter Invalid upgrade and Wondex fix", "Bears-119": "Fix H02 short message handling", "Bears-120": "Merge pull request #3306 from ckrey/Aplicom-fix  Ignore Aplicom Alive messages", "Bears-121": "Fix all protocol unit tests", "Bears-122": "Fix GL300VC decoding issue", "Bears-123": "Merge pull request #3450 from Abyss777/fix_trip_detector  Fix trips and stops detector", "Bears-124": "Handle eSky negative coords", "Bears-125": "Decode negative temperature", "Bears-126": "Merge pull request #3481 from AnshulJain1985/GT06_Alarm  GT06 alarm packet issue", "Bears-127": "Handle GOOME status message", "Bears-128": "Fix H02 simple message decoding", "Bears-129": "Fix GV200 INF message decoding", "Bears-130": "Handle MVT380 no power value", "Bears-131": "Fix Meitrack temperature (fix #3604)", "Bears-132": "Fix GV65+ ERI message decoding", "Bears-133": "Fix JT600 frame decoder", "Bears-134": "Handle invalid battery level", "Bears-135": "Fix TMG frame decoder", "Bears-136": "Fix eelink udp length field", "Bears-137": "Fix Totem AT09 frames decoding", "Bears-138": "Fix GK310 A2 decoding", "Bears-139": "Handle missing T333 taxi info", "Bears-140": "Added Unit Tests - H2MS Utils", "Bears-141": "Merge pull request #64 from stbenjam/lowercase  Store and retrieve username by lower case", "Bears-142": "Merge pull request #1831 from cristianflorescu/ACT-4316-boundary-event  ACT-4316 set user task end time when it is completed", "Bears-143": "Merge 48411b105afda985655abc7226ac1b6cc3831575 into 8a10eb685b9853a646dcf76b325635ee7bb44b3e", "Bears-144": "Temp fix for corr error in build", "Bears-145": "Spdz dummy triple gen", "Bears-146": "Fix mascot input mask gen", "Bears-147": "Random bit mask test", "Bears-148": "Fix up compuin96", "Bears-149": "Merge pull request #1204, condition router match `default.xxx'  Fixes #1201", "Bears-150": "    #1411: Locale deserialize 'zh-hant_CN'", "Bears-151": "merge issue 1401 to 2.5.x (#1460)  * merge issue 1401 to 2.5.x    * modify    * sync test case from master", "Bears-152": "Merge pull request #1607, graceful shutdown enhancement.  - Remove exporter destroy logic in AnnotationBean.  - Waiting for registry notification on consumer side by checking channel state.", "Bears-153": "[SCB-264] fix microservice description register problem", "Bears-154": "[SCB-521] Config of Spring Boot should takes higher priority than microservice.yaml", "Bears-155": "OAK-6392: Partial lastRev update with branches disabled  Merge revision 1799861 from trunk and enable test  git-svn-id: https://svn.apache.org/repos/asf/jackrabbit/oak/branches/1.0@1825038 13f79535-47bb-0310-9956-ffa450edef68", "Bears-156": "[#519] Little cleanup and ensure tests run on all supported DBMS", "Bears-157": "fix test", "Bears-158": "make tests green", "Bears-159": "DBZ-525 Timestamp supports optional microseconds part", "Bears-160": "DBZ-524 RESTRICT in DROP COLUMN", "Bears-161": "DBZ-530 Multiple PARTITION defintions supported", "Bears-162": "DBZ-615 Init unset Decimal props to default values", "Bears-163": "DBZ-660 Fix for CONSTRAINT UNIQUE syntax", "Bears-164": "DBZ-671 Date/time parsing covers more exotic formats", "Bears-165": "Fix DataElementOperand so default COC does not equal no COC (#1723)  (cherry picked from commit 6c3377a4155070781b259059935941938d092203)", "Bears-166": "Copy phase in Status copy constructor  This fixes #927", "Bears-167": "Enhance address validation in REST API  * Ensure no duplicate addresses within new addresses * Ensure no duplicate addresses in new addresses and existing addresses  This fixes #931", "Bears-168": "Validate required fields and provide correct HTTP response on validation errors  Fixes #1082", "Bears-169": "Fix LLC consumer to handle segment build fails gracefully (#2499)  * Fix LLC consumer to handle segment build fails gracefully    If segment build fails then we used throw NPE while tyring to delete a null file name.  Fixed the condition, and added a test.  We now handle the condition gracefully, and also set LLC_PARTITION_CONSUMING gauge to 0  so that we can alert on the partition that stopped consumption.    * Modified comment", "Bears-170": "Merge pull request #7125 from Mark-de-Haan/fix/7110  Fix #7110 A mapping service mapping error has its toString value inserted into an integrated dataset", "Bears-171": "Merge pull request #7274 from dennishendriksen/fix/7183-csvImportRowMissing  Fix #7183 CSV read exception on #values mismatch with #headers", "Bears-172": "Fix #7263 Row-level secured findOne: return first readable entity", "Bears-173": "Merge pull request #7277 from dennishendriksen/fix/6906-emxDuplicateColIds  Fix #6906 Duplicate col header exception for CSV and Excel repository", "Bears-174": "Merge pull request #7303 from dennishendriksen/fix/7297-oneToManyIntIds  Fix #7297 One-to-many with integer ids retrieval", "Bears-175": "Merge pull request #7320 from dennishendriksen/fix/6945-emxAbstractEntityTypeData  Fix #6945 NPE importing EMX with abtract entity type data", "Bears-176": "Fixes stackoverflow bug", "Bears-177": "Properly handle parameter counts for constructors with synthetic parameters.", "Bears-178": "Added check for illegal instance call from static method.", "Bears-179": "Do not resolve methods that are declared by java.lang.Object to invokeinterface calls even if those methods are invoked on an interface.", "Bears-180": "Fix NPE for GCS buckets that have underscores (#316)  Fixes #314.", "Bears-181": "Close the ResultSet (#469)  This commit makes sure that the `ResultSet` internally created by  `count` is closed.", "Bears-182": "Fixed issue with secondary index force usage in SQL (#564)", "Bears-183": "Spanner pageable options fix (#596)", "Bears-184": "DATAJPA-658 - Fixed potential NullPointerException in JpaMetamodel.  When iterating over EntityType<?> we need to guard against ….getJavaType() returning null. That seems to be the case for Hibernate Envers which apparently registers EntityType instances without a backing type.  Original pull request: #146.", "Bears-185": "DATAJPA-928 - Enabled native query with Pageable.  Just removed the check that was actively preventing the use of Pageable. Migrated to tests to AssertJ where applicable.  Original pull request: #246.", "Bears-186": "Issue-7438 Fix that prevents generating interfaces when interfaceOnly is false. (#7439)", "Bears-187": "Merge pull request #8003 from swagger-api/issue-7999  show number as strings", "Bears-188": "Replaced paintComponent(Graphics g) called method with repaint() method.", "Bears-189": "Change to pass tests", "Bears-190": "NodeStatus: Handle hostnames in endpointsStatus output  Cassandra does a ipAddress.toString() when creating the output for FailureDetectorMBean.getAllEndpointStates(), which can make the ip address header lines look like: hostname/<ipaddress>  It also does the same for the key in FailureDetectorMBean.getSimpleStates()  Changed code to not use regexes to split getAllEndpointStates() output but instead to group them into strings by looking for lines that don't start with two spaces and treating those as record \"starts\". Hostnames are stripped from the header lines if present. getSimpleStates() keys are also sanitized of hostnames.  Added a test with hostnames in the output from getAllEndpointStates() and getSimpleStates()", "Bears-191": "Try to show IPv6 endpoints in UI correctly", "Bears-192": "Fix duration issues in the UI  Timezone shenanigans between the server and the UI can lead to inconsistent display of ETA or duration. The repair run status is now shipping with a currentTime value that is generated on the server side to match the startTime/endTime/pauseTime timezones and allow consistent diffs to be made.", "Bears-193": "fixing bean definitions", "Bears-194": "re-check for sanitized arguments", "Bears-195": "Merge 9a855c7082bd2b6152faa16dbf4df40acc7453c3 into f2d73f7914c03cc95b884b69b3e660ee0a7ae033", "Bears-196": "Merge branch 'enumconverter-vs-null' of https://github.com/peculater/incubator-tamaya", "Bears-197": "Merge pull request #248 from SmithJosh/respect-path-in-servername-config  Include serverName path when constructing service url", "Bears-198": "Bug fix, where a builder had copied one field twice and omitted the copy of another field.", "Bears-199": "Remove a possible deadlock on polling queue fill (#462)  * Remove a possible deadlock on polling queue fill    Adding new items to the receive queue for the PrefetchRecordsPublisher  when at capacity would deadlock retrievals as it was already holding  a lock on this.    The method addArrivedRecordsInput did not need to be synchronized on  this as it didn't change any of the protected  state (requestedResponses).  There is a call to drainQueueForRequests  immediately after the addArrivedRecordsInput that will ensure newly  arrived data is dispatched.    This fixes #448    * Small fix on the reasoning comment    * Adjust the test to act more like the ShardConsumer    The ShardConsuemr, which is the principal user of the  PrefetchRecordsPublisher, uses RxJava to consume from publisher. This  test uses RxJava to consume, and notifies the test thread once  MAX_ITEMS * 3 have been received. This ensures that we cycle through  the queue at least 3 times.    * Removed the upper limit on the retrievals    The way RxJava's request management makes it possible that more  requests than we might expect can happen.", "Bears-200": "Merge pull request #884 from AxonFramework/bugfix/883  Do not try to convert a null source, provide an empty string instead.", "Bears-201": "Fix unit test breakage.", "Bears-202": "Merge pull request #278 from larsgrefer/fix/gh-277  Fix #277", "Bears-203": "make test green", "Bears-204": "Added equals methods to pass tests", "Bears-205": "Merge pull request #1586 from zouyx/master  Block delete default cluster", "Bears-206": "#180 - Tests and fixes around rtl overflow pages.", "Bears-207": "Merge 59cc404c100c6be2544fe52529e4cbb049343293 into ad529743c8029074d7ab59f2d1b471572b49a2aa", "Bears-208": "DBZ-927 Gracefully handling invalid default values for timestamp fields", "Bears-209": "Improved eviction strategy for lock holder - Locks that doesn't hold by any thread and neither one thread are waiting to acquire this lock - Implemented logic in accordance with specifications", "Bears-210": "Merge branch 'master' of https://github.com/dungba88/libra", "Bears-211": "Fix #153", "Bears-212": "Merge pull request #112 from vboulaye/closed-stream-when-autoclose-disabled  fix #99 do not close stream when autoclose is disabled in yaml generator/parser", "Bears-213": "Merge pull request #3 from fraenkelc/pageable_on_custom_method  Pageable on custom method", "Bears-214": "Merge branch 'null-rackId' into staging", "Bears-215": "fix(ImportScanner): unused imports should not be added (#2486)", "Bears-216": "fix: compiled snippets have no parent (#2503)", "Bears-217": "Merge aa1b0121e34ba490729b07019fc5188c25fb3102 into 51e64eb8924b7a33d4d87608d0e83f374e82c0ef", "Bears-218": "fix: CtPackageDeclaration has a valid source position (#2760)", "Bears-219": "fix: parsing of java version not starting with \"1.\" in pom.xml (#2729)  * Check if java.version contains a dot in pom.xml    * cover all cases and added an Assert in MavenLauncherTest    * (style) added a missing whitespace    fix #2714", "Bears-220": "Fix array convertion in U.toXml(map).", "Bears-221": "[JENKINS-54133] Pregenerating console notes sent to agents for some common cases (#128)  * [JENKINS-54133] Pregenerating console notes sent to agents for some common cases.    * Changelog entry.", "Bears-222": "Fixed bug in Watts-Strogatz Generator (#699)  * Fixed bug in Watts-Strogatz Generator     The problem manifested when the vertices are not integers.    * Minor optimization", "Bears-223": "Merge pull request #4 from julianps/Fix-null-value-Issue  Fixed npe when context holds a null source-value", "Bears-224": "added tests for pipelines and fixed the problem of encountering runtime exceptions", "Bears-225": "Consider value multiplicity in reactive output resolution #879  Lettuce now checks for the value multiplicity when resolving the actual output type for reactive Redis commands methods.  Previously, all reactive types were considered streaming ones which caused usage of a not applicable output type. So Mono<String> used KeyListOutput which propagated null values.", "Bears-226": "Test fix.", "Bears-227": "Filter out sythetic fields from FieldQueryMapEncoder (#840)", "Bears-228": "HTML-678: When editing existing encounter, time component of encounter datetime should not be lost", "Bears-229": "RESTWS-740: ObsResource.setConcept should support reposted data (maps) (#362)", "Bears-230": "Fixes #4 : protect against possible contractual null values returned by different method from the jdbc interface. Update various dependencies", "Bears-231": "Added tests for empty and string assign.", "Bears-232": "Merge pull request #4 from paritytrading/fixes/byte-arrays-pack  Fix 'ByteArrays#pack'", "Bears-233": "Merge 3e676728a435e8b3368e179e869c15610624dfc0 into aff3d736775a247f6c54876e8a50d0789ac8a7b1", "Bears-234": "Transfer Service Test - Account disabled", "Bears-235": "Account Manager Test - forbid disable parent account when at leat one of its children is enabled", "Bears-236": "Fix handling of inconsistent inner type attribute as it is sometimes generated by Scalac.", "Bears-237": "Allow field access for static fields outside of type hierarchy.", "Bears-238": "Fixed primitive ignoring bug", "Bears-239": "Merge 69398d6b3a318b3f768c235a03fba44302dabd8a into 81e8257c4386d0821faaf2ec1110a8e1f4b2493e", "Bears-240": "Context must read system properties to rewrite properties from file.  Close #58", "Bears-241": "Issue15 - handle pull request title (#16)  * upgrading to ci-droid-api.version 1.0.4    * fixes https://github.com/societe-generale/ci-droid-tasks-consumer/issues/15", "Bears-242": "Merge pull request #1559 from ivangalkin/fix_1557  Fix MethodName for nested classes", "Bears-243": "[bugfix, critical] the Operations from AllOps have NULL the dst node. (#49)  The root has all info. The reason is the metadata is written after  converting to spoon all ops, and before the convertion of root.", "Bears-244": "DATACMNS-1422 - Fall back to reflection-based PropertyAccessor/EntityInstantiator on inaccessible framework types.  We now fall back to reflection-based PropertyAccessor/EntityInstantiator strategies when framework types are not visible by the entity's ClassLoader.  Typically, we use class generation to create and load PropertyAccessor and EntityInstantiator classes to bypass reflection. Generated types are injected into the ClassLoader that has loaded the actual entity. Generated classes implement framework types such as ObjectInstantiator and these interfaces must be visible to the ClassLoader that hosts the generated class. Some arrangements, such as OSGi isolate class repositories so the OSGi class loader cannot load our own types which prevents loading the generated class.  Original pull request: #324.", "Bears-245": "Check parameter Modifiers (#678)  * Check parameter modifiers for non final modifiers    Signed-off-by: shaishavgandhi05 <shaishgandhi@gmail.com>    * Add extra line    Signed-off-by: shaishavgandhi05 <shaishgandhi@gmail.com>    * Fix formatting    Signed-off-by: shaishavgandhi05 <shaishgandhi@gmail.com>", "Bears-246": "Merge pull request #157 from haering/master  Start/Resume Playback position_ms has to be a body parameter", "Bears-247": "Merge pull request #145 from tsegismont/issue/140  One shot update actions should return generated keys by default", "Bears-248": "Added a test for redirection limit in WebClient", "Bears-249": "Refactor tests", "Bears-250": "Fix vector creation with unordered maps (#291)  Signed-off-by: Ashok Bommisetti <ashok@shapesecurity.com>", "Bears-251": "Minor bug fix"}